{
  "title": "Action VI Bulk Freighter",
  "pageId": 5508,
  "revisionId": 32665,
  "wikitext": "[[File:action6.jpg|500px|thumb|right]]\n\n'''Action VI Bulk Freighter'''<br />'''Craft''': Corellian Action VI Transport<br />'''Affiliation''': General / Rebel Alliance<br />'''Era''': Rise of the Empire<br />'''Source''': Rebel Alliance Sourcebook (pages 136-137), Pirates & Privateers (page 69), Heir to the Empire Sourcebook (pages 130-131), The Essential Guide to Vehicles and Vessels (pages 190-191)<br />'''Type''': Medium bulk freighter<br />'''Scale''': Capital<br />'''Length''': 125 meters<br />'''Skill''': Space transports: Action VI transport<br />'''Crew''': 10, '''skeleton''': 6/+10<br />'''Crew Skill''': Astrogation 3D, capital ship shields 2D+2, space transports 3D<br />'''Cargo Capacity''': 90,000 metric tons<br />'''Consumables''': 3 months<br />'''Cost''': 1,000,000 (new), 500,000 (used)<br />'''Hyperdrive Multiplier''': x3<br />'''Nav Computer''': No (uses droid or starport computations)<br />'''Space''': 2<br />'''Atmosphere''': 225; 650 kmh<br />'''Hull''': 3D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 20/0D\n*Scan: 30/1D\n*Search: 40/1D+1\n*Focus: 1/2D\n\n'''Description''': The Action VI transport, sometimes referred to as the bulk transport and the modified action transport, was a popular freighter built by Corellian Engineering Corporation. \n\nAction VI transports typically operated in convoys or in well patrolled areas of space. Since they lacked even the most basic forms of self-defensive measures, such as armor and weaponry, they were often prime targets for pirates and so had to rely on protection from other capital ships and starfighter escorts. The only reason they were used by the Galactic Empire was because they were quite inexpensive relative to Imperial wealth. One of these ships once crashed on Blenjeel, after crossing paths with an Immobilizer 418 cruiser. \n\nThe Rebel Alliance also employed these cargo vessels, often as personnel carriers, but in much smaller quantities since they were far more expensive than GR-75 medium transports. Most Action VIs were stolen from the Empire.\n\nPirates often modified Action VI ships into \"interceptor frigates\" capable of combating corvettes. The most famous Action VI was Wild Karrde, the personal starship owned by smuggler Talon Karrde.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Action%20VI%20Bulk%20Freighter",
  "retrievedAt": "2025-10-08T08:29:43.019Z"
}