{
  "title": "Aethersprite Delta-7",
  "pageId": 5202,
  "revisionId": 12112,
  "wikitext": "[[File:Aethersprite-Delta-7-1.jpg|thumb|500px]]\n[[File:Aethersprite-Delta-7-2.jpg|thumb|500px]]\n[[File:Aethersprite-Delta-7-3.jpg|thumb|500px]]\n\n'''Aethersprite Delta-7'''<br />'''Craft''': Kuat Systems Engineering Delta-7 Aethersprite-class Starfighter<br />'''Affiliation''': Jedi Order<br />'''Era''': Rise of the Empire<br />'''Source''': d20 Rulebook (page 229)<br />'''Type''': Starfighter<br />'''Scale''': Starfighter<br />'''Length''': 8 meters<br />'''Skill''': Starfighter piloting: Delta-7<br />'''Crew''': 1 and modified astromech droid (can coordinate)<br />'''Crew Skill''': All skills typically at 4D<br />'''Cargo Capacity''': 60 kilograms<br />'''Consumables''': 1 week<br />'''Cost''': 180,000 (new), 145,000 (used), both prices are black market value<br />'''Hyperdrive Multiplier''': x1 (with booster ring, see below)<br />'''Nav Computer''': Uses a modified astromech droid programmed with 10 jumps<br />'''Maneuverability''': 3D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 kmh<br />'''Hull''': 2D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 25/1D\n*Scan: 45/2D\n*Search: 65/2D+2\n*Focus: 3/3D+1\n'''Weapons''':\n*2 Dual Lasers (fire-linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 6D\n'''Notes''': The Delta-7 requires a separate hyperdrive module in the form of a booster ring (the TransGalMeg Industries hyperdrive booster ring). Docking with the ring takes 3 rounds to accomplish, and requires a Difficult starfighter piloting skill check (the fighter’s maneuverability counts for this roll). Additionally, the Delta-7 incorporates a specially designed astromech droid (R4-P series), which is hardwired into the starfighter. Without the proper droid, the pilot suffers a -1D penalty to his astrogation skill checks. The droid suffers the same penalty to both its astrogation and starfighter repair skill checks.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Aethersprite%20Delta-7",
  "retrievedAt": "2025-10-08T13:05:57.160Z"
}