{
  "title": "Assault Shuttle",
  "pageId": 5584,
  "revisionId": 10711,
  "wikitext": "[[File:TelgornCorpGamma-classAssaultShuttle.jpg|400px|thumb|right]]\n\n'''Assault Shuttle'''<br />'''Craft''': Telgorn Corp Gamma-class Assault Shuttle<br />'''Affiliation''': Empire<br />'''Era''': Rise of the Empire<br />'''Source''': Imperial Sourcebook (pages 49-50), Starships of the Galaxy (page 78)<br />'''Type''': Assault shuttle<br />'''Scale''': Capital (due to power output)<br />'''Length''': 30 meters<br />'''Skill''': Space transports: assault shuttle<br />'''Crew''': 2, '''gunners''': 3, '''skeleton''': 1/+10<br />'''Crew Skill''': Capital ship gunnery 3D+2, capital ship shields 4D, space transports 5D<br />'''Passengers''': 40 (spacetroopers)<br />'''Cargo Capacity''': 5 metric tons<br />'''Consumables''': 1 week<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x18<br />'''Nav Computer''': Limited to 3 jumps<br />'''Maneuverability''': 2D<br />'''Space''': 8<br />'''Hull''': 3D+2<br />'''Shields''': 4D+2<br />'''Sensors''':\n*Passive: 40/1D\n*Scan: 80/1D+2\n*Search: 130/3D\n*Focus: 4/3D\n'''Weapons''':\n*'''4 Laser Cannons'''\n: Fire Arc: Turret<br />Crew: 2 guns are handled by “gunner 1,” two guns are<br />handled by “gunner 2”<br />Skill: Capital ship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 2D\n*'''Tractor Beam Projector'''\n: Fire Arc: Front<br />Crew: 1 (gunner 3)<br />Skill: Capital ship gunnery<br />Fire Control: 4D<br />Space Range: 1-5/15/30<br />Atmosphere Range: 100-500/1.5/3 km<br />Damage: 5D+2\n*'''Concussion Missile Launcher'''\n: Fire Arc: Front<br />Crew: 1 (gunner 3)<br />Skill: Capital ship gunnery<br />Fire Control: 2D+1<br />Space Range: 1-2/8/15<br />Atmosphere Range: 100-200/800/1.5 km<br />Damage: 4D\n\n'''Capsule''': In a standard operation, a Gamma-class assault shuttle would pull up near an enemy ship and take hold of it with either its tractor beam or power harpoon. It would then launch its spacetroopers to seize control of the vessel, sometimes crippling the ship beforehand with a few well-placed turbolaser shots.\n\nThese ships were composed of three sections. The first section was the command crew cockpit, where a crew of five not only controlled the shuttle, but monitored its spacetroopers as well. The second section, the main body, was where the spacetroopers were carried. There were forty holding compartments for spacetrooper armor, enough for an entire platoon.\n\nWhile being stored in the assault shuttle, the spacetroopers' power armor was constantly being recharged. Each compartment was equipped with a fold-away door, allowing the shuttle to quickly launch its troopers into space. \n\nTo protect its valuable cargo of elite spacetroopers, assault shuttles were very well shielded. Unlike most combat ships, which devoted 25% of their power to shields, the shields of a Gamma-class assault shuttle took up a full 62% of its power, with over half of that directed to the ship's front arc. This allowed assault shuttles to withstand heavy damage as they pulled up near hostile ships.\n\nGamma-class assault shuttles were both atmosphere and space capable. They were equipped with Class 2 hyperdrives (Class 18 backup). However, their capability for hyperspace travel was limited, because their nav computers could only hold enough data for three jumps. \n\n'''History''': Most Imperial-class Star Destroyers and other large warships carried at least one Gamma-class assault shuttle as well as the corresponding spacetrooper platoon. Additional assault shuttles were given out as needed and available.\n\nIn 1 BBY, a Gamma-class assault shuttle pursued a Rebel freighter carrying stolen Imperial fuel slugs from the jungles of Oulanne to the space city Pellezara station in the Duro system. The seventeen-year-old Tarrin Datch took control of the fugitive Rebel ship, outmaneuvering the shuttle through heavy traffic until it could escape into hyperspace.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Assault%20Shuttle",
  "retrievedAt": "2025-10-10T19:11:03.973Z"
}