{
  "title": "Assault Shuttle Beta",
  "pageId": 5582,
  "revisionId": 10708,
  "wikitext": "'''Assault Shuttle Beta'''<br />'''Craft''': Telgorn Corp Beta class Assault Shuttle<br />'''Affiliation''': Empire<br />'''Era''': Rise of the Empire<br />'''Source''': The Last Command Sourcebook (page 131), The Thrawn Trilogy Sourcebook (pages 235, 237)<br />'''Type''': Assault shuttle<br />'''Scale''': Capital (due to power output)<br />'''Length''': 30 meters<br />'''Skill''': Space transports: assault shuttle<br />'''Crew''': 5, '''skeleton''': 3/+10<br />'''Crew Skill''': Varies, but typically capital ship gunnery 5D, capital ship shields 4D, space transports 5D+1<br />'''Passengers''': 40 (spacetroopers)<br />'''Cargo Capacity''': 500 kilograms<br />'''Consumables''': 5 days<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x3<br />'''Nav Computer''': Limited to 3 jumps<br />'''Maneuverability''': 1D+2<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 kmh<br />'''Hull''': 3D<br />'''Shields''': 3D+2<br />'''Sensors''':\n*Passive: 20/0D\n*Scan: 40/1D\n*Search: 60/2D\n*Focus: 3/3D\n'''Weapons''':\n*'''4 Laser Cannons'''\n: Fire Arc: 2 front, 2 rear<br />Skill: Capital ship gunnery<br />Fire Control: 2D<br />Space Range: 1-5/10/17<br />Atmosphere Range: 100-500/1/1.7 km<br />Damage: 1D+2\n*'''Tractor Beam Projector'''\n: Fire Arc: Front<br />Skill: Capital ship gunnery<br />Fire Control: 3D<br />Space Range: 1-5/15/30<br />Atmosphere Range: 100-500/1.5/3 km<br />Damage: 5D\n*'''Concussion Missile Launcher'''\n: Fire Arc: Front<br />Skill: Capital ship gunnery<br />Fire Control: 2D<br />Space Range: 1-5/10/17<br />Atmosphere Range: 100-500/1/1.7 km<br />Damage: 3D+2\n\n'''Capsule''': The Beta-class assault shuttle was an Imperial shuttle and a direct predecessor to the Gamma-class assault shuttle.\n\nIt had a modular hull structure - a front 5-person command pod and aft engine section were permanent, while the central section could be reconfigured according to mission requirements. A spacetrooper module could carry 40 spacetroopers in their armors, sporting separate launching pods and power couplers for recharging the space suits. Standard troop transport configuration had place for 68 troopers (possibly stormtroopers) with necessary equipment. There were also cargo modules available for turning the ship into transport duty, or additional weapon pods to reconfigure the Beta into a more powerful gunship (its basic armament in non-gunship configuration consisted of four laser cannons, one concussion missile launcher and one tractor beam projector, making it an efficient combat craft in itself).\n\nBeta-class assault shuttles were both atmosphere and space capable, and had a limited hyperspace capability with Class 3 hyperdrive and a navigation computer limited to 3 jumps.\n\nDownside to the modular construction of the ship was that the stressess spread along its frame, originating in the modular coupling system, made it require a complete refitting after a 2-year-long period of service. This led to the introduction of the Gamma-class assault shuttle with permanent spacetrooper hold. Other roles of Beta-class shuttles were taken up by other classes of space transports.\n\nMost of Betas were removed from service with the introduction of Gammas, but their career came to a revival with the campaign of Grand Admiral Thrawn against the New Republic five years after the Battle of Endor. They were used mostly as boarding craft and transport troopships.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Assault%20Shuttle%20Beta",
  "retrievedAt": "2025-10-10T19:11:04.969Z"
}