{
  "title": "Assault Shuttle Delta class",
  "pageId": 5583,
  "revisionId": 10709,
  "wikitext": "[[File:AssaultShuttleDeltaclass.jpg|400px|thumb|right]]\n\n'''Craft''':Delta Class Shuttle<br />'''Type''':Telgorn Corp. Assault Shuttle<br />'''Scale''': Capital (Due to power output)<br />'''Length''':17 meters<br />'''Skill''':Starfighter Piloting<br />'''Crew''':1<br />'''Passengers''': 8 (Including pilot)<br />'''Cargo Capacity''': 50 kg<br />'''Consumables''':None<br />'''Cost''':Not For Sale<br />'''Hyperdrive''': None<br />'''Backup Hyperdrive''':None<br />'''Nav Computer''':No<br />'''Maneuverability''':2D+2<br />'''Space''':11<br />'''Hull''':4D<br />'''Shields''':1D+2*<br />'''Sensors''':\n*Passive:10/0D\n*Scan:30/1D+2\n*Search:50/2D\n*Focus:1/3D\n\n'''Capsule''': This design offered by the engineers at Telgorn Corp. was intended to capture the attention of the Imperial Navy and be as popular and the Gamma Class Assault shuttle. But to the dismay of the designers and executives at Telgorn it never achieved its intended operational status. Designed around the idea of inserting a small commando type team onto a ship quickly and stealthily the Delta class shuttle is 70% subspace engines. Its operational procedure would be that it is launched from a parent ship, most likely a Star Destroyer and streaks towards its intended target with the commando team aboard.\n\nIntended to use to board ships so that the enemy is unaware until it is too late, this shuttle is equipped with a proton charged nose cone that allows it to bore straight through the targets particle shields. Within one second after penetrating the shields the assault shuttle impacts with the targets hull. The shape of the nose cone in conjunction with the proton charge allow it to easily penetrate the hull. The shuttle is equipped with special inertial dampening shields as well as modified grav-couches to protect the commando team inside.\n\nIn theory this was a wonderful idea, but almost all modern combat ships are able to detect when the hull is breached, requiring that diversionary combat tactics by the Navy. When employed alone the amount of time the commando team has to complete its mission is seriously jeopardized because the target vessel can respond to the reported hull breach much quicker in a non-combat situation.\n\nAlso Navy planners could not see much use for the assault shuttle in the Order of Battle. The Navy felt that any ship worth capturing could be overpowered and boarded by stormtroopers with the same effect.\n\nThe program was scrapped by Telgron Corp. with the Empire reluctantly buying the 300 or so shuttles produced. After the Fall of the Empire, these shuttles made their way into the general public domain and saw tremendous demand by pirates as well as New Republic forces for obvious reasons.\n\n'''GAME NOTES:'''\n\nThe proton charge in the nose cone of the shuttle effectively does 9D capital scale damage to a localized and focused area. It should be kept in mind that this is for purposes of penetrating the shields and the hull. it is not an offensive weapon. A ship will not be taken down if the Delta shuttle is rammed into it. Special welding torches on the exterior of the shuttles hull weld the shuttle to the ship sealing the breach.<br />This also makes the Delta a one way ticket. It can be removed from th ship and refitted for flight but doing so takes a minimum of 24 hours of preparation. The inertial dampening shields are engaged automatically just before impact with the target vessel. They add an additional 5D to the shield code to protect the passengers.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Assault%20Shuttle%20Delta%20class",
  "retrievedAt": "2025-10-10T19:11:05.464Z"
}