{
  "title": "Asteroid Prospector AP-300",
  "pageId": 6895,
  "revisionId": 12256,
  "wikitext": "[[File:Asteroid-Prospector-AP-300.gif|thumb|500px|right]]\n\n'''Name''': Asteroid Prospector AP-300<br />'''Craft''': Kuat Drive Yards Asteroid Prospector AP-300<br />'''Type''': Asteroid Mining Starship<br />'''Scale''': Capital<br />'''Length''': 350 Meters<br />'''Skill''': Space transports: AP-300<br />'''Crew''': 536 : '''Gunners '''36; '''Skeleton''': 300 (+15 DIFFICULTY)<br />'''Crew Skill''': Space transports 3D, capital ship gunnery 3D, capital ship shields 2D and sensors 4D<br />'''Cost''': NEW 8,000,000 Credits USED 6,000,000 Credits<br />'''Passengers''': 50<br />'''Cargo Capacity''': 80,000 Metric Tons<br />'''Consumables''': 2 Years<br />'''Hyperdrive''': x3<br />'''Hyperdrive Backup''': x15<br />'''Nav Computer''': yes<br />'''Maneuverability''': 1D<br />'''Space''': 4<br />'''Atmosphere''': Cannot Enter Atmosphere<br />'''Hull''': 5D<br />'''Shields''': 3D<br />'''Sensors'''\n*Passive    : 45 /1D\n*Scan: 70 /2D\n*Search    : 120 /2D+2\n*Focus: 5 /3D\n'''Weapons'''\n*'''8 Laser Cannons''' [Fire Separately]\n: Fire Arc: 2 Forward, 2 Left, 2 Right, 2 Aft<br />Crew: 3 Gunners per cannon<br />Scale: Capital<br />Skill: Capital ship gunnery<br />Fire Control: 2D+2<br />Space Range: 1-5/10/17<br />Damage: 3D\n*'''4 Tractor Beam Projectors'''\n: Fire Arc: 2 Forward, 1 Left, 1 Right<br />Crew: 3 Gunners per projector<br />Scale: Capital<br />Skill: Capital ship gunnery<br />Fire Control: 0D<br />Space Range: 1-5/15/30<br />Damage: 4D\n\n'''Note''': PP incorrectly states Search: 120 Space Units/2D+1. Both sources gave no stats on tractor beam fire control.\n\nThe Asteroid Prospector AP-300 is designed to slowly comb through and extract mine-able ore from asteroid fields. Designed for small to mid-sized operations, these vessels may operate in solitude or in conjunction with ore haulers and other craft for larger mining operations. This vessel was on the market a few weeks after the Battle of Yavin.\n\nFor asteroids too large to haul in, the AP-300's laser cannon fire control crews coordinate their actions with the tractor beams to blast the target asteroid into smaller pieces, which are then collected. Metals and minerals are extracted from the asteroid, which are either stored onboard ship or transferred to ore haulers for immediate transport to refineries. The onboard refinery ensures that the extracted ore is at least 25% pure. Meanwhile, slag and other useless waste are ejected from the rear of the AP-300.\n\nDue to the hazardous nature of asteroid field mining operations, such as trapped explosive gasses in the asteroids, AP-300s boast medium weaponry, heavy hull plating, mighty shields and highly accurate sensors. Even with these advantages, a careless sensor operator may misread an asteroid which could cause significant damage to the vessel. It is up to the sensor operator to find those asteroids containing suitable quantities of ore. In some ways, the AP-300 represents a pirate's dream prize, as these ships can be found plying their trade alone in remote star systems.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Asteroid%20Prospector%20AP-300",
  "retrievedAt": "2025-10-08T08:29:48.393Z"
}