{
  "title": "B-wing",
  "pageId": 447,
  "revisionId": 20225,
  "wikitext": "==B-Wing Description==\n[[File:B-wing1.jpg|500px|thumb|right]]\n\nThe B-wing starfighter was one of the largest and most heavily armed starfighters/bombers in the Rebel Alliance's fleet. The name B-wing came from the craft's remote similarity in appearance to the lowercase letter \"b\", although its sword-like shape in attack mode has earned it the nickname \"blade-wing\", which may be another reason for the \"b\" prefix.\n\nKnown as \"crosses\" due to their distinct shape, the B-wing was designed by the Verpine company Slayn & Korpil in cooperation with then-Commander Ackbar as part of Project Shantipole. The B-wing, though difficult to fly, participated in numerous engagements across the galaxy during the latter parts of the Galactic Civil War, including the Battle of Endor and the liberation of Coruscant. The B-wing was used in its primary role of assault starfighter by both the New Republic and the Galactic Alliance throughout the Yuuzhan Vong War and beyond.\n\nLater models included a two-man version that could be used as a small transport.\n\nSomewhat reminiscent of the H-60 Tempest bomber, and using a wing configuration similar to Slayn & Korpil's earlier V-19 Torrent starfighter, the B-wing had a somewhat ungainly appearance resembling a top-heavy cross when fully unfurled.\n\nThe B-wing was a highly adaptable design, with modular hardpoints and other components. Its weapons could be reconfigured more easily than many other Alliance fighters. The B-wing also had a unique rotating cockpit module which was independently stabilized to allow the pilot to coordinate advanced flight and attack maneuvers. The fighter was powered by either of two engine systems: a Quadex Kyromaster engine with four thrust ports, or four Slayn & Korpil JZ-5 fusial thrust engines.\n\nThe B-wing was designed to replace the aging BTL Y-wing starfighter in the heavy assault role, as it had the advantage of more weaponry and stronger shields. However, the B-wing had several weaknesses, notably being difficult to fly and lacking speed and agility. Its large hull furthermore made it an easier target and it also had less armor protection. Consequently, it never fully succeeded supplanting the Y-wing as intended.\n\nIn particular, the rotating hull system made the B-wing a challenge to master. It also made the ship abnormally delicate; too many sharp turns could cause extreme strain to the spaceframe, and the cockpit rotation system could get stuck in one position. Only a few pilots were qualified to fly the ship before the Battle of Endor, resulting in a smaller number of B-wings present than expected. These difficulties forced the Rebel Alliance to invest in an upgraded Y-wing, rather than an entirely new ship, to fulfill their needs.\n\nLike its predecessor, the Y-wing, the cockpit could be detached from the rest of the ship, but unlike the Y-wing, the B-wing's cockpit could be ejected into space and support atmospheric re-entry.\n\nThe B-wing would go on to participate in many battles throughout the Galactic Civil War, and would lend design elements to other vessels. Sometime after the Battle of Hoth, the hull of a wrecked B-wing was used as the design prototype for the AHS-1 heavy assault airspeeder, and later models followed the same general design.\n\nhe B-wing carried an unusually high payload for its size, due to its designation as an assault fighter. As originally designed, the B-wing carried three ion cannons, two proton torpedo launchers, one laser cannon, and two auto-blasters. Most B-wings had their two auto-blasters replaced with laser cannons to improve survivability and firepower, though some B-wings had four auto-blasters. The B-wing was originally designed with a unique fire-control system which fires low-power lasers at a target to give the computer range and vector information for the torpedoes and ion cannons.\n\nWhile its strong deflector shields and great firepower allowed it to be somewhat survivable in fighter engagements, it usually required an escort on the way in. However, with the firepower of many naval corvettes, it fulfilled its purpose as a dangerous foe against many light capital ships.\n\nThe development of the B-wing began shortly after the Battle of Yavin. The small-unit starfighter tactics of the Rebellion were having a greater effect on the forces of the Imperial Navy than many Imperial commanders thought possible. As a response to this threat, the Empire began to produce and deploy more capital ships with a primary role of anti-starfighter defense. The primary vessel used for this strategy was the EF76 Nebulon-B escort frigate, a starship with which the Alliance was already quite familiar.\n\nThe Rebels couldn't afford to field the kind of overwhelming space forces that the Empire could bring to bear in fleet engagements. The Alliance's primary assault fighters, the outdated Y-wings, took large losses in capital ship assaults. A new tactic was needed if the Rebel Alliance Fleet was to continue having any impact on the galaxy.\n\nFortunately, one advantage the Rebels had over the Empire was their people. Approximately a year before the Battle of Yavin, the Rebels executed a raid on an Imperial Lambda-class shuttle carrying Wilhuff Tarkin and Bevel Lemelisk near Eriadu. The Alliance rescued the renowned Mon Calamari tactician Ackbar, in a military operation the Empire might not have bothered to commit for one of their own personnel. As a commander in the Alliance Fleet, Ackbar revolutionized the strategy and tactics of the Alliance.\n\nAckbar knew that the only solution to the Empire's new convoy defense plan was to either use equally powerful starships, which the Alliance could not afford to waste, or to create a starfighter especially for this purpose. Alliance High Command agreed, and placed Ackbar in charge of Project Shantipole. Ackbar went to the Roche system and enlisted the aid of the Verpine colonies of Slayn & Korpil.\n\nWorking under Ackbar's direction, Slayn & Korpil produced the first prototypes of the B-wing starfighter in the Roche asteroids. They were delivered to the Alliance despite Imperial interference. Imperial District Commander Bane Nothos was aware of the project, and decided to allow development to proceed so he could capture the fighters for the Empire. The Empire's efforts to capture the blueprints of the B-wing were actually foiled by the first combat flight of the original prototypes. A squadron of these prototypes was quickly put into service and christened Dagger Squadron.\n\nDespite its limited numbers at the time, it was a key Rebel craft in the Battle of Endor, where a squad of these fighters took down an Imperial II-class Star Destroyer. After the battle, the B-wing's modular design allowed it to be retrofitted with sprayers for firefighting duty on Endor, to extinguish the fires caused by the falling debris.\n\nB-wings continued to serve in the Rebel Alliance and later the New Republic and Galactic Alliance fleets as a heavy assault starfighter. B-wings were present in the Battle of Bakura. The B-wing fighter also featured significantly in the campaign against Warlord Zsinj, where the B-wings of Nova Squadron were instrumental in defeating Razor's Kiss and Iron Fist. General Salm's Defender Wing was partially retrofitted with B-wings during the campaign against Zsinj. Also, at least one squadron of B-wing starfighters was present at the liberation of Coruscant. A wing of B-wings would also serve against Delak Krennel and his Ciutric Hegemony.\n\nB-wing squadrons were present at the Battle of Almania, the Battle of Adumar, and in the defense of Mon Calamari during the Second Battle of Mon Calamari. Luke Skywalker flew a B-wing into Nam Chorios. As it was designed by Admiral Ackbar, the B-wing seems to have enjoyed high popularity among Mon Calamari pilots since Ackbar and Terpfen used expanded versions as their personal shuttles. Furthermore, there was a squadron present when Admiral Daala attacked Dac, and a Mon Calamari pilot flew a B-wing as part of the Second Battle of Borleias. Another group besides the New Republic noted for its use of the B-wing was the Verpine, who preferred to use the craft in high-speed bombing runs if defending their territory was necessary.\n\nSome B-wings would be modified to have a YT series cockpit and a turbolaser cannon, making them uglies. These were called Corellian/B-wing uglies. These modified B-wings were used by the Sacorrian Triad during the First Corellian Crisis, but were largely unsuccessful against the Bakuran fleet that opposed them.\n\nB-wings continued to play the vital role of heavy assault fighter for the New Republic and its successor, the Galactic Alliance, throughout the Yuuzhan Vong War in all major engagements, including the First and Second Battles of Coruscant, the Battle of Ebaq 9, and the Second Battle of Borleias. In a particular unique use during the latter instance, a Twin Suns pilot named Beelyath and his gunner, Sharr Latt, launched the decoy Goddess missile from his B-wing, luring several coralskippers to their doom.\n\nThe B-wing fighter continued to serve in the Galactic Alliance Fleet through the Dark Nest Crisis/Swarm War and the Second Galactic Civil War. It is the predecessor of the Besh-type personal starfighter.\n\n==B-Wing==\n'''Craft''': Slayn & Korpil B-Wing<br />'''Affiliation''': Rebel Alliance<br />'''Era''': Rebellion<br />'''Source''': Core Rulebook (page 248), Rebel Alliance Sourcebook (page 88), Star Wars Trilogy Sourcebook SE (pages 118-120), The Star Wars Sourcebook (pages 16-17), Galaxy Guide 5: Return of the Jedi (page 39), Heir to the Empire Sourcebook (page 136), The Thrawn Trilogy Sourcebook (page 225), Starships of the Galaxy (page 64), The Essential Guide to Vehicles and Vessels (pages 14-15)<br />'''Type''': Heavy assault starfighter<br />'''Scale''': Starfighter<br />'''Length''': 16.9 meters<br />'''Skill''': Starfighter piloting: B-wing<br />'''Crew''': 1<br />'''Crew Skill''': Starfighter piloting 5D, starship gunnery 4D+2, starship shields 3D+1<br />'''Cargo Capacity''': 45 kilograms<br />'''Consumables''': 1 week<br />'''Cost''': 220,000 (new)<br />'''Hyperdrive Multiplier''': x2<br />'''Nav Computer''': Yes (limited to 2 jumps)<br />'''Maneuverability''': 1D+1<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 kmh<br />'''Hull''': 3D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 30/0D\n*Scan: 50/1D\n*Search: 75/2D\n*Focus: 4/4D+1\n'''Weapons''':[[File:B-wing2.jpg|500px|thumb|right]]\n*'''Laser Cannon'''\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 1D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 7D\n*'''2 Proton Torpedo Launchers'''\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 1/3/7<br />Atmosphere Range: 50-100/300/700<br />Damage: 9D\n*'''3 Medium Ion Cannons'''\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 4D<br />Space Range: 1-3/7/15<br />Atmosphere Range: 100-300/700/3.6 km<br />Damage: 4D\n*'''2 Auto Blasters'''\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-8/25/40<br />Atmosphere Range: 100-800/2.5/4 km<br />Damage: 3D\n\n==B-Wing/E==\n[[File:B-wing1.jpg|500px|thumb|right]]\n\n'''Craft''': Slayn & Korpil [[B-wing]]/E Assault Fighter<br />'''Affiliation''': Rebel Alliance<br />'''Era''': Rebellion<br />'''Source''': The Jedi Academy Sourcebook (pages 125-126), Starships of the Galaxy (page 64), The Essential Guide to Vehicles and Vessels (pages 52-53)<br />'''Type''': Heavy assault starfighter<br />'''Scale''': Starfighter<br />'''Length''': 16.9 meters<br />'''Skill''': Starfighter piloting: B-wing<br />'''Crew''': 1, '''gunners''': 1<br />'''Crew Skill''': Starfighter piloting 4D+1, starship gunnery 4D+2, starship shields 3D<br />'''Cargo Capacity''': 50 kilograms<br />'''Consumables''': 1 week<br />'''Cost''': 250,000 (new)<br />'''Hyperdrive Multiplier''': x2<br />'''Nav Computer''': Yes (limited to 2 jumps)<br />'''Maneuverability''': 1D<br />'''Space''': 7<br />'''Atmosphere''': 350; 1,000 kmh<br />'''Hull''': 5D<br />'''Shields''': 2D+2<br />'''Sensors''':\n*Passive: 30/0D\n*Scan: 65/1D\n*Search: 80/2D\n*Focus: 4/3D+2\n'''Weapons''':\n*2 Laser Cannons (fire-linked)[[File:B-wing2.jpg|500px|thumb|right]]\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 1D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 8D\n*3 Medium Ion Cannons (fire-linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 4D<br />Space Range: 1-5/9/40<br />Atmosphere Range: 100-500/900/4 km<br />Damage: 4D\n*Proton Torpedo Launcher (8 torpedoes)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 1/5/9<br />Atmosphere Range: 50-100/500/900<br />Damage: 9D\n\n'''Note''': The New Republic B-Wing/E2 is identical to the B-Wing/E except that it adds a second proton torpedo launcher. The optional ammo magazine attachment carries 12 more proton torpedoes, but lowers the B-Wing/E2’s maneuverability to 0D+2.\n\n===Capsule===\nThe B-wing/E starfighter, or B-wing Expanded, was a modification to the original Slayn & Korpil B-wing design. The B-wing Expanded had an elongated cockpit that allowed a gunner to assist the pilot on missions. This allowed the pilot to concentrate on piloting, and resulted in the B-wing accounting for an increased number of kills in battle. It was faster and tougher than the original B-wing, but was somewhat less maneuverable. There were two models of B-wing/E—the first was simply a military ship, while the second generation (known as the B-wing/E2) was designed as a personal military shuttle. Ackbar used one of these E2-designs as his own shuttle, which he was forced to crash on the planet Vortex after it had been tampered with by Terpfen.\n\n=[[Running the B-wing]]=",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/B-wing",
  "retrievedAt": "2025-10-08T13:06:00.757Z"
}