{
  "title": "BR-23 Courier",
  "pageId": 5587,
  "revisionId": 10743,
  "wikitext": "[[File:BR-23Courier.jpg|500px|thumb|right]]\n\n'''BR-23 Courier'''<br />'''Craft''': Republic Sienar Systems BR-23 Courier<br />'''Affiliation''': Old Republic / Empire / General / Alliance<br />'''Era''': Old Republic<br />'''Source''': Rules of Engagement: The Rebel SpecForce Handbook (page 49)<br />'''Type''': Long-range troop transport<br />'''Scale''': Starfighter<br />'''Length''': 20.7 meters<br />'''Skill''': Space transports: BR-23 Courier<br />'''Crew''': 1, '''gunners''': 1<br />'''Crew Skill''': Varies<br />'''Passengers''': 40<br />'''Cargo Capacity''': 40 metric tons<br />'''Consumables''': 2 weeks<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x12<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 5<br />'''Atmosphere''': 295; 850 kmh<br />'''Hull''': 3D+2<br />'''Shields''': 1D+2<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':\n*2 Laser cannons\n: Fire Arc: Turret<br />Skill: Starship gunnery<br />Fire Control: 1D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 4D\n\n'''Capsule''': The BR-23 Courier was a durable personnel transport and courier ship that served in Old Republic fleets and militias. After finding the market for TIE/ln starfighters enormously more profitable due to the Empire's swift move away from transports like the BR-23, Sienar partially refitted its large back stock of BR-23s with civilian-grade systems and dumped them onto the open market. These inexpensive craft, which were easy to repair, proved to be a boon of profit for Sienar.\n\nWhile most of Sienar's surplus stock found its way into the freighter market, the BR-23 also saw use in cut-rate shuttle services and employment as personal skiffs. After leaving military service the BR-23 proved to be popular among courier services, small-time shipping agents, and a good number of smugglers. In the case of the Rebellion, they made it a general policy to acquire these ships where ever they could find them as they could be easily re-converted to their original troop transport duties.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/BR-23%20Courier",
  "retrievedAt": "2025-10-07T22:31:35.319Z"
}