{
  "title": "Cargo Empress Super Freighter",
  "pageId": 5535,
  "revisionId": 13676,
  "wikitext": "[[File:CargoEmpressSuperFreighter.gif|400px|thumb|right]]\n\n'''Cargo Empress Super Freighter'''<br />'''Craft''': Ghtroc Industries Cargo Empress-class Super Freighter<br />'''Affiliation''': General<br />'''Era''': Rise of the Empire<br />'''Source''': Pirates & Privateers (page 68)<br />'''Type''': Medium bulk freighter<br />'''Scale''': Starfighter<br />'''Length''': 110 meters<br />'''Skill''': Space transports: Cargo Empress freighter<br />'''Crew''': 4<br />'''Crew Skill''': Varies widely<br />'''Passengers:''' 8<br />'''Cargo Capacity''': 50,000 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': 1,000,000 (new), 825,000 (used)<br />'''Hyperdrive Multiplier''': x2<br />'''Nav Computer''': Yes<br />'''Space''': 2<br />'''Atmosphere''': 225; 650 kmh<br />'''Hull''': 3D+2<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 15/0D\n*Scan: 30/1D\n*Search: 40/2D\n*Focus: 2/2D\n\n'''Capsule''': The Ghtroc Industries Cargo Empress-class super freighter was a 110-meter long ship which carried 50,000 metric tons of cargo. It operated with a crew of four, and could carry up to eight passengers. Its defenses relied entirely on weak shields, as the ship was completely unarmed and had a weak hull.\n\nThe Cargo Empress was produced shortly after the introduction of the Class 720 freighter and was an attempt to capitalize on the smaller ship's modest success. However, the Cargo Empress sold poorly and was a major contributing factor to Ghtroc's bankruptcy. In a desperate attempt to pay off the company's debts, all remaining Cargo Empress-class ships were dumped on the market at very low prices. As a result, ships of the class could be found throughout the galaxy, despite their commercial failure.\n\n'''History''': Numerous rumors about the Cargo Empress circulated after the demise of Ghtroc Industries. Most involved mechanical failures, or hull cracks formed from torsional stress, and some involved passengers and crew not making it to the escape pods in time, perishing with the ship. Most Cargo Empress captains kept the escape pods in the forward sections of the cargo hold, and not in their stock location in the aft upper deck. This procedure was common practice in order to facilitate a quick escape in an emergency. Rumors from the Rebel Alliance reported that Imperial Intelligence sabotaged the Cargo Empress program with slanderous HoloNet news reports, and falsified fatality reports. Many theorized that the Empire saw the potential of these ships being converted into covert starfighter carriers, and were eliminated with financial warfare. Regardless the cause, the Cargo Empress was the last transport mass-produced by Ghtroc Industries prior to the corporate collapse.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Cargo%20Empress%20Super%20Freighter",
  "retrievedAt": "2025-10-07T22:31:42.599Z"
}