{
  "title": "CC-5400 Carrier/Cruiser",
  "pageId": 5682,
  "revisionId": 12295,
  "wikitext": "[[File:CC-5400-Carrier-Cruiser.jpg|500px|thumb|right]]\n\n'''CC-5400 Carrier/Cruiser'''<br />'''Craft''': Corellian Engineering Corporation's CC-5400 Carrier/Cruiser<br />'''Type''': Medium Cruiser/Heavy Carrier<br />'''Scale''': Capital<br />'''Length''': 468 meters<br />'''Skill''': Capital Ship Piloting CC-5400 Carrier/Cruiser<br />'''Crew''': 1,786, '''gunners '''131, '''skeleton''': 310/+15<br />'''Crew Skill''': Astrogation 4D+1, capital ship gunnery 5D+2, capital ship piloting 6D, capital ship shields 5D+1, sensors 4D<br />'''Passengers''': 80 (troops)<br />'''Cargo Capacity''': 1,000 metric tons<br />'''Consumables''': 1 year<br />'''Cost''': 94,000,000 (new), 54,500,000 (used)<br />'''Hyperdrive Multiplier''': x3<br />'''Hyperdrive Backup''': x16<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 7<br />'''Hull''': 4D<br />'''Shields''': 1D+2<br />'''Sensors''':\n*Passive: 45/1D\n*Scan: 90/2D+1\n*Search: 150/3D+2\n*Focus: 6/4D\n'''Weapons''':\n*'''20 Light Turbolaser Cannons'''\n: Fire Arc: 16 turret, 2 left, 2 right<br />Crew: 3<br />Skill: Capital Ship Gunnery<br />Fire Control: 3D+1<br />Space Range: 3-15/35/75<br />Atmosphere Range: 6-30/70/150 km<br />Damage: 3D+2\n*'''12 Ion Cannons'''\n: Fire Arc: 8 turret, 4 back<br />Crew: 4<br />Skill: Capital ship gunnery<br />Fire Control: 4D<br />Space Range: 1-10/25/50<br />Atmosphere: 2-20/50/100 km<br />Damage: 4D\n*'''15 Quad-Laser Cannons'''\n: Fire Arc: 10 turret, 5 back<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 4D<br />Space Range: 1-4/15/30<br />Atmosphere Range: 2-50/50/100 km<br />Damage: 5D\n*'''4 Tractor Beam Projectors'''\n: Fire Arc: 1 left, 1 right, 2 back<br />Crew: 2<br />Skill: Capital ship gunnery<br />Fire Control: 2D<br />Space Range: 1-4/12/25<br />Atmosphere Range: 2-10/30/60 km<br />Damage: 4D\n\n'''Starfighter complement''': 12 squadrons\n\n'''Capsule''':  The CC-5400 is the largest and fastest of the CC-series of capital ships to date. It was designed early on in the Clone Wars and utilized droids heavily both in the day to day operation of the vessel, and the day to day upkeep of its fighter squadrons. Though it does make use of extensive droid workers, it still requires a crew of 1,486 to efficiently run the vessel. The upkeep of the fighter bay and the fighters themselves requires another 300 crewmembers.<br />The hanger bays are separated into two decks both housing a wing (72) of fighters plus additional craft. All of these craft require a huge amount of space to land on, also large fields of access. The bays are large open parking garages so to speak, each fighter is allocated a 20x20 meters space and all work is done in that space. Four of the six bays are 120x60 meters. Two are much larger affairs stretching roughly four-fifths the width of the vessels 330 meters. The bays are roughly 60 meters deep in the shallowest section and 120 meters deep in the deepest. These larger bays account for over half the fighter cover by themselves. The bays' floors are armor plating as thick as the hulls on most Correlian Corvettes. The MagCon fields are divided into 120x20 meters rectangles; there are six of these large fields. Since the bays themselves are built to accommodate craft with landing gear, to modify them into TIE racks is very expensive. The Empire used the CC-5400 for the first six years of its existence after that. Designs that were less fighter craft efficient, cheaper to build, but could easily carry TIE fighters.<br />A certain amount of heating is required in any vessel in the hanger bays, if a bay is too cold to work in the required, maintenance on fighter craft will not be done. Maintaining and heating the large bays requires a totally free generator, thus four instead of three were installed. All in all the upkeep of the bays, plus the power requirement make for a very expensive carrier.<br />The CC-5400 runs on twelve CEC DX-9FR engine cores and four Nova Corporation A1-9FR cores that almost propel it as fast as the KDY 12A-99 cores in the Carrack-class Light Cruiser. The DX-9FR was later used in sets of three in the Corellian Gunship. The engines appear on either side of the launch area in the rear of the vessel.<br />These engines afford it, protection that even the heaviest escorts could not: speed. For most modern vessels, the ability to outrun other vessels is optional. For a carrier it is essential. Compared to other vessels of its size, it is reasonably well armed with over 30 anti-capital ship Ion Cannons and Turbolasers. To use more then one-third of its guns a CC-5400 has to either power-down the shields, or reduce its space to that of a Victory-class Star Destroyer which is 4.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/CC-5400%20Carrier%2FCruiser",
  "retrievedAt": "2025-10-08T08:29:55.633Z"
}