{
  "title": "Chuun M’arh Frigate",
  "pageId": 5796,
  "revisionId": 12586,
  "wikitext": "[[File:Chuun-Marh-Frigate.jpg|thumb|500px|right]]\n\n'''Ro'ik Chuun M’arh Frigate'''<br />'''Craft''': Yuuzhan Vong Ro'ik Chuun M’arh Frigate<br />'''Affiliation''': Yuuzhan Vong<br />'''Era''': New Jedi Order<br />'''Source''': The New Jedi Order Sourcebook (page 67)<br />'''Type''': Frigate<br />'''Scale''': Capital<br />'''Length''': 440 meters<br />'''Skill''': Capital ship piloting: Chuun M’arh Frigate<br />'''Crew''': 225<br />'''Crew Skill''': 6D* in all appropriate skills<br />'''Passengers''': 370<br />'''Cargo Capacity''': 980 metric tons<br />'''Consumables''': 3 months<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x3<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 2D<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 kmh<br />'''Hull''': 4D+1<br />'''Shields''': 1D+1<br />'''Sensors''':\n*Passive: 35/1D\n*Scan: 70/2D\n*Search: 105/3D\n*Focus: 3/3D+2\n'''Weapons''':\n*30 Plasma Projectors\n: Fire Arc: 15 front, 5 left, 5 right, 5 rear<br />Skill: Capital ship gunnery<br />Fire Control: 2D<br />Space Range: 3-15/35/75<br />Atmosphere Range: 6-30/70/150 km<br />Damage: 7D\n*Dovin Basal “Tractor”\n: Fire Arc: Any<br />Skill: Capital ship gunnery<br />Fire Control: 0D<br />Space Range: 1-5/15/30<br />Atmosphere Range: 2-10/30/60 km<br />Damage: Up to 1D+1 (see the entry on [[Dovin Basal]])<br />* The +2D bonus from the ship’s yammosk has been applied to this total.\n\n'''Capsule''': A flexible vessel that fulfilled a number of roles in a conflict, the ro'ik chuun m'arh frigate was an important part of the Yuuzhan Vong warfleet. Created from living yorik coral, the ro'ik chuun m'arh was the equivalent of a New Republic escort frigate or an Imperial Lancer-class frigate.\n\nThe fully-grown ship could reach 440 meters in length, significantly larger than the enemy equivalents, but most documented vessels of this type were significantly smaller. The Gift of Anguish was around 200 meters long, and Nom Anor's personal ship Ksstarr was around 150 meters. The eight frigates that fought in the fleet of Supreme Commander Komm Karsh in the Second Battle of Obroa-skai were also around this size.\n\nA fully-grown ro'ik chuun m'arh had a crew of 225 and 370 passengers. Smaller ships could be operated by minimal flight crew of less than a dozen pilots and gunners, but could still deploy three full companies of Yuuzhan Vong infantry. A 440-meter ro'ik chuun m'arh frigate was typically armed with thirty yaret-kors, and also featured the standard dovin basals - used to propel the craft, to shield the vessel, and to strip enemy defenses in  combat. Even the relatively small Ksstarr was very heavily armed, with weapons batteries on the bows and flanks, each combining yaret-kor plasma cannons and magma missile launchers. This particular frigate, at least, could fire every weapon it carried at targets directly ahead of the ship, and in a surprise attack its full salvo was capable of inflicting decisive damage to far larger opponents.\n\nThe ro'ik chuun m'arh frigate was adaptable during combat, able to take on various missions. In battle, it could serve as an assault vessel, or an escort for larger ships, or provide battle support to wounded vessels. Away from the front line, this type was capable of serving as a long-range reconnaissance ship, a courier for high-ranking individuals, a cargo transport, troop carrier, or patrol picket. In the last three roles, ships often carried boarding skiffs, each capable of carrying one hundred warriors, either to the surface of a planet or to board another starship.\n\nDespite its firepower and versatility, the ro'ik chuun m'arh could not use its dovin basals to generate an effective interdiction field - though it often allowed larger ships to do this, while concentrating on destroying enemy forces.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Chuun%20M%E2%80%99arh%20Frigate",
  "retrievedAt": "2025-10-08T08:30:00.002Z"
}