{
  "title": "Codon Warship",
  "pageId": 615,
  "revisionId": 11835,
  "wikitext": "[[File:Codon-Warship.jpg|thumb|500px]]\n\n'''Craft''':  North Kliatran National Space Program SF-4 \"Codon\"<br />'''Type''':  Space Superiority Fighter, archaic<br />'''Scale''':  Starfighter<br />'''Length''':  11 meters<br />'''Skill''':  Archaic Starship Piloting, Codon<br />'''Cost''':  2.2 Million credits<br />'''Crew''':  2<br />'''Passengers''': None<br />'''Cargo Capacity''':  None<br />'''Consumables''':  1 week<br />'''Hyperdrive Multiplier''':  None<br />'''Hyper Backup''':  No<br />'''Nav Computer''':  No<br />'''Maneuverability''':  5D+2<br />'''Space''':  1<br />'''Atmosphere''':  210/600<br />'''Hull''':  1D-1<br />'''Shields''':  None<br />'''Sensors''':\n*Passive: none\n*Scan: 5/0D\n*Search: 8/1D\n*Focus:  none\n'''Weapons''':\n*'''1x 40mm Projectile Cannon'''\n: Scale: Speeder<br />Fire Arc: Rear Swivel: Rear, Left, Right<br />Crew:  1<br />Skill:  Starship Gunnery<br />Fire Control:  2D<br />Space Range:  1/1/2<br />Atmosphere Range:  100/140/200<br />Damage: 4D+1\n\n'''Capsule''': The Codon is one of the most primitive fighters with copies still surviving.  Flying on a single chemical thrust engine, the Codon was North Kliatra's answer to a raiding fleet of aliens of unknown origin. The Codon proved very effective in combat, and the success of the North Kliatra space navy gave that planet time to become one of the first true interstellar powers, after they established bases on several worlds. There are only 18 Codon fighters still in existence in various states of disrepair. The price that a mint condition ship of this type would bring would depend on the numbers and competitiveness of the buyers, the state of the galactic economy, and many other factors, but would probably be remarkably high.<br />'''Source''':",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Codon%20Warship",
  "retrievedAt": "2025-10-07T22:29:38.152Z"
}