{
  "title": "Corellian Support Frigate",
  "pageId": 723,
  "revisionId": 12288,
  "wikitext": "[[File:Corellian-Support-Frigate.jpg|thumb|500px]]\n\n'''Craft''': Corellian Engineering Corporation Support Frigate<br />'''Type''': Support Frigate<br />'''Scale''': Capital<br />'''Length''': 185 Meters<br />'''Skill''': capital ship piloting: assault frigate<br />'''Crew''': 40 to 180, depending on configuration, 13 gunners<br />'''Crew Skill''': Astrogation 3D, capital ship gunnery 3D+2, capital ship piloting 3D, capital ship shields 3D, capital ship repair 3D, sensors 3D+1<br />'''Passengers''': Up to 600 (troops), depending on configuration.<br />'''Cargo Capacity''': 2300 metric tons<br />'''Consumables''': 1 years<br />'''Cost''': 1.3 million (new)<br />'''Hyperdrive Multiplier''': x2<br />'''Nav Computer''': Yes<br />'''Space''': 5<br />'''Maneuverability''': 1D<br />'''Hull''': 4D<br />'''Shields''': 2D<br />'''Sensors'''\n*Passive: 40/1D\n*Scan: 70/2D\n*Search: 100/3D\n*Focus: 4/3D+2\n'''Weapons'''\n*'''6 Turbolaser Cannons''' (fire-linked by pairs)\n: Fire Arc: Forward (4), Turret (2)<br />Crew: 3 (4), 2 (2)<br />Skill: Capital Ship Gunnery<br />Fire Control: 2D+1<br />Space Range: 3-15/35/75<br />Atmosphere Range: 6-30/70/150km<br />Damage: 4D\n*'''1 Tractor Beam Projector'''\n: Fire Arc: Turret<br />Crew: 3<br />Skill: Capital Ship Gunnery<br />Fire Control: 2D+2<br />Space Range: 1-5/15/30<br />Atmosphere Range: 2-10/30/60km<br />Damage: 4D\n\n'''Capsule''': This ship is the precursor to the immensely popular Corellian Corvette. Introduced early in the Clone Wars, this ship proved to be immensely valuable to the Republic. It boasts a very similar style to the Corvette, but with a larger \"Ithorian-head\" bow and a 4-engine configuration, with larger engines rather than the many small ones that the Corvette has. The Corellian Support Frigate was designed to provide cover and backup to larger ships during combat, but its easily adaptable design lends itself to other functions. For a capital ship, it is relatively small, and can slip in and out of a dangerous system with less difficulty than other starships. It can function as a scout ship, a troop transport, perform diplomatic and consular missions, provide close support, or even reinforce the picket line if so needed. In some rare cases, these ships were retrofitted with medical equipment and served as emergency medical support for injured troops. They carry a single, low-power tractor beam to help with starfighter recovery and other miscellaneous missions, but may be refitted as the particular case dictates. The main advantage of this ship is its versatility, which the Republic put to good use during the Clone Wars.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Corellian%20Support%20Frigate",
  "retrievedAt": "2025-10-08T08:30:09.643Z"
}