{
  "title": "Corellian Assault Boat",
  "pageId": 5638,
  "revisionId": 10845,
  "wikitext": "[[File:CorellianAssaultBoat.jpg|500px|thumb|right]]\n\n'''Corellian Assault Boat'''<br />'''Craft''': Corellian Mynock-class assault boat<br />'''Affiliation''': Corellian Defense Force / General<br />'''Era''': Rise of the Empire<br />'''Source''': Cracken’s Threat Dossier (page 139)<br />'''Type''': Assault boat<br />'''Scale''': Starfighter<br />'''Length''': 44 meters<br />'''Skill''': Space transports: assault boat<br />'''Crew''': 2, '''gunners''': 1, '''skeleton''': 1/+10<br />'''Crew Skill''': Varies widely<br />'''Passengers''': 24 (troops)<br />'''Cargo Capacity''': 40 metric tons<br />'''Consumables''': 1 month<br />'''Cost''': 250,000 (used)<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x10<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 kmh<br />'''Hull''': 4D<br />'''Shields''': 3D<br />'''Sensors''':\n*Passive: 301D\n*Scan: 60/2D\n*Search: 90/4D\n*Focus: 4/4D+1\n'''Weapons''':\n*Quad Laser Cannon\n: Fire Arc: Turret<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 5D\n*Concussion Missile Tube\n: Fire Arc: Turret<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 50-100/300/700<br />Damage: 9D\n*2 Medium Ion Cannons (fire-linked)\n: Fire Arc: Front<br />Crew: 1 (pilot or co-pilot)<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/7/36<br />Atmosphere Range: 100-300/700/3.6 km<br />Damage: 4D\n*2 Chin Guns\n: Fire Arc: Front<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 2D\n\n'''Capsule''': It was said to have been designed as a new generation of system patrol craft, carrying more firepower and troops than earlier designs like the Sienar Fleet Systems IPV-1, but although equipped with its own hyperdrive, it was notably slower and less maneuverable, and significantly smaller than the 100-meter minimum that had formerly defined system patrol craft. In effect, it was a robust troop carrier that could be deployed in customs operations against pirates and smugglers, rather than a conventional patrol craft with expanded troop capacity.\n\nThe assault boat measured 44 meters long, with two internal decks, and it was relatively heavily armed for its size, with a turret-mounted quad laser cannon and concussion missile tube, two medium ion cannons, and a pair of light chin guns. It was also well armored and shielded, and it had a class 2 hyperdrive, although sublight speed and maneuverability were limited.\n\nThe Mynock-class Assault Boat was crewed by a pilot, a co-pilot, and a gunner, and could carry up to 24 troops. Its main role in space was as a boarding craft, but its primary mission was ground assault, where its heavy weaponry could provide effective fire support for the infantry it carried. A single assault boat and its compliment of troopers was considered capable of dealing with most small surface targets.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Corellian%20Assault%20Boat",
  "retrievedAt": "2025-10-07T22:31:46.015Z"
}