{
  "title": "Corellian Auxiliary Carrier",
  "pageId": 10668,
  "revisionId": 32242,
  "wikitext": "[[File:Corellian Auxiliary Carrier.gif|thumb|500px|right]]\n\n'''Craft''': Corellian Engineering Auxiliary Carrier<br />'''Type''': Escort Carrier<br />'''Scale''': Capital<br />'''Length''': 125 Meters<br />'''Skill''': Space Transport Piloting: Auxiliary Carrier<br />'''Crew''': 66; Gunners: 4; Skeleton Crew: 10/+10<br />'''Passengers''': 20 (Troops)<br />'''Cargo Capacity''': 1000 Tons<br />'''Consumables''': 6 Months<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': X2<br />'''Hyperdrive Backup''': X12<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 4<br />'''Atmosphere''': 560; 1,600 Kmh<br />'''Hull''': 4D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 40/1D\n*Search: 100/2D+2\n*Scan: 80/2D\n*Focus: 4/3D\n'''Weapons'''\n*'''4 Twin Laser Cannons''' (Fire Separately)\n: Fire Arc: 1 Front, 1 Left, 1 Right, 1 Rear<br />Scale: starfighter<br />Crew: 1<br />Fire Control: 3D<br />Space: 1-3/12/25<br />Atmosphere Range: 100-300 / 1,200 / 2,500 meters<br />Damage: 3D\n'''Complement''': 12 Starfighters\n\n'''Capsule''': The Auxiliary Carrier is based on the well-known Action VI bulk freighter design, and it looks exactly like one from the outside. However, it is heavily modified to take military hardware such as armor, weapons and a full sensor outfit, but its primary weapon is its facilities to carry one starfighter squadron. The modus operandi for the Auxiliary Carrier is to function as a convoy escort vessel, and its resemblance to a real bulk freighter makes it look more vulnerable than it is. Since its introduction by the Empire, Alliance attacks against convoys which they thought were only lightly protected, have sustained increased losses.\n\n'''Source''': \"Unknown\"",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Corellian%20Auxiliary%20Carrier",
  "retrievedAt": "2025-10-08T08:30:04.592Z"
}