{
  "title": "Corellian Consular-class",
  "pageId": 5676,
  "revisionId": 32670,
  "wikitext": "[[File:consularclass.jpg|500px|thumb|right]]\n\n'''Republic Cruiser'''<br />'''Craft''': Corellian Engineering Corporation Consular-class Space Cruiser<br />'''Affiliation''': Old Republic / General<br />'''Era''': Old Republic<br />'''Source''': Starships of the Galaxy (pages 91-92)<br />'''Type''': Diplomatic transport<br />'''Scale''': Capital<br />'''Length''': 115 meters<br />'''Skill''': Capital ship piloting: Corellian space cruiser<br />'''Crew''': 8; skeleton: 2/+10<br />'''Crew Skill''': Typically 6D in applicable skills<br />'''Passengers''': 16<br />'''Cargo Capacity''': 1,000 metric tons<br />'''Consumables''': 6 months<br />'''Cost''': 1.25 million<br />'''Hyperdrive Multiplier''': x2<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 0D+2<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 kmh<br />'''Hull''': 4D+2<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 40/1D\n*Scan: 80/2D\n*Search: 100/3D\n*Focus: 5/4D\n'''Weapons''':\n*None Standard, can be refitted with various configurations\n\n'''Escape Craft'''\n*Detachable Salon Pod\n*2 Escape Pods\n\n'''Description''': The Consular-class space cruiser, commonly referred to as Republic cruiser, was a Corellian Engineering Corporation starship used by the Galactic Republic to transport Jedi and diplomats to troubled spots across the galaxy.\n\nThe Consular-class space cruiser was a starship designed and manufactured by the Corellian Engineering Corporation and used by the Galactic Republic to transport Jedi and diplomats to troubled spots across the galaxy. Civilian models of the Consular-class cruiser were used for straight-forward transportation and were indistinct. Craft of the Consular class in diplomatic service were painted red to declare their diplomatic immunity and to also serve as a warning not to attack. Red was the color of ambassadorial relations and neutrality for capital ships of the Republic and had been so for many centuries. During the Clone Wars, these cruisers were painted the same colors as Republic attack cruisers. Any ship hailing from Coruscant would be painted entirely red; others would only have stripes.\n\nThe Republic cruiser was equipped with a salon pod that served as a secure meeting area for Republic representatives and leaders of groups in conflict. There was also a variety of salon pods that catered to different alien species. In emergency situations, the entire salon pod could eject from the mother craft, and with its own sensors, life support equipment, and engines, protect the diplomatic crew on board. The craft also carried a number of escape pods.\n\nThe cruiser's total capacity was 9 crew and 16 passengers. For increased security on diplomatic missions, the organic crew was kept to a minimum, with many ship functions attended to by droids.\n\nAlthough the diplomatic versions were unarmed, various cruisers were modified to have double turbolaser cannons and two concussion missile launchers installed and to serve in the Judicial Forces and regional security forces, at least some of which were then re-designated as either Republic light assault cruisers or Republic frigates. Others were modified to serve as troop carriers and command ships.\n\nConsular cruisers entered service late in the time period of the Republic. An early version of the ship was built after the Ruusan Reformation and was put into service by 990 BBY. They were created due to budget cuts that required the building of new utilitarian and non-ostentatious starships; it was that quality of them that attracted the Jedi to their use.\n\nDuring the prelude to the Invasion of Naboo in 32 BBY , it was a Consular-class cruiser, Radiant VII, that transported Qui-Gon Jinn and Obi-Wan Kenobi to the Trade Federation battleship Saak'ak orbiting Naboo. The ship was assigned a skeleton crew of one pilot and a captain. Both died when the Trade Federation destroyed the vessel.\n\nMilitarized Consular-classes known as Republic light assault cruisers served the Republic Navy in the Stark Hyperspace War and the Yinchorri Uprising. Those vessels had cannons and extra armor added to their design.\n\nDuring the Clone Wars, some Consular-class ships went through the Charger c70 retrofit, having weapon batteries added and serving as small frigates in the Republic wartime Navy. They possessed a combination of firepower and speed that made them valuable components of the Navy.\n\nCivilians such as Noggox the Hutt also used Consulars. One of his freighters was captured by the pirate Dool Pundar.\n\nThe militarized Consular-class frigates had a paint job similar to the Venator-class Star Destroyers. The tradition of painting strictly diplomatic vessels red continued even into the days of the Galactic Empire. Princess Leia Organa's vessel, the Tantive IV, was striped in red to indicate diplomatic immunity.\n\nA handful of armed cruisers were still in operation throughout the galaxy during the Galactic Civil War. The smuggler Rif Taranu aided the Rebel Alliance by using his modified cruiser Dead Reckoning to transport goods for them. Several were seen at the Jubilee Wheel early in the Yuuzhan Vong War, and participated in the Battle of Yag'Dhul.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Corellian%20Consular-class",
  "retrievedAt": "2025-10-08T08:30:06.652Z"
}