{
  "title": "Corellian Gunship",
  "pageId": 650,
  "revisionId": 32673,
  "wikitext": "[[File:Corellian-Gunship.jpg|500px|thumb|right]]\n[[File:cgunship.jpg|500px|thumb|right]]\n\n'''Craft''': Corellian Engineering Corporation DP20 frigate<br />'''Type''': Mid-sized anti-starfighter warship<br />'''Scale''': Capital<br />'''Length''': 120 meters<br />'''Skill''': Capital ship piloting: Corellian gunship<br />'''Crew''': 45, '''gunners''': 46, '''skeleton''': 10/+15<br />'''Crew Skill''': Astrogation 3D+1, capital ship gunnery 4D+2, capital ship piloting 4D, capital ship shields 4D+1, sensors 3D<br />'''Cargo Capacity''': 300 metric tons<br />'''Consumables''': 8 months<br />'''Cost''': 4.8 million (new), 2.4 million (used)<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x16<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 2D+1<br />'''Space''': 7<br />'''Atmosphere''': 350: 1,000 KMH<br />'''Hull''': 4D+2<br />'''Shields''': 2D+1<br />'''Sensors''':\n*Passive: 20/0D\n*Scan: 40/0D\n*Search: 80/1D\n*Focus: 2/2D\n'''Weapons''':\n*'''8 Turbolaser Cannons'''\n: Fire Arc: 2 front, 3 left, 3 right<br />Crew: 2<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 3-15/35/75<br />Atmosphere Range: 300-1.5/3.5/7.5KM<br />Damage: 4D+2\n*'''6 Quad Laser Cannons'''\n: Fire Arc: 3 left, 3 right<br />Crew: 3<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 1-5/10/17<br />Atmosphere Range: 100-500/1/1.7KM<br />Damage: 2D\n*'''4 Concussion Missile Tubes'''\n: Fire Arc: 2 front, 2 rear<br />Crew: 3<br />Skill: Capital ship gunnery<br />Fire Control: 3D<br />Space Range: 1-12/30/60<br />Atmosphere Range: 200-1.2/3/6KM<br />Ammo: 30 missiles each<br />Damage: 9D\n\n'''Source''': Rebel Alliance Sourcebook (pages 61/63)\n\n'''Description''': The DP20 frigate or Corellian Gunship was one of the few dedicated warship designs produced by Corellian Engineering Corporation, and was the most common member of the Corellian gunship product line. Though small and compact, it was fast and carried heavy firepower for a ship of its size and class.\n\nUnlike its cousin, the CR90 corvette, the gunship had minimal cargo space and almost no space for passengers or troops. These small ships were designed to be only two things: fast and deadly. Engines consumed nearly half of the gunship's interior space. What little room was left was used for deflector shield generators and weapons.\n\nArmed with eight double turbolaser cannons, four concussion missile tubes, and six quad laser cannons, the Corellian gunship was effective against both larger capital ships as well as starfighters, though it was primarily used against the latter. These ships were 120 meters long. Each one carried a crew of 45, along with 46 gunners. They were equipped with Class 2 hyperdrives. \n\nThe DP20 was originally designed for the fleet of the Galactic Republic. These vessels saw extensive use among the Corellian and Rebel Alliance/New Republic fleets, although some were also seen in the hands of independent operators, such as pirate factions and other fringe groups. Local Imperial forces also utilized the class. The Rebel Alliance, in need of a small, fast attack vessel, decided to purchase a few of these starships after witnessing a group of pirates use them to successfully hijack an Imperial shipment guarded by several Imperial fighters and bombers. At least one of these vessels was wrecked in the Korteen asteroid belt by Quarg's father and his space wreckers.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Corellian%20Gunship",
  "retrievedAt": "2025-10-08T08:30:07.133Z"
}