{
  "title": "Corellian CR90 Corvette",
  "pageId": 5673,
  "revisionId": 32761,
  "wikitext": "[[File:cr90.jpg|500px|thumb|right]]\n[[File:cr901.gif|500px|thumb|right]]\n[[File:cr902.gif|500px|thumb|right]]\n\n'''Corellian CR90 Corvette'''<br />'''Craft''': Corellian Engineering Corporation CR90 Corvette<br />'''Affiliation''': General / Rebel Alliance / Empire<br />'''Era''': Rise of the Empire<br />'''Source''': Core Rulebook (page 253), Rebel Alliance Sourcebook (pages 63-65), Star Wars Trilogy Sourcebook SE (pages 143-144), The Star Wars Sourcebook (pages 30-31), Pirates & Privateers (pages 54-55), Heir to the Empire Sourcebook (page 121), The Thrawn Trilogy Sourcebook (pages 214-215), The Essential Guide to Vehicles and Vessels (pages 128-129)<br />'''Type''': Mid-sized multi-purpose vessel<br />'''Scale''': Capital<br />'''Length''': 150 meters<br />'''Skill''': Capital ship piloting: Corellian Corvette<br />'''Crew''': 30 to 165, depending upon configuration<br />'''Minimum Crew''': 7<br />'''Crew Skill''': Astrogation 3D, capital ship gunnery 4D+1, capital ship piloting 3D+2, capital ship shields 3D, sensors 3D+1<br />'''Passengers''': Up to 600, depending upon configuration<br />'''Cargo Capacity''': 3,000 metric tons<br />'''Consumables''': 1 year<br />'''Cost''': 3.5 million (new), 1.5 million (used)<br />'''Hyperdrive Multiplier''': x2<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 2D<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 kmh<br />'''Hull''': 4D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 40/1D\n*Scan: 80/2D\n*Search: 100/3D\n*Focus: 5/4D\n'''Weapons''':\n*'''6 Double Turbolaser Cannons'''\n: Fire Arc: 3 front, 1 left, 1 right, 1 back<br />Crew: 1 (3), 3 (3)<br />Skill: Capital ship gunnery<br />Fire Control: 3D<br />Space Range: 3-15/35/75<br />Atmosphere Range: 6-30/70/150 km<br />Damage: 4D+2\n\n'''Escape craft'''\n*Faberstien-Lago 37s emergency escape pods (8, ventral)\n*Armed Faberstien Maximum capacity life ships (4, dorsal)\n\n'''Docking bays'''\n*Ventral starfighter-scale landing bay \n\n'''Description'''\n\n''\"The Rebel blockade runner is the pride of the Corellian Engineering Corporation's military vehicles. With its mess of huge engines, it can whoop any jerk-ass Imperial.\"'' \n―Corellian Engineering Corporation advertisement\n\nThe CR90 corvette, commonly referred to as the Corellian corvette or the Rebel blockade runner, also known as an Alderaan cruiser, was a small, multi-purpose capital ship manufactured by Corellian Engineering Corporation.\n\nThe CR90 had a wide variety of users throughout the galaxy, from pirates to corporations to galactic navies, and had a known operational life from at least as early as 52 BBY to as late as 137 ABY. It possessed the same legendary adaptability as other CEC products, which allowed it to serve in roles as mundane as freight hauling or as a high-profile diplomatic escort.\n\n'''Characteristics'''\n\nA versatile starship, the CR90 was used extensively across the galaxy by governments and private interests. The interior of the CR90 featured a modular design to allow for easy reconfiguration of the Corellian corvette from one function to another. Some older model corvettes, like the CR70, could easily be upgraded with retrofit packages like the Vanguard c20 to become CR90s.\n\nCommon configurations included a troop carrier, light escort vessel, cargo transport, or passenger liner. Its ease of modification was a trademark of CEC and increased the corvette's resale value. One of the rarer variants could carry starfighters, such as the Night Caller and Constrictor.\n\nThe weapon systems varied, although the standard configuration mounted two Taim & Bak H9 dual turbolasers and four single turbolasers. CR90 corvettes could carry as many as eight turbolasers, six laser cannons, and four ion cannons. Under the standard configuration, these turrets were unable to hit anything directly behind the corvette's engines, so CR90 corvettes featured a well-known axial blind spot.\n\nA common configuration for combat-oriented corvettes consisted of six H9 dual turbolasers. A similar armament was mounted on the CR92a Assassin-class corvette, a successor of the CR90 that was designed exclusively for combat roles.\n\nThe ship was capable of sustaining acceleration up to 2,100 G and could carry 600 passengers. However, its class 2 hyperdrive was slow compared to many ships of similar size. The standard crew was made up of 8 officers and 38 enlisted crew, but could range from 30 to 165 total, depending on its configuration.\n\nInterestingly, the CR90 could be piloted by as few as two people, as shown when Han Solo and Chewbacca flew a series of corvettes bearing the name Jaina's Light, or even one person if necessary via a steering yoke, as Wedge Antilles demonstrated when he flew the modified corvette Night Caller.\n\nThe 150 meter-long craft could reach atmospheric speeds of 950 kilometers per hour.\n\n'''Republic service'''\n\nIn the last decades of the Galactic Republic, the CR90 corvette was introduced and older corvette-models like the CR70 were gradually being refitted into this version. The Republic CR90 corvettes served in the Judicial Forces and later in the Republic Navy when it was reinstated during the Clone Wars. The CR90 model was considered a mid-sized corvette in the time before the Wars.\n\n'''Imperial service'''\n\nA dwarf among the massive Imperial-class Star Destroyers of the Imperial Navy, CR90 corvettes were relegated primarily to diplomatic and escort duty in the Galactic Empire. In fleet engagements, CR90 corvettes were often tasked with attacking enemy starfighters or fleeing the battlefield with important cargo or intelligence. Prior to the Dissolution of the Imperial Senate by Emperor Palpatine, these corvettes were used by Imperial senators as diplomatic couriers.\n\n'''Rebel and fringe service'''\n\nUnlike their Imperial counterparts, Alliance CR90 corvettes acted as front-line combat ships for the early years of the Galactic Civil War. The ease of acquiring CR90 parts and mechanics made them a good fit for the desperate Rebellion. Its near ubiquity made it a popular choice among Rebels, pirates, and smugglers, earning it the nickname \"blockade runner\" for its ability to slip through Imperial nets. However, it proved ineffective against larger ships such as the Imperial I-class Star Destroyer short of kamikaze attacks unless it was used in large numbers against such a vessel. One example was at the Space Battle at Kuat when five Corvettes caused considerable damage to the Star Destroyer Tyranny.\n\nKnowing that the corvette was used by the Rebellion, Imperial authorities often stopped them for inspections on the flimsiest of excuses.\n\nCrime Lord Tyber Zann acquired CR90 corvettes for his fleet during his corruption efforts in the galaxy.\n\n'''New Republic service'''\n\nFollowing the transition of the Alliance into the New Republic, CR90 corvettes continued to play an important role in the newly organized New Republic Defense Fleet until phased out of line-duty with modernization efforts like the New Class Modernization Program.\n\n'''Later history'''\n\nSeveral CR90s were used to make up a secret retreat in 137 ABY. At least two were used during the Evacuation of Dac.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Corellian%20CR90%20Corvette",
  "retrievedAt": "2025-10-08T08:30:06.159Z"
}