{
  "title": "Core Defense Industries Terror Class Drone Starfighter",
  "pageId": 5211,
  "revisionId": 11833,
  "wikitext": "[[File:Core-Defense-Industries-Terror-Class-Drone-Starfighter.jpg|thumb|500px]]\n\n'''CDI Terror Drone'''<br />'''Type''': Core Defense Industries Terror Class Drone Starfighter<br />'''Scale''': Starfighter<br />'''Length''': 15.9 meters<br />'''Crew''': 0<br />'''Crew Skills''': Starfighter Piloting 7D, Starship Gunnery 6D+2, Repulsorlift Ops 6D, Tactics: Starfighter Combat 7D<br />'''Passengers''': 0<br />'''Cargo Capacity''': 150 kg<br />'''Cost''': 350,000 (New); 150,000 (used)<br />'''Hyperdrive Multiplier''': No<br />'''Hyperdrive Backup''': No<br />'''Nav Computer''': NA<br />'''Space''': 9<br />'''Atmosphere''': 350; 950 kmh<br />'''Maneuverability''': 2D<br />'''Hull''': 4D<br />'''Shields''': 3D<br />'''Sensors''':\n*Passive: 30/1D\n*Scan: 50/2D\n*Search: 75/3D\n*Focus: 5/3D+2\n'''Weapons''':\n*Twin Light Tachyon Cannons (Fire Linked)\n: Scale: Starfighter<br />Fire Arc: Front<br />Fire Control: 4D<br />Space Range: 1-5/15/40<br />Atmosphere Range: 100-500/1.5/4km<br />Damage: 8D\n\n'''Description''': After the destruction of Alderaan a native of that world, Almek Obsidian, became somewhat obsessive about military power, and set up Core Defense Industries (CDI) to supply defense to other worlds so the same could never happen again. However the unbalanced nature of the industrialist and the corporation he founded, led to many headaches for the fledgling New Republic, as the power weapons and vessels were sold to anyone without restriction, meaning that these state of the art weapons of war were available to terrorists, pirates and other criminals. Fortunately, for the New Republic at least, Almek Obsidian died after only a couple of years, and the absence of his genius, although unbalanced, hand at the helm meant that CDI went into receivership shortly afterwards. The CDI Terror Class Drone Starfighter, incorporates a number of CDI's proprietary technologies into one highly advanced autonomous starfighter package. The Terror has powerful Tachyon Cannons, on their own independently moving arms, as well as fast maneuverable engines, allowing the vessel to match most other starfighters be they manned or unmanned. The electronic drone brain is highly skilled, and allows the vessel to be left in a low power mode and only activated when required, scrambling from its hangars in defense of a planet. For this reason the Terror has no Hyperdrive systems, operating from starships, space stations or planetary surfaces, and is designed with defense in mind. The fighter sold in small numbers as although its use saved lives, and it was cost effective in the long term, its high purchase price meant that the lives of pilots in other vessels were cheap in comparison.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Core%20Defense%20Industries%20Terror%20Class%20Drone%20Starfighter",
  "retrievedAt": "2025-10-08T13:06:15.746Z"
}