{
  "title": "Corona Armed Frigate",
  "pageId": 13277,
  "revisionId": 27089,
  "wikitext": "[[File:Corona Armed Frigate.png|thumb|500px|right]]\n\n'''Corona Armed Frigate'''<br />'''Craft''': Haor Chall Engineering Corona-class Armed Frigate<br />'''Affiliation''': Separatists / General<br />'''Era''': Rise of the Empire<br />'''Type''': Assault Frigate<br />'''Scale''': capital<br />'''Length''': 320 meters<br />'''Skill''': Capital Ship Piloting: Corona Frigate<br />'''Crew''': 64; gunners: 36<br />'''Passengers''': 200<br />'''Cargo Capacity''': 450 metric tons<br />'''Consumables''': 1 year<br />'''Cost''': 3.7 million (new); 2 million (used)<br />'''Maneuverability''': 2D<br />'''Space''': 5<br />'''Atmosphere''': 295; 850kmh<br />'''Hull''': 2D+2<br />'''Shields''': 1D+1<br />'''Sensors'''\n*Passive: 25/0D\n*Scan: 40/1D\n*Search: 90/2D\n*Focus: 5/2D+2\n'''Weapons'''\n*'''4 Medium Turbolasers'''\n: Fire Arc: 1 front, 1 left, 1 right, 1 back<br />Crew: 2<br />Scale: capital<br />Skill: capital ship gunnery<br />Fire Control: 1D<br />Space Range: 3-15/35/75<br />Atmosphere Range: 2-6/24/50km<br />Damage: 5D\n*'''8 Heavy Ion Cannons'''\n: Fire Arc: 2 front, 2 right, 2 left, 2 back<br />Crew: 2<br />Scale: capital<br />Skill: starship gunnery<br />Fire Control: 1D<br />Space Range: 3-15/35/75<br />Atmosphere Range: 6-30/70/150km<br />Damage: 4D\n*'''8 Medium Laser Cannons'''\n: Fire Arc: 2 front, 2 right, 2 left, 2 back<br />Crew: 1<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 1D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1,200/2,500m<br />Damage: 4D\n*'''Tractor Beam Projector'''\n: Fire Arc: ventral<br />Crew: 4<br />Scale: capital<br />Skill: capital ship gunnery<br />Fire Control: 2D<br />Space Range: 1-5/15/30<br />Atmosphere Range: 1-5/15/30km<br />Damage: 5D\n\n'''Carried Craft'''\n*Attack Shuttles: 6\n*Speeder Tanks: 12\n\n'''Source''': Galaxy at War (page 65)\n\n'''Description''': The Corona-class armed frigate was a saucer-shaped craft manufactured by Haor Chall Engineering before the Clone Wars. It was based on an ancient Surronian cruiser design.\n\nIt was produced by Haor Chall Engineering before the Clone Wars. The ship proved to be unfit as a droid ship for the CIS. Haor Chall canceled the production and sold the remaining ships to investors and other people who were interested in buying one. During the Clone Wars they were considered antiquities, and collectors paid many credits for these vessels.\n\nThe vessel rotated while in flight, which was its main source of propulsion. As such, they also gave off a distinct humming sound while in flight. They had enough room for 6 Flarestar-class Weequay ships, which could be launched from the center of its ventral superstructure.\n\nThe craft was capable of landing on planetary surfaces and had eight landing legs. The eighth doubled as boarding ramps.\n\nThe pirate band of Hondo Ohnaka used such a ship to carry out their raids. Ohnaka stole the ship from a starship collector on Farana along with several Flarestar-class Weequay ships. They landed on Vanqor during Obi-Wan Kenobi and Anakin Skywalker's hunt for Count Dooku, and scavenged the Count's Punworcca 116-class interstellar sloop. Ohnaka offered the Count passage to Florrum, a planet six parsecs away. Dooku accepted the offer to travel with them in the ship to their base on Florrum.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Corona%20Armed%20Frigate",
  "retrievedAt": "2025-10-08T08:30:10.601Z"
}