{
  "title": "CR20 Republic Carrier",
  "pageId": 5679,
  "revisionId": 51229,
  "wikitext": "[[File:cr20.jpg|500px|thumb|right]]\n\n'''CR20 Republic Carrier'''<br />'''Craft''': Corellian Engineering Corp. CR20 Light Cruiser<br />'''Affiliation''': General / Old Republic<br />'''Era''': Rise of the Empire<br />'''Type''': Troop carrier<br />'''Scale''': Capital<br />'''Length''': 60 meters<br />'''Skill''': Capital ship piloting: Republic Carrier<br />'''Crew''': 6<br />'''Crew Skill''': Astrogation 3D, capital ship piloting 4D+2, capital ship shields 3D+1, sensors 3D+2<br />'''Passengers''': 40 (troops)<br />'''Cargo Capacity''': 50 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': 680,000 credits (265,000 used)<br />'''Hyperdrive Multiplier''': x3<br />'''Hyperdrive Backup''': x12<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 2D<br />'''Space''': 5<br />'''Atmosphere''': 295; 850 km/h<br />'''Hull''': 3D+1<br />'''Shields''': 2D+1<br />'''Sensors''':\n*Passive: 25/1D+1\n*Scan: 50/2D\n*Search: 75/2D+2\n*Focus: 3/3D\n'''Weapons''':\n*'''2 Double Turbolaser Cannons'''\n: Fire Arc: Turret (left and right)<br />Skill: Capital Ship Gunnery<br />Fire Control: 1D+2<br />Space Range: 1-8/17/60<br />Atmosphere Range: 100-800/1.7/6 km<br />Damage: 3D+2\n\n'''Escape craft''': 4\n\n'''Complement'''\n*[[74-Z speeder bike]]s: 12\n\n'''Description''': The CR-20 troop carrier was a type of transport ship used to deploy small units of clone troopers.\n\nThe CR-20 troop carrier was armed with two double turbolaser cannons. It was sixty meters long and could carry up to forty clone troopers, twelve 74-Z speeder bikes, and their corresponding supplies. The carrier's crew consisted of two pilots, one communications officer, and three engineers.\n\nOriginally designed by the Corellian Engineering Corporation for use by its security forces, the Republic purchased surplus CR-20s one standard month after the First Battle of Geonosis. Despite this, they were widely unseen in the Republic Navy early in the Clone Wars. It was not until the Battle of JanFathal, where Anakin Skywalker piloted a CIS-owned CR-20 to rescue Republic Intelligence operative Hallena Devis, that the usefulness of the CR-20 Troop Carrier became evident. Generally, they were used in situations where the large Acclamator-class assault ships were impractical or unneeded.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/CR20%20Republic%20Carrier",
  "retrievedAt": "2025-10-10T19:11:19.301Z"
}