{
  "title": "D-Wing",
  "pageId": 10442,
  "revisionId": 20251,
  "wikitext": "[[File:D-Wing Space Superiority Fighter.jpg|thumb|500px|right]]\n\n'''D-Wing Space Superiority Fighter'''<br />'''Craft''': Tay Industries D-Wing Space Superiority Fighter<br />'''Type''': Space Superiority Fighter<br />'''Scale''': Starfighter<br />'''Length''': 19 meters<br />'''Skill''': Starfighter Pilot<br />'''Crew''': 1; '''Gunners''': 1<br />'''Crew Skill''': varies by pilot<br />'''Passengers''': 0; 1 if no rear gunner<br />'''Cargo Capacity''': 250 kilograms<br />'''Consumables''': 1 week<br />'''Hyperdrive''': x2<br />'''Nav Computer''': Yes (limited to 10 jumps)<br />'''Maneuverability''': 3D<br />'''Space''': 10<br />'''Atmosphere''': 415; 1,200 km/h<br />'''Hull''': 4D+2<br />'''Shields''': 2D<br />'''Sensors'''\n*Passive : 20/0D\n*Scan: 40/1D\n*Search: 60/2D\n*Focus: 3/3D\n'''Weapons'''\n*'''2 Laser Cannons''' (fire linked)\n: Fire Arc: front<br />Crew: 1<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 5D\n*'''Bi-Cannon'''\n: Fire Arc: rear<br />Crew: 1<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 5D\n*'''Concussion Missile Launcher'''\n: Fire Arc: front<br />Crew: 1<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 1D<br />Space Range: 1-2/8/15<br />Atmosphere Range: 100-200/800/1,500m<br />Damage: 8D\n\n'''Capsule'''\n\nThe D-Wing Space Superiority Fighter nicknamed The Phoenix after the mythical creature which had awesome destructive power was designed by Elhon Tay of Tay Industries to be a break away from the traditional design of most Imperial starfighters due to the fact that many in the Empire had found flaws with the standard TIE fighters.\n\n'''Characteristics'''\n\nThe D-wing was a large fighter, coming in at 19 meters, and was operated by both a pilot and a gunner rather than simply by one individual. In addition to this, the fighter contained a Class 2 hyperdrive as well as concussion missiles, which made the construction costs expensive but also meant that it would be a dangerous complement to a swarm of TIE fighters.\n\nWhile the rear gunner's primary role in the craft was to man the rear-firing bi-cannon as well as the other weapons, he was also able to take complete control of the craft in the event that the pilot was either killed or damaged beyond the point of being able to pilot the craft efficiently. In addition to this, the pilot also had the capability of manning all the weapons on the craft which meant that the rear gunner could be replaced by a passenger if it was called for.\n\nThe weapon systems on the Phoenix were designed in such a way that they were in fact interchangeable so that their function could fit any role the craft was thrown into. In the standard configuration, there was room for additional weapons or sensor equipment can be added to the craft. Because of the advanced materials used to create the D-wing, it was a very rugged craft and was capable of both taking and dealing a large amount of damage.\n\n'''History'''\n\nTay Industries designed a single prototype of the craft to be shown on the seventh day of the Cynestra Space Craft Show above the planet Cynestra during the Galactic Civil War. Elhon Tay knew that he would never be able to sell his craft to the Empire without first proving its worth, and so also set up some dealings with independent escort companies as well as planetary defense forces who he knew would see plenty of action. Although this would originally mean a loss for Tay Industries, Elhon was so sure of his fighter that he knew the Imperial Navy would not be able to ignore his expensive advertising. Other starfighter producers, such as Sienar Fleet Systems, were not happy to let any supped-up fashion corporation get the better of them and so they sent agents to sabotage the prototype fighter before it could be unveiled.\n\nRogan B.B. Cham, a HoloNet News reporter and secret Rebel spy, was one of the people who were going to attend the CSCS and so he soon learned that a new and powerful starfighter was going to be revealed at the show. He got in touch with his contacts in the Rebel Alliance who soon arranged for Captain Reeves to meet with a group of Rebels on Yukka. The group then met up with Cham, who transported them to the CSCS in his ship, The Doobage, and unloaded them as cargo.\n\nThe group was tasked with either capturing or destroying the prototype starfighter but were not given a clear plan of how to do so and so had to improvise. This caused some problems when Grand Moff Torith, who had also expressed some interest in the starfighter, turned up on the scene. Elhon Tay's aim was to impress Torith with his fighter so that he would take it into his fight against the Rebellion, and the Rebel agents in turn wished only to eliminate the Grand Moff for all the hardships he had caused the growing Rebellion.\n\nThe Rebel agents, managing to avoid being found out for the full seven days, were able to both kill Grand Moff Torith and steal the prototype starfighter. It is unknown whether Tay Industries produced any more of the fighters, but as Elhon Tay favored neither the Rebellion nor the Empire, it is possible that he went on to produce the craft for the Rebellion after they managed to stop the Empire from acquiring the prototype.\n\n'''Source''':\n\n*[[user:thedemonapostle|thedemonapostle]] for D6 conversion\n*[http://starwars.wikia.com/wiki/D-Wing_Space_Superiority_Fighter Wookieepedia] for description",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/D-Wing",
  "retrievedAt": "2025-10-08T13:06:18.952Z"
}