{
  "title": "DeepSpace-class Sensor Ship",
  "pageId": 5735,
  "revisionId": 12505,
  "wikitext": "[[File:deepspace.gif|500px|thumb|right]]\n\n'''DeepSpace-class Sensor Ship'''<br />'''Craft''': Kuat Drive Yards DeepSpace-class Sensor Ship<br />'''Type''': Deep space sensor vessel<br />'''Scale''': Capital<br />'''Length''': 200 meters<br />'''Skill''': Capital ship piloting Deepspace Vessel<br />'''Crew''': 175, '''gunners '''28, '''skeleton '''80/+10<br />'''Crew Skill''': Astrogation 4D, capital ship piloting 4D+2, capital ship gunnery 4D+1, capital ship shields 3D+2, sensors 5D+1<br />'''Passengers''': 52 (troops)<br />'''Cargo Capacity''': 300 metric tons<br />'''Consumables''': 1.5 years<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x10<br />Nav '''Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 6<br />'''Hull''': 4D+2<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 70/1D+2\n*Scan: 140/3D+2\n*Search: 280/4D+2\n*Focus: 7/6D\n'''Weapons''':\n*6 Turbolaser Batteries\n: Fire Arc: 2 front, 2 left, 2 right<br />Crew: 2<br />Skill: Capital ship gunnery<br />Fire Control: 2D<br />Space Range: 3-15/35/75<br />Atmosphere: 6-30/70/150 km<br />Damage: 5D\n*8 Twin Laser Cannons\n: Fire Arc: 2 front, 2 left, 2 right, 2 back<br />Crew: 2<br />Scale: Starfighter<br />Skill: Capital ship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere: 2-6/24/50 km<br />Damage: 4D\n\n'''Starfighter Complement''': 6 TIE/ln starfighters; 6 TIE/rc Reconnaissance starfighters<br />'''Sensor Buoys: '''20 carried\n\n'''Capsule''': Almost having the famous wedge-shaped design as many of Kuat Drive Yards starship productions have it, this particular ship has been developed together with the Broadcast-class Communications Ship. These two ships were intended to play the major role for sensor and communications operations. Both of the two designs were released shortly after the famous Imperial-I Star Destroyer. Although there exist not many sources and documents about the DeepSpace-class and Broadcast-class starships, these ships have always been successful on their missions.\n\nWhile the Broadcast-class is part of specific fleets, the DeepSpace-class operates alone, as being sent into deep space for reconnaissance duty, and what is already implied by its name. The ship only needs a small crew to operate efficiently, a perfect amount for long-term missions. This is also important, because space aboard the ship is very limited, as a big part of the ship consists of a huge sensor wing which contains all of the sensitive sensor technology. The abilities of the sensor wing are immense. The sensors enable the crew to get exact and very detailed \"view\" of the surrounding space. The radius of the ship's sensor range is one of the largest within the Empire.\n\nThe DeepSpace is only lightly armed, but has enough firepower to deal with pirates in depth of space. For additional protection of the ship, there is half a squadron of TIE/ln fighters aboard. The ship also houses another 6 TIE/rc reconnaissance fighters to help completing the sensor view on difficult space terrain, such as asteroid belts, rifts, etc.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/DeepSpace-class%20Sensor%20Ship",
  "retrievedAt": "2025-10-08T08:30:11.563Z"
}