{
  "title": "Draymak Exotique Space Transport",
  "pageId": 5323,
  "revisionId": 10443,
  "wikitext": "[[File:DraymakExotiqueSpaceTransport.jpg|300px|thumb|right]]\n\n'''Draymak Exotique Space Transport'''<br />'''Type''': Combat Space Transport<br />'''Scale''': Starfighter<br />'''Length''': 25 meters<br />'''Crew''': 2<br />'''Crew Skills''': Space Transports: Exotique<br />'''Passengers''': 3<br />'''Cargo Capacity''': 20 metric tons<br />'''Consumables''': 4 months<br />'''Cost''': 3,750,000<br />'''Availability''': 4,X<br />'''Hyperdrive Multiplier''': x.5<br />'''Hyperdrive Backup''': x3<br />'''Nav Computer''': Yes<br />'''Space''': 12<br />'''Atmosphere''': 1000; 1500 kmh<br />'''Maneuverability''': 4D<br />'''Hull''': 7D<br />'''Shields''': 3D (+3D)<br />'''Sensors''':\n*Passive: 35/1D\n*Scan: 70/2D\n*Search: 150/3D\n*Focus: 5/3D+2\n'''Weapons''':\n*Twin Light Tachyon Cannons (Fire Linked)\n: Scale: Starfighter<br />Fire Arc: Front<br />Fire Control: 4D<br />Space Range: 1-5/15/40<br />Atmosphere Range: 100-500/1.5/4km<br />Damage: 8D\n*Two Heavy Blaster Cannons (fire linked)\n: Scale: Starfighter<br />Fire Arc: Front<br />Fire Control: 3D<br />Space Range: .5-3/15/30<br />Atmosphere Range: 50-300/1.5/3km<br />Damage: 7D+2\n*Two Blaster Cannons (fire linked)\n: Scale: Starfighter<br />Fire Arc: Front<br />Fire Control: 3D<br />Space Range: .5-2.5/12/24<br />Atmosphere Range: 50-250/1.2/2.4km<br />Damage: 6D+1\n\n'''Description''': This space transport provides the best of both worlds in that it can haul cargo and take on nearly any fight and win. All of its systems are designed to take tremendous amounts of punishment and continue to deliver extreme performance. The shield system is one of those areas where Mon Calimari technology has been incorporated to improve reliability and survivability. When one generator has been damaged or destroyed another can be brought online to replace it, thereby maintaining full protection during a critical moment.\n\nIn addition to the shields all weapons have been given their own power supplies to keep from draining other systems and continue to deliver maximum firepower. Included in this is a backup power supply that can be connected manually or electronically to any one of the three weapons.\n\nThe obvious downside to all of this is the cost, but think of what is gained with redundant systems! No other ship on the market has all of these features. Certainly no ship has the ability to protect its precious cargo in the same way as the Exotique can. That is why we at Draymak, Inc. have given this ship our highest recommendation for versatility and survivability above every other ship we have produced so far. However, don't take just our word in it. Come take a test flight and learn first-hand what it can do for you.\n\nAs a bonus offer, a purchase of ten or more Exotique ships earns a 10% discount. Fifty plus earns a 20% discount.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Draymak%20Exotique%20Space%20Transport",
  "retrievedAt": "2025-10-07T22:31:53.460Z"
}