{
  "title": "DX-10 Stormtrooper Transport",
  "pageId": 5590,
  "revisionId": 24726,
  "wikitext": "[[File:dx10.jpg|500px|thumb|right]]\n\n'''Craft''': Telgorn Corporation Dx-10 Transport<br />'''Type''': Fast Assault Transport<br />'''Source''': Unofficial<br />'''Scale''': Starfighter<br />'''Length''': 17 Meters<br />'''Skill''': Space Transports: Dx-10<br />'''Crew''': 2<br />'''Passengers''': 30*<br />'''Cargo Capacity''': 30 Tons*<br />'''Consumables''': 1 Month<br />'''Hyperdrive''': x1<br />'''Hyperdrive Backup''': x10<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 2D+1<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 kmh<br />'''Hull''': 5D<br />'''Shields''': 2D+2<br />'''Sensors:'''\n*Passive: 35/1D\n*Scan: 70/2D\n*Search: 110/3D+1\n*Focus: 4/4D\n\n'''Notes:''' *If there are no passengers onboard the Dx-10, the vessel is capable of carrying 30 tons of cargo. If, however, the Dx-10 is carrying passengers, there is only room for 5 tons of cargo.\n\n'''Capsule''': Riding on the success of Dx-9 'Stormtrooper' Transport, Telgorn Corporation launched the Dx-10 Transport shortly after the Battle of Hoth. Marketed as a fast assault transport, the Dx-10 shares a number of similarities with the Dx-9 and boasts a number of improvements over the older design. Unlike its predecessor, however, the Dx-10 is unarmed and must rely on its speed and durability to bypass enemy vessels.\n\nThe Dx-10's chassis is very similar to the Dx-9's hull design, except that it is a little shorter in length and it has a pair of down swept wings. The cockpit and boarding airlock are located in the prow of the vessel, whilst the passenger compartment, assault airlock and storage facilities are located in the middle and aft sections of the craft.\n\nFor normal docking operations, the Dx-10 has an airlock behind its cockpit, which has an access point on both the port and starboard sides. Whilst conducting assault boarding operations, the Dx-10 makes use of its recessed ventral assault airlock (2m \nLong, 2m Wide & 0.8m Recess). This airlock is equipped with electromagnetic and mechanical clamps to dock with the target. It also has a remote-controlled laser cutting facility, which is operated by one of the Dx-10's passengers. This cutting laser is capable of carving its way through the toughest armour plating and because it operates on a flexible robotic arm, it can cut out any shape within the confines of the airlock recess.\n\nFor propulsion, the Dx-10 relies on two of Telgorn's next generation N4 Ion engines. These powerful engines give the Dx-10 a considerable edge over the Dx-9, both in terms of speed and reliability. The engines are mounted on the rear upper left and right sides of the vessel, with the down swept wings just beneath them. In addition to its improved sublight speed, the Dx-10 is fitted with a Class 1 Hyperdrive, making it twice as fast as the Dx-9.\n\nThe Dx-10 has been well received by the market despite some strategists' concerns about its lack of weaponry. The Empire has been particularly keen on the vessel since it fits in with their interdependence military strategy. Imperial Dx-10's are usually deployed with a fighter escort and are used in boarding actions and in transporting priority personnel and equipment. Of course, like most starships in the Empire's service, the Alliance has managed to get their hands on a few of these fast and durable vessels.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/DX-10%20Stormtrooper%20Transport",
  "retrievedAt": "2025-10-07T22:31:51.022Z"
}