{
  "title": "E-wing",
  "pageId": 450,
  "revisionId": 32412,
  "wikitext": "[[File:E-Wing1.jpg|500px|thumb|right]]\n[[File:E-Wing2.jpg|500px|thumb|right]]\n[[File:E-Wing3.jpg|500px|thumb|right]]\n[[File:E-Wing4.jpg|500px|thumb|right]]\n[[File:E-Wing5.jpg|500px|thumb|right]]\n[[File:E-Wing6.jpg|500px|thumb|right]]\n\n='''E-Wing/A'''=\n\n'''Craft''': Frei'Tek Inc. E-wing Starfighter: Type A<br />'''Type''': Attack and close support fighter<br />'''Scale''': Starfighter<br />'''Length''': 11.2 m.<br />'''Skill''': Starship Piloting: E-wing<br />'''Crew''': 1<br />'''Crew Skill''': (See players skills)<br />'''Cargo capacity''': 110kg<br />'''Consumables''': 1 wk.<br />'''Cost''': 185,000 cr.<br />'''Hyperdrive Multiplier''': x2<br />'''Nav Comp''': Uses R7 astromech<br />'''Maneuverability''': 3D+1<br />'''Space''': 11<br />'''Hull''': 5D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 30/0D\n*Scan: 55/1D\n*Search: 85/2D+1\n*Focus'':'' 5/4D\n'''Weapons''':\n*'''Triple Heavy Blaster Cannon''' (fire linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 3D+2<br />Space Range: 1-3/5/8<br />Atmosphere Range: 100-300/500/800<br />Damage: 6D\n*'''One Proton Torpedo Launcher'''\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700<br />Damage: 9D\n\n'''Note''': When a pilot rolls a mishap while firing the blaster cannon, roll on the table below:\n*'''1-3''' Blaster cannon functions normally.\n*'''4''' Blaster cannon shorts out for one round but can be repaired with a Very Easy starship weapon repair roll by R7 unit.\n*'''5''' Blaster cannon burns out. Cannot be repaired in battle. With replacement parts, starship weapon repair difficulty is Moderate and takes one hour.\n*'''6''' Blaster cannon will explode in 1D rounds doing 8D damage.<br />\n\n==='''Capsule'''===\n\nThe E-wing escort starfighter was a single-pilot starfighter developed by FreiTek Inc. It was the first fighter designed entirely under the support of the New Republic.\n\nOn paper, the E-wing could match or exceed the performance of the preceding X-wing series in nearly every respect and was originally intended to supplant the older design in New Republic service. However, the craft suffered from significant problems when first deployed among front-line squadrons, including malfunction issues with the laser cannons and the new R7 astromech units. As a result, many pilots would continue to prefer upgraded versions of the venerable X-wing.\n\nDespite these initial problems, improved models of the E-wing would see wide spread use by the New Republic, particularly by the Fifth Fleet, and later by the Galactic Alliance. They would play a significant role in every engagement from the Black Fleet Crisis, through the Yuuzhan Vong War, and beyond.\n\nBy the time of the Second Galactic Civil War, the E-wing had matured into an excellent starfighter design and equipped several elite squadrons of the Galactic Alliance. However, it never achieved the popularity or wide spread use of the X-wing.\n\nThe E-wing was considered an excellent combination of firepower, maneuverability, speed, and armor, but initial models required the use of the R7-series astromech droid, which was exclusively built for the E-wing.\n\nThe spaceframe of the E-wing was surrounded by two aerodynamic foils which provided stability and increased weapons ability. The nosecone contained the starfighter's powerful sensors, while a concealed astromech droid could easily be positioned midway through the craft. Directly in front of the astromech slot was the cockpit.\n\nThe fighter was heavily armed with three laser cannons and one proton torpedo launcher with a magazine of sixteen torpedoes. Like most Rebel designs, the lasers were spread out and could be set to converge at varying distances.\n\nA single E-wing cost 185,000 credits. Much of the great cost of the E-wing came from the use of the R7 droid, a much more sophisticated and expensive astromech than the classic R2 and R5 astromechs. Later models of the E-wing starfighters were however able to interface with earlier astromech models, such as an R2 or R5 unit.\n\nThe Republic introduced the E-wing during Grand Admiral Thrawn's campaign to rebuild the fallen Empire. The fighter later served in the fight against the \"resurrected\" Palpatine. Built with cutting-edge weapons, shielding, and propulsion systems, the fighter was extremely powerful and well-rounded. It was intended as an escort fighter and could also serve as a medium-range assault craft. It had enough speed to counter TIE/In starfighters and had better armor than other New Republic starfighters, including the X-wing. They were used by the Galactic Federation of Free Alliances during the Second Galactic Civil War, during early skirmishes with Corellia.\n\nThe E-wing had some initial teething problems relating to the placement of the wing lasers near the outboard engines. The synthetic Tibanna gas used for the lasers tended to degrade at accelerated rates, which swiftly rendered those guns near-useless (and cutting gun firepower to a third).Rebel engineers came up with a temporary solution during the World Devastator assault on Mon Calamari. Those problems were eventually resolved and the fighter entered fleet service. It is known to have served at least with the New Republic's Fifth Fleet as the primary fleet space superiority fighter. When the Fifth Fleet was moved to the Koornacht Cluster during the Black Fleet Crisis, many E-wings saw action against the Yevetha in the conflict that ensued.\n\nFour major models appeared to have been designed; the last (Series IV) was introduced around the time of the capture of Coruscant by the Yuuzhan Vong. By that point in the war, the XJ X-wing was rapidly equipping most squadrons in the massive military expansion; the more sophisticated E-wing may have been limited to some elite squadrons. The Series IV E-wing remained in service through the transition from New Republic to Galactic Alliance, and was still in operation as of the Second Galactic Civil War.\n\n='''E-Wing/B'''=\n\n'''Craft''': FreiTek Inc. E-wing Starfighter: Type B<br />'''Affiliation''': New Republic<br />'''Era''': New Republic<br />'''Source''': Dark Empire Sourcebook (pages 108-109), Starships of the Galaxy (page 67), The Essential Guide to Vehicles and Vessels (pages 44-45)<br />'''Type''': Attack and close support fighter<br />'''Scale''': Starfighter<br />'''Length''': 11.2 meters<br />'''Skill''': Starfighter piloting: E-wing<br />'''Crew''': 1<br />'''Crew Skill''': Starfighter piloting 5D, starship gunnery 4D+2<br />'''Cargo Capacity''': 110 kilograms<br />'''Consumables''': 1 week<br />'''Cost''': 185,000<br />'''Hyperdrive Multiplier''': x2<br />'''Nav Computer''': Uses R7 Astromech Droid<br />'''Maneuverability''': 3D+1<br />'''Space''': 11<br />'''Atmosphere''': 435; 1,300 kmh<br />'''Hull''': 5D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 30/0D\n*Scan: 55/1D\n*Search: 85/2D+1\n*Focus: 5/4D\n'''Weapons''':\n*'''Triple Heavy Blaster Cannons''' (fire-linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 3D+2<br />Space Range: 1-5/10/25<br />Atmosphere Range: 100-500/1/2.5 km<br />Damage: 6D\n*'''Proton Torpedo Launcher'''\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700<br />Damage: 9D\n\n==='''Capsule'''===\n\nOnce the Rebel Alliance depended upon preying on unarmed Imperial shipments. Now, the situation is reversed. The Empire has increasingly preyed on Republic shipping and the Republic finds itself hard-pressed to defend its vessels from assault. To address this need, FreiTek, a company formed by the Incom designers who defected and brought the X-wing design with them to the Rebellion, has produced the E-wing.\n\nThe FreiTek E-wing is the first fighter designed and executed entirely under the auspices of the New Republic. Intended as a defensive interceptor, it is a heavy, combat dedicated ship. The vessel is akin to the B-wing and Y-wing designs: designed to take punishment and eager to dish it out. The vessel isn't pretty, but it can hold its own, and isn't nearly as prone to break down as the finicky B-wing. To simplify the design, FreiTek eliminated movable S-foils in favor of a fixed wing design, resulting in a more reliable and cheaper fighter (of course, the cost is still high because of the E-wing's impressive weaponry). A major breakthrough has been a totally redesigned hyperdrive interface. Developed in conjunction with Industrial Automaton, it uses the newly developed R7 astromech droid and is an attempt to recapture the success of the Xwing/R2 interfacing system.\n\nFrom initial tests, the E-wing is a solid design and has performed well according to its pilots, with one exception. According to some, the weapons systems need some work. The original design used synthetically spin-coiled Tibanna gas. Most companies use natural spin-sealing methods, but with the state of the galactic economy, synthetics seemed an economical alternative. Unfortunately, when exposed to the residual engine emissions, the gas's spiral structure breaks down, dramatically decreasing weapon range.\n\nOrdinarily, Republic techs would just replace the artificially coiled gas, but this can take weeks. With the recent crisis at Calamari, there was no time to waste. The techs jury-rigged the weapons by tripling the power intake (an admittedly risky solution, but the only one short of grounding all E-wings for the duration). These models have been dubbed the \"Type B\" to distinguish them. So far, there have been no mishaps, but the technicians are hoping to solve the flaw before any pilots pay the price.\n\n'''Notes''':<br />When a pilot rolls a mishap while firing the blaster cannon, roll on the table below:\n*'''1-3''' - Blaster cannon functions normally.\n*'''4''' - Blaster cannon shorts out for one round but can be repaired with a Very Easy starship weapons repair roll by R7 unit.\n*'''5''' - Blaster cannon burns out. Cannot be repaired in battle. With replacement parts, starship weapons repair difficulty is Moderate and takes one hour.\n*'''6''' - Blaster cannon will explode in 1D rounds doing 8D damage to ship (and pilot).\n\n='''E-Wing/C'''=\n\n'''Craft''': FreiTek Inc. E-wing Starfighter: Type C<br />'''Affiliation''': New Republic<br />'''Era''': New Republic<br />'''Type''': Attack and close support fighter<br />'''Scale''': Starfighter<br />'''Length''': 11.2 meters<br />'''Skill''': Starfighter piloting: E-wing<br />'''Crew''': 1<br />'''Cargo Capacity''': 110 kilograms<br />'''Consumables''': 1 week<br />'''Cost''': Not available for sale<br />'''Maneuverability''': 3D+1<br />'''Space''': 11<br />'''Atmosphere''': 435; 1,300 kmh<br />'''Hull''': 5D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 30/0D\n*Scan: 55/1D\n*Search: 85/2D+1\n*Focus: 5/4D\n'''Weapons'''\n*'''Triple Heavy Blaster Cannon'''s (fire-linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 4D<br />Space Range: 1-5/10/25<br />Atmosphere Range: 100-500/1/2.5 km<br />Damage: 6D\n*'''9 Ordnance Hardpoints'''\n'''Note''': The E-wing/C may be fitted with up to 9 concussion missiles, 9 proton torpedoes, or any combination of the two. Other ordnance includes various free-fall bombs, a pair of \"eggs\", 4 heavy rockets, or 2 heavy space bombs.\n*'''9 Concussion Missiles'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: Starship gunnery<br />Cost: 500 crediits each<br />Fire Control: 1D<br />Space Range: 1-2/8/15<br />Atmosphere Range: 50-200/800/1,500m<br />Damage: 8D\n*'''9 Proton Torpedoes'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: Starship gunnery<br />Cost: 800 credits each<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700m<br />Damage: 9D\n*'''2 \"egg\" bombs '''\n: Fire Arc: front<br />Scale: capital<br />Skill: Starship gunnery<br />Cost: 6,000 credits each (estimated)<br />Fire Control: 3D<br />Space Range: 1/2/5<br />Atmosphere Range: 100/200/500m<br />Damage: 5D\n*'''4 Heavy Rockets'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: Starship gunnery<br />Cost: 2,000 credits each<br />Fire Control: 3D<br />Space Range: 1/2/5<br />Atmosphere Range: 100/200/500m<br />Damage: 10D\n*'''2 Heavy Space Bombs'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: Starship gunnery<br />Cost: 5,000 credits each<br />Fire Control: 3D<br />Space Range: 1/2/5<br />Atmosphere Range: 100/200/500m<br />Damage: 11D\n\n==='''Capsule'''===\n\nThe E-wing type C was created as powerful offensive bomber in tactical situations. The hyperdrives was removed and the wings elongated slightly to allow room for ordinance \"hardpoints\" to carry various payloads of warheads. The type c could be quickly configured and loaded up, then launched into a battle. They were designed specifically to be carried and launched from capital ships and carriers into a battle, for use against enemy capital ships. The ship is also slightly slower and much less agile than the typical E-wing, as a result of the extra ordinance, however it is still superior to the ancient x-wing. The Type C was actually a prototype for some of the systems that would later be used in the K-Wing bomber by Sienar Fleet Systems.\n\n'''Source''': www.RPGGamer.org",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/E-wing",
  "retrievedAt": "2025-10-07T22:29:46.354Z"
}