{
  "title": "Eclipse-class Super Star Destroyer",
  "pageId": 691,
  "revisionId": 12506,
  "wikitext": "[[File:Eclipsessd.jpg|500px|thumb|right]]\n[[File:Eclipsesd.jpg|500px|thumb|right]]\n[[File:Eclipsessd2.gif|500px|thumb|right]]\n\n'''The Eclipse'''<br />'''Craft''': KDY’s Eclipse-class Super Star Destroyer<br />'''Type''': Super Star Destroyer<br />'''Scale''': Capital<br />'''Length''': 17,500 meters<br />'''Skill''': Capital ship piloting: Super Star Destroyer<br />'''Crew''': 708,470. gunners: 4,175, skeleton: 88,500/+10<br />'''Crew Skill''': Astrogation 5D, capital ship gunnery 5D, capital ship piloting 6D, capital ship shields 4D+2, sensors 4D+1<br />'''Passengers''': 150,000 (troops)<br />'''Cargo Capacity''': 600,000 metric tons<br />'''Consumables''': 10 years<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x6<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 4<br />'''Hull''': 15D+2<br />'''Shields''': 11D+1<br />'''Sensors''':\n*Passive: 250/2D\n*Scan: 350/3D\n*Search: 500/4D\n*Focus: 75/5D\n'''Weapons:'''\n*'''Axial Superlaser'''\n: Fire Arc: Front<br />Crew: 75<br />Scale: Death Star<br />Skill: Capital ship gunnery: superlaser<br />Fire Control: 5D<br />Space Range: 5 25/75/150<br />Damage: Gradational output can fire once every minute at minimum energy (1D damage). It can also build a charge of 1D per minute up to 8D. Current reactor can only generate 11D total perday.\n*'''550 Heavy Laser Cannons'''\n: Fire Arc: 200 front. 150 left. 150 right, 50 back<br />Crew: 4<br />Skill: Capital ship gunnery<br />Fire Control: 2D<br />Space Range: 3-15/35/75<br />Atmosphere Range: 6-15/72/150KM<br />Damage: 8D\n*'''500 Turbolaser Batteries'''\n: Fire Arc: 150 front, 125 left. 125 right. 100 back<br />Crew: 2<br />Scale: Starfighter<br />Skill: Starship Gunnery<br />Fire Control: 4D<br />Space Range: 3-15/36/75<br />Atmosphere Range: 600-1.5/7/15KM<br />Damage: 5D\n*'''75 Ion Cannons'''\n: Fire Arc: 25 front. 25 left. 25 right<br />Crew: 4<br />Skill: Capital ship gunnery<br />Fire Control: 2D+2<br />Space Range: 1-10/25/50<br />Atmosphere Range: 2-20/50/100KM<br />Damage: 3D\n*'''100 Tractor Beam Emplacements'''\n: Fire Arc: 55 front, 20 left. 20 right, 5 back<br />Crew: 5<br />Skill: Capital ship gunnery<br />Fire Control: 4D<br />Space Range: 1-5/15/30<br />Atmosphere Range: 2-10/30/60 KM<br />Damage: 6D\n*'''10 Gravity Well Projectors'''\n: Fire Arc: 3 front, 2 left, 2 right, 3 back<br />Crew: 10<br />Skill: Capital ship gunnery: gravity well projector<br />Fire Control: 4D<br />Space Range: 1-5/15/30<br />Damage: Blocks hyperspace travel\n\n'''Capsule''': As long as there have been space fleets, there have been ships designed as command ships, specially armed and armored to serve as symbols of a civilization's power and prestige. Commanded by warlords or generals, they have often turned the tide of battles. The Eclipse, first in a line of new Super Star Destroyers, was the Emperor's flagship at the Battle of Pinnacle Base; unfortunately for the Empire, the Eclipse was destroyed in that fateful confrontation.\n\nThe history of the Eclipse-class Super Star Destroyers is worth noting. This ship was commissioned by Palpatine, to be designed to fit his exact specifications. It was to be the latest in a long line of super weapons. Years in the making, the first of these, the Eclipse, was first planned following the Battle of Hoth. After the Battle of Endor, many suggested the ship be scrapped in favor of more Star Destroyers, yet construction always continued.\n\nWhen finally launched, six years after Endor, the prototype, with its ebony alloyed hull, incorporated all the significant weapons improvements of the past few decades, including gravity well projectors, improved ion cannons and new enhanced hyperdrive and sublight engines for maximum reaction speed. Fifty TIE Interceptor and eight TIE bomber squadrons nestled inside cavernous hangars large enough for an entire Victory-class Star Destroyer. Measuring over 17,000 meters long, the Eclipse was one of the largest fighting ships ever constructed.\n\nAll troops on board are specially selected, including a newly formed legion of Royal Guards and a COMPForce Assault Battalion. There are support troops to man the five prefabricated garrison bases and 100 multi-environment All Terrain Armored Transports. The Emperor has also added a cadre of Sovereign Protectors as his personal bodyguards. The most important advancement in the Eclipse is its main weapon, a spine-mounted superlaser modeled on the main weapon of the Death Star itself. The Death Star's prime weapon was composed of eight individual lasers that could focus together, generating enough power to destroy an entire planet. By comparison, the Eclipse carries only a single laser, but recent focusing and generator advances make this ray much more powerful than the units used on the Death Star. The beam packs enough destructive power to shatter the most powerful planetary shields and sear whole continents in a flash.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Eclipse-class%20Super%20Star%20Destroyer",
  "retrievedAt": "2025-10-08T08:30:14.504Z"
}