{
  "title": "Eumenes",
  "pageId": 564,
  "revisionId": 11854,
  "wikitext": "[[File:Eumenes.jpg|thumb|500px]]\n\n'''Craft''': Eumenes<br />'''Type''': Illuthian space superiority wasp fighter<br />'''Scale''': Starfighter<br />'''Length''': 18 meters<br />'''Skill''': starfighter piloting: wasp fighters<br />'''Crew''': 1<br />'''Passengers''': (4 troops)<br />'''Cargo Capacity''': 5 cubic meters<br />'''Consumables''': 1 month<br />'''Hyperdrive Multiplier:''' 1x<br />'''Hyperdrive backup''': 2x<br />'''Nav Computer''': Yes<br />'''Manuverability''': 2D+1<br />'''Space''': 7<br />'''Atmosphere''': 350; 1000 KMH<br />'''Hull''': 4D+2 (6D+1 energy)<br />'''Shields''': none<br />'''Sensors''':&nbsp;\n*Passive: 30/1D\n*Scan: 60/2D\n*Search: 90/4D\n*focus 4/4D+1\n'''Weapons''':\n*'''3 Heavy ShockBlasts''' (linked)*\n: Fire arc: Front<br />Crew: pilot<br />Ammo: 50 shots<br />Skill: Starship gunnery<br />Fire control: 3D<br />Space range: 1-3/12/25<br />atmosphere range: 100-300m/1.2km/2.5km<br />Damage: 6D+2\n*'''2 Crash Missiles Launchers''' (12 missiles each)\n: Skill: starship gunnery<br />Fire arc: Front<br />Fire control: 3D<br />Range: 2-12/30/60<br />Damage: 4D Ionisation\n*'''Sting launcher'''\n: Fire arc: front<br />Scale: Starfighter<br />Fire control: 2D<br />Space range: 1-5/10/17<br />Damage: 5D\n*'''Boarding spike'''\n: Skill: starship gunnery<br />Fire control: 2D&nbsp;<br />Space Rang: .2\n\n'''Notes''':\n*Illuthian shockblast weapons are much like Blasters in most respects, though they have some solid matter in them, they are like very small missiles will a charged electric field which delivers a shock upon impact, due to the shock enemy ships suffer -1 to space after being hit for 3 rounds(not to exceed -2). The loss in speed is due to the violent nature of the impact and the light electric shocks which often cause the targets engines to appear to be overloading.\n\n'''Capsule''': Located in the rear lower portion of the ship where the Wasps stinger is. It has bee adapted to work as a boarding ramp of sorts. When a target is neutralised, the ship will get close, extend, and ram the spike into the hull of the enemy ship. If the operator of the unit roles a difficult roll, the boarding spike, or stinger, is successful in penetrating the outer hull, and unless a mishap occurs an air seal is established and Illuthians are free to board the enemy ship instantly.\n\nThe Eumenes or “sidewing” is the Illuthian space superiority fighter. Heavily armed, and versatile.\n\nThey are also created from the colossus wasp. Not much has been changed excluding the placement of one wing on the left side. The wing is made of a metal alloy, and contains several weapon placements. The stinger is an active boarding spike, the Eumenes is used in boarding attacks, each capable of releasing several troops into an enemy ship at strategic points.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Eumenes",
  "retrievedAt": "2025-10-07T22:29:46.841Z"
}