{
  "title": "F-45B HI-TIE Medium Starfighter",
  "pageId": 602,
  "revisionId": 11802,
  "wikitext": "[[File:F-45B-HI-TIE-Medium-Starfighter.jpg|thumb|500px]]\n\n'''Craft''': IMS' F-45B \"Phoenix\" High-output Triple Ion Engine Medium Starfighter (HI-TIE)<br />'''Type''': Medium starfighter<br />'''Scale''': Starfighter<br />'''Length''': 6.8 meters<br />'''Crew''': 1<br />'''Skill''': SF piloting: F/A-45<br />'''Crew Skill''': Sensors 3D+1, SF piloting 5D, SS gunnery 4D+2, SS shields 4D<br />'''Cargo Capacity''': 40 kg<br />'''Consumables''': 3 days<br />'''Hyperdrive Multiplier''': x2<br />'''Nav Computer''': 4 jumps only<br />'''Maneuverability''': 2D<br />'''Space''': 14<br />'''Atmosphere''': 540; 1,550 kmh<br />'''Hull''': 2D<br />'''Shields''': 2D+1<br />'''Sensors''':\n*Passive: 10/1D\n*Scan: 35/1D+2\n*Search: 70/2D+1\n*Focus: 2/3D\n'''Weapons'''\n*'''2 Chin-Mounted Laser Cannons''' (fire-linked)\n: Fire Arc: Front<br />Skill: SS gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5km<br />Damage: 5D\n*'''Adv. Concussion Missile Launcher''' (between laser cannons)\n: Fire Arc: Front<br />Skill: SS gunnery<br />Fire Control: 2D<br />Ammo: 6<br />Space Range: 1-4/16/20<br />Atmosphere Range: 100-400/1.6/2.0km<br />Damage: 8D\n\n'''Capsule''': The F-45B \"Phoenix\" High-output Triple Ion Engine (HI-TIE) Medium Starfighter is the newest to the TIE series, and definitely the most capable. It is equipped with the new HI-TIE propulsion and maneuverability system, which allows it to become nearly as quick and agile as the SFS TIE Defender, but the Phoenix can stay in combat for over 3 hours. This is nearly 3 times as long as any other TIE craft, thanks to the HI-TIE system. However, high stress levels are placed upon the pilot and craft, and can tear itself apart if traveling at high speeds for too long.\n\nWeaponry for the Phoenix is seemingly below par for such an advanced fighter, but when the concussion missiles start firing, the target is as good as dead. The laser cannons draw directly from the reactor of the Phoenix, which boosts their destructive capability twofold. While that may not seem like a lot, consider the power of all four of the lasers of the SFS TIE Avenger, and double it. And all that power in two laser cannons. These and other numerous advances in starfighter technology make the Phoenix the fastest and most maneuverable fighter in the Empire.Tactical Deployment: The Phoenix is classified as Top Secret, as various warlords and defunct leaders claim leadership rights to the Empire. This craft is to be deployed as Logistics see fit, usually 1 flight or element per Star Destroyer.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/F-45B%20HI-TIE%20Medium%20Starfighter",
  "retrievedAt": "2025-10-07T22:29:47.342Z"
}