{
  "title": "Family Getabout",
  "pageId": 507,
  "revisionId": 10925,
  "wikitext": "'''Craft''': Corellian Engeneering Corperation - Getabout<br />'''Type''': Light personal transport<br />'''Scale''': Starfighter<br />'''Length''': 8m<br />'''Skill''': Space transports - Getabout transport<br />'''Crew''': 1<br />'''Passengers''': 5<br />'''Cargo Capacity''': 1 ton<br />'''Consumables''': 1 week<br />'''Hyperdrive''': x3<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 2D<br />'''Space''': 6<br />'''Atmosphere''': 330; 950kmh<br />'''Hull''': 2D<br />'''Shields''': 0D<br />'''Sensors'''\n*Passive: 20/0D\n'''Weapons''': None<br />'''Availability''': 2<br />'''Cost''': 30,000 (new); 18,000 (used)\n\n'''Capsule''': The Getabout was Corellian Engineering Corporation's attempt to bring the space ship market to the common individual.  It was designed to be like the average family's airspeeder, but for use between systems.  The craft is basically just a people transport, and as such is not extremely roomy, nor does it have a great storage capacity.  Luxury was minimized to keep the price tag within the upper-middle class of most space tech planets. It is equipped with some items to make hyperspace jumps less tedious including a music player and a small holo-chess set.\n\nThe ship is appointed much the same as a upper end airspeeder, with plush comfortable seats and a cloth interior with trim. With the intention that passengers remain seated throughout the journey, the seats are able to rotate so they can face forward, or turn to face each other with the chess table in the center.  Five people can be transported this way. The ship was probably more successful than it should have been, but this is mostly because nobody else thought of it and it has cornered the market.  Most civilians choose to travel by charter or on inter-system liners rather than in their own personal craft, as a result, no competitor models have ever been released onto the market.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Family%20Getabout",
  "retrievedAt": "2025-10-07T22:31:57.973Z"
}