{
  "title": "Ferret",
  "pageId": 5567,
  "revisionId": 10679,
  "wikitext": "[[File:Ferret.jpg|400px|thumb|right]]\n\n'''Ferret'''<br />'''Craft''': Republic Engineering Corporation Reconnaissance Vessel<br />'''Affiliation''': New Republic<br />'''Era''': New Republic<br />'''Source''': Cracken’s Threat Dossier (page 83)<br />'''Type''': Stealth spyship<br />'''Scale''': Starfighter<br />'''Length''': 28 meters<br />'''Skill''': Space transports<br />'''Crew''': 3<br />'''Crew Skill''': Astrogation 5D, sensors 5D<br />'''Cargo Capacity''': 2 metric tons<br />'''Consumables''': 3 months<br />'''Cost''': Not available for sale (890,000 credits for government sale)<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': x8<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 2D<br />'''Space''': 10 (5 using baffled drive)<br />'''Hull''': 2D<br />'''Sensors''':\n*Passive: 50/1D\n*Scan: 100/3D\n*Search: 200/4D\n*Focus: 6/4D+2\n'''Stealth''': +5D to sensor difficulties<br />'''Weapons''':\n*2 Missile Launchers\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 1-2/8/15<br />Atmosphere Range: 100-200/800/1.5 km<br />Damage: 7D\n\n'''Capsule''': Simply stated, the ferret was an automated, pilotless version of the larger, crewed Prowler-class reconnaissance vessel.\n\nEvery element of the ferret's design contributes to its ability to covertly enter hostile territory, collect intelligence, and remain virtually undetected during departure. Its 28 meter-long hull was coated in materials that negated most sensors while a unique baffled drive system provided it the ability to move at sublight speeds while leaving minimal trail. In addition to the baffling, the ferret's primary sublight drive ran on chemical thrust, avoiding detectable ion emissions.\n\nWhile shieldless, the ferret was armed with a pair of concussion missile dispensers. If a ferret's defenses were overwhelmed, its droid brains were set to purge the onboard computers and trigger a baradium charge to detonate its missile cache, destroying the vessel.\n\nA small quantity were refitted as couriers to rapidly shuttle one or two occupants, or important material, to desired destinations. The automaton would perform all the necessary piloting, and would linger over the destination, usually just long enough to relay telemetry or messages to another communications post.\n\nShips of this class were given alphanumeric designations such as D-89m IX-26, and IX-44F.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Ferret",
  "retrievedAt": "2025-10-10T19:11:51.993Z"
}