{
  "title": "Firespray Patrol/Attack Craft",
  "pageId": 5641,
  "revisionId": 10851,
  "wikitext": "[[File:Firespray.jpg|500px|thumb|right]]\n\n'''Firespray Patrol/Attack Craft'''<br />'''Craft''': Kuat Systems Engineering Firespray-class Patrol Vessel<br />'''Affiliation''': General<br />'''Era''': Rise of the Empire<br />'''Source''': Pirates & Privateers (page 75), Starships of the Galaxy (page 81), The Essential Guide to Vehicles and Vessels (pages 144-145)<br />'''Scale''': Starfighter<br />'''Length''': 21.5 meters<br />'''Skill''': Space transports: Firespray patrol/attack craft<br />'''Crew''': 1; '''gunners''': 2<br />'''Passengers''': 4<br />'''Cargo Capacity''': 70 metric tons<br />'''Consumables''': 1 month<br />'''Cost''': 120,000 (new); 45,000 (used)<br />'''Hyperdrive Multiplier''': x3<br />'''Hyperdrive Backup''': x15<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 5<br />'''Atmosphere''': 295; 850 kmh<br />'''Hull''': 4D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 50/1D+1\n*Focus: 2/2D\n'''Weapons''':[[File:Firespray2.jpg|500px|thumb|right]]\n*2 Twin-Mounted Blaster Cannons (fire separately)\n: Fire Arc: Turret<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/10/20<br />Atmosphere Range: 100-300/1/2 km<br />Damage: 4D\n\n'''Capsule''': The Firespray-31-class patrol and attack craft, or Firespray-class starship, or Firespray-class interceptor, was a patrol and transport starship designed by Kuat Systems Engineering initially for use by the Republic Correctional Authority. The most well known of the starships was Jango and Boba Fett's ship, the Slave I. \n\nAs a prisoner transport, the ship featured numerous holding cells and devices made for the most exotic of creatures. A trademark of the ship was that it landed horizontally with the drive engines facing the surface and the cockpit facing upward. To transition to normal flight mode, the ship rotated so that the cockpit faced forward while the drive engines faced rearward.\n\nThe stock ship was well armed and armored for its size, with on-board storage space and room for several passengers and/or cargo. Roughly as fast as Koensayr's Y-wing starfighter/bomber, the ship had more than enough speed and maneuverability to intercept smugglers and other renegades. \n\nKuat Systems Engineering produced several prototypes shortly before the Battle of Naboo. However, all but one were destroyed when Jango Fett staged a prison break on Oovo IV. Jango kept the sole remaining Firespray, renaming it Slave I. Kuat Systems Engineering, suffering from the financial loss of the prototypes, eventually mothballed the project and concentrated instead on starship upgrades.\n\nMany years later, K.S.E. found themselves on a more secure financial footing, and again desired to enter the starship market. The company then re-introduced the Firespray-class, hoping to build upon the reputation of the remaining prototype and its legendary pilot, Boba Fett.\n\nThe new Firesprays were, like the original prototypes, designated as patrol and attack ships and perfectly suited for law enforcement and interdiction missions. With Kuat Systems Engineering keen to expand the market for the ship, they had started to promote how easily the ship could be customized and upgraded to fulfill a myriad of roles.\n\nAt least ten were used by the Mandalorian Protectors during the Yuuzhan Vong War. By 137 ABY, these ships were legendary, but regarded as myth. During this time, Deliah Blue found and rebuilt a decaying one.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Firespray%20Patrol%2FAttack%20Craft",
  "retrievedAt": "2025-10-07T22:31:59.933Z"
}