{
  "title": "Foray-class Blockade Runner",
  "pageId": 7670,
  "revisionId": 14508,
  "wikitext": "[[File:Foray-class Blockade Runner1.jpg|thumb|500px|right]]\n[[File:Foray-class Blockade Runner2.jpg|thumb|500px|right]]\n[[File:Foray-class Blockade Runner3.jpg|thumb|500px|right]]\n\n'''Foray-class Blockade Runner'''<br />'''Craft''': Republic Fleet Systems Foray-class Blockade Runner<br />'''Type''': Protection/Interdiction Corvette<br />'''Scale''': Capital<br />'''Length''': 155 meters<br />'''Skill''': Capital Ship Piloting<br />'''Crew''': 55; '''gunners''': 16; '''skeleton''': 20 / +5<br />'''Cost''': 3,000,000 new (estimated, not for sale)<br />'''Passengers''': 300<br />'''Cargo Capacity''': 2,800 tons<br />'''Consumables''': 9 months<br />'''Hyperdrive''': x2<br />'''Nav Com'''puter: yes<br />'''Maneuverability''': 2D<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 km/h<br />'''Hull''': 3D<br />'''Shields''': 1D+2<br />'''Sensors '''+1D, range 75\n*Passive:75/0D\n*Scan:150/1D\n'''Weapons'''\n*'''2 Turbolaser Batteries '''\n: Fire Arc: turret<br />Crew: 5<br />Scale: capital<br />Skill: capital ship gunnery<br />Fire Control: 1D<br />Space Range: 3 - 10 / 25 / 50<br />Atmosphere Range: 6-20/50/100km<br />Damage: 5D\n*'''6 Laser Cannons '''\n: Fire Arc: turret<br />Crew: 1<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 2D<br />Space Range: 1 - 3 / 10 / 20<br />Atmosphere Range: 100-300/1,000/2,000m<br />Damage: 4D\n'''Notes''': Crew requirements vary with different configurations, from 40 to 100.\n\n'''Capsule''': Along with the Hammerhead-class Cruiser, the Foray-class Blockade Runner was designed during the complete overhaul of the Republic Navy following the Great Sith War. Since the Commercial Protectorate Acts ensured that the Navy's funding was now directly tied to the profitability of commerce within the Republic, there was an immediate need to provide enough ships to extend the Navy's power across the spacelanes. Unlike the earlier battleships of the Great Sith War, the economical Foray-class vessels were an efficient way of providing protection for as much territory as possible.\n\nThe biggest drawback to the Foray-class ships was that they were simply not as powerful and versatile as the Hammerhead Cruisers. In an attempt to mitigate this drawback, Forays were often deployed in pairs. In practice, a pair of Forays was found to be almost as effective for most missions as a single Hammerhead, while costing slightly less. Despite this, most admirals preferred to use Hammerheads whenever possible.\n\nWhen the Mandalorian Wars erupted, and the Navy found itself facing the full might of the Mandalorian clans rather than the disorganized pirates which had previously been the biggest threat, Foray-class vessels were found to be completely inadequate for these pitched battles. At first it seemed that the ships would be removed from service, but the Republic needed every ship that could be found. It was during this conflict that the Foray-class gained the designation of Blockade Runner, as the craft were found to be well suited to slipping past Mandalorian blockades with vital shipments of supplies and troops.\n\nFollowing the defeat of the Mandalorians, and the disappearance of Revan with the bulk of the Republic's heavy capital ships, the Republic Navy once again found itself relying almost exclusively on Forays and Hammerheads. When Revan returned at the head of a massive Sith fleet, igniting the Jedi Civil War, Forays again found themselves pressed into service in fleet engagements for which they were not well suited, for the simple reason that there was little else available to the beleagured Republic forces.\n\nLike the Hammerheads, Foray-class Blockade Runners would continue to serve the Republic for many decades to come.\n\n'''Source''': KORSE p183 (no laser cannons). Converted from d20 Saga Edition rules.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Foray-class%20Blockade%20Runner",
  "retrievedAt": "2025-10-08T08:30:18.036Z"
}