{
  "title": "Gallofree Medium Transport",
  "pageId": 5544,
  "revisionId": 51273,
  "wikitext": "[[File:GallofreeMediumTransport.jpg|400px|thumb|right]]\n\n[[File:GallofreeTransport.jpg|thumb|400px|thumb|right]]\n\n'''Gallofree Medium Transport'''<br />'''Craft''': GR-75 medium transport<br />'''Affiliation''': General / Rebel Alliance<br />'''Era''': Rise of the Empire<br />'''Source:''' Rebel Alliance Sourcebook (page136), Star Wars Trilogy Sourcebook SE (pages 140-141), The Star  Wars Sourcebook (pages 48-49), Pirates & Privateers (page 67-68), Heir to the Empire Sourcebook (pages 129-130), Starships of the Galaxy (page 82), The Essential Guide to Vehicles and Vessels (pages 134-135)<br />'''Type''': Medium transport<br />'''Scale''': Capital<br />'''Length''': 90 meters<br />'''Skill''': Space transports: Gallofree Yards transport<br />'''Crew''': 6, '''gunners''': 1, '''skeleton''': 3/+10<br />'''Crew Skill''': Astrogation 4D, space transports 4D, starship gunnery 3D+1, starship shields 3D<br />'''Cargo Capacity''': 19,000 metric tons<br />'''Consumables''': 6 months<br />'''Cost''': 350,000 (new), 125,000 (used)<br />'''Hyperdrive Multiplier''': x4<br />'''Space''': 2<br />'''Atmosphere''': 225; 650 kmh<br />'''Hull''': 2D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':\n*4 Twin Laser Cannons (fire-linked)\n: Fire Arc: Turret<br />Crew: 1<br />Scale: Starfighter<br />Skill: Starship gunnery<br />Fire Control: 1D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 4D\n\n'''Capsule''': These transports are just large enough to be useful for some fleet replenishment tasks - medicine, clothing, small arms, light equipment and so forth - though they are not big enough to  economically transport bulk Items such as food or fuel.  Unfortunately, as the Alliance hasn't got many large craft, they are forced to push these transports to their limits.\n\nThough not specifically designed as such, medium transports can also carry passengers. A few have been converted into miniature hospitals, communications centers, and so forth.\n\nMedium transports are virtually helpless in battle. they are slow, unwieldy, and very lightly armed and shielded. They are small enough to be vulnerable to starfighter attacks, but not so small that they aren't tempting targets for capable warships. The best thing that can be said about them is that they are cheap. \n\nThe Alliance got most of its medium transports direct from the manufacturer, Gallofree Yards Inc., buying through third-party agents for well below suggested retail price when Gallofree went bankrupt several years back. Rebel spacers insist the Empire was fully aware the A1liance was buying the transports, but they let them purchase them anyway because they thought the ships would cause more grief than good.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Gallofree%20Medium%20Transport",
  "retrievedAt": "2025-10-07T22:32:00.460Z"
}