{
  "title": "Geonosian Solar Sailer",
  "pageId": 5170,
  "revisionId": 10932,
  "wikitext": "[[File:GeonosianSolarSailer1.jpg|300px|thumb|right]]\n\n'''Craft''': Huppla Pasa Tisc Shipwrights Collective’s Punworcca 116-class Interstellar Sloop<br />'''Type''': Custom transport<br />'''Scale''': Starfighter<br />'''Length''': 16.76 meters<br />'''Skill''': Space transports: solar sailer<br />'''Crew Skill''': 4D+2<br />'''Crew''': 1 (1 can coordinate)<br />'''Passengers''': 1<br />'''Cargo Capacity''': 300 kilograms<br />'''Consumables''': 1 month<br />'''Cost''': Not available for sale<br />'''Maneuverability''': 3D+1<br />'''Space''': 6<br />'''Move''': 330, 950 kmh<br />'''Hull''': 3D<br />'''Shields''': 2D+1<br />'''Sensors''':\n*Passive: 20/1D\n*Scan: 45/2D\n*Search: 80/3D\n*Focus: 2/3D+2\n'''Weapons''':[[File:GeonosianSolarSailer2.jpg|300px|thumb|right]]\n*'''1 Array of 84 miniature Tractor/Repulsor Beams'''\n: Fire Arc: 14 left, 14 right, 14 top, 14 bottom, 14 front, 14 back<br />Crew: 1<br />Skill: Tractor beam operation<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.3/2.5 km<br />Damage: 4D\n\n'''Capsule''': The Punworcca 116-class interstellar sloop was a solar sailer designed by the Huppla Pasa Tisc Shipwrights Collective of Geonosis, using Gree technology for the solar sail, though not all of the vessels possessed sails. Count Dooku used such a vessel to enter and leave Coruscant undetected. \n\nThe seed-shaped vessel bore a resemblance to the smaller Geonosian starfighter, though the sloop had room inside for two pilots, a bunk, and cargo space. Though unarmed, the solar sloop featured eighty-four miniature tractor beam projectors fitted to the forward prongs, which acted both as steering aids and emergency grapple weapons.\n[[File:GeonosianSolarSailer3.jpg|300px|thumb|right]]\nCount Dooku received an interstellar sloop as a gift from his Geonosian benefactors prior to the Clone Wars. To the Geonosian sloop, Dooku added a unique and ancient solar sail acquired in the Gree Enclave. Fitted to his vessel, the solar sail propelled the sailor through mysterious means; regular solar sailors used sails that unfurled to moon-like diameters, catching tachyon streams and ultraviolet lasers. An FA-4 pilot droid flew the sailor for Dooku, who was often found in the rear hold, perusing the on board databook library. \n\nWhen war erupted on Geonosis, Dooku fled to his secret hangar in the desert, intent on fleeing the massive battle between Republic and Separatist forces. Dooku was waylaid by Obi-Wan Kenobi, Anakin Skywalker, and Yoda, and barely managed to escape into the safety of his sailer. The solar sailer left Geonosis far behind, heading for a dark rendezvous with Dooku's Master, Darth Sidious, in The Works on Coruscant.\n\nDooku apparently had at least one decoy sloop, and Asajj Ventress also used a Punworcca 116 during her mission to Ruul and at the Battle of Rugosa, although she may simply have been using Dooku's own sloop. Some credence may be given to both explanations, as Dooku's later apprentice Savage Opress also utilized a solar sailor.\n\nDuring Dooku's escape to Vanqor, during the Skirmish at Vanqor, his sloop was shot down and crashed. Hondo Ohnaka and his pirate gang salvaged the ship and claimed it as their own.\n\nAn example of this vessel was identified as a distinctive \"Geonosian fantail\" by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker when they discovered it on Tythe, but it is unclear if this means the Punworcca 116 bore any relation to the Fantail warships employed by the Corporate Alliance.\n\nDooku continued to use his sloop throughout the Clone Wars, and during the Battle of Coruscant, he met with General Grievous on board the Invisible Hand after departing Tythe—via Nelvaan—in his sloop. The solar sailer was presumably aboard the Invisible Hand at the time of its destruction over Coruscant.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Geonosian%20Solar%20Sailer",
  "retrievedAt": "2025-10-10T19:11:54.995Z"
}