{
  "title": "Guardian Light Cruiser",
  "pageId": 5643,
  "revisionId": 10855,
  "wikitext": "[[File:GuardianLightCruiser.jpg|500px|thumb|right]]\n\n'''Guardian Light Cruiser'''<br />'''Craft''': Sienar Fleet Systems Guardian-class light cruiser<br />'''Affiliation''': Empire<br />'''Era''': Rise of the Empire<br />'''Source''': Core Rulebook (page 256), Pirates & Privateers (page 84), The Far Orbit Project (pages 77-78)<br />'''Type''': Inter-system customs vessel<br />'''Scale''': Starfighter<br />'''Length''': 42 meters<br />'''Skill''': Space transports: Guardian cruiser<br />'''Crew''': 16 (3 can coordinate), '''gunners''': 4, '''skeleton''': 8/+10<br />'''Crew Skill''': Space transports 5D, starship gunnery 5D+2, starship shields 5D+1<br />'''Passengers''': 6 (prisoners in brig)<br />'''Cargo Capacity''': 200 metric tons<br />'''Consumables''': 3 months<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': x10<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 9<br />'''Atmosphere''': 400; 1,150 kmh<br />'''Hull''': 5D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 30/1D\n*Scan: 60/2D\n*Search: 90/4D\n*Focus: 4/4D+1\n'''Weapons''':\n*4 Laser Cannons\n: Fire Arc: 2 front, 2 turret<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 2D+2<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 5D\n\n'''Capsule''': These cruisers were quick, tough, hard-hitting ships which were intended to patrol remote systems without the immediate fear of destruction. The Guardian-class was quite capable of handling common freighter and smuggler traffic, however, it was not well equipped for boarding actions as it lacked space for a boarding party.\n\nGuardian cruisers were totally outclassed when deployed against capital ships. These ships could be outfitted with external docking racks to carry TIE Fighters; however, this modification reduced the Guardian-class's maneuverability. \n\nIn the Empire's formative years, this type of downscaled warship was designed by Sienar Fleet Systems to patrol remote sectors. The Guardian-class became one of the three main ship classes employed by Imperial Customs, and was thus a common Imperial system patrol craft.\n\nGuardians, which were in service from before the Battle of Nar Shaddaa, were a common sight in lightly populated, isolated systems where the Galactic Empire needed to maintain a presence without underwriting the expense of assigning a larger vessel to patrol duty. Also, these light cruisers often patrolled with corvette or frigate support.\n\nThese ships also saw use outside the Imperial military. The privately owned station known as \"The Wheel\", a gambling haven located in the Besh Gorgon System employed ten of these cruisers for traffic control duty in its security forces. Political entities such as the House Pelagia in the Tapani sector maintained these ships as well. One such ship was the Reprise.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Guardian%20Light%20Cruiser",
  "retrievedAt": "2025-10-07T22:32:05.059Z"
}