{
  "title": "H-2 Deuterium-class Scoutship",
  "pageId": 5403,
  "revisionId": 10466,
  "wikitext": "[[File:H-2Deuterium-classScoutship.gif|500px|thumb|right]]\n\n'''H-2 Deuterium Mark V Scoutship'''<br />'''Craft''': Corellian Engineering Corporation H-2 Deuterium Mark V Scoutship<br />'''Type''': Light scoutship<br />'''Scale''': Starfighter<br />'''Length''': 30.2 meters<br />'''Skill''': Space transport piloting: H-2 Deuterium Scoutship<br />'''Crew''': 1 (2 can coordinate), 2 droids<br />'''Crew Skill''': Varies<br />'''Passengers''': 4<br />'''Cargo Capacity''': 100 metric tons<br />'''Consumables''': 1 year<br />'''Cost''': 22,000 (used), 350,000 (in mint condition to collectors)<br />'''Hyperdrive Multiplier''': x5<br />'''Hyperdrive backup''': x33<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 0D+1<br />'''Space''': 3<br />'''Atmosphere''': 330; 950 kmh<br />'''Hull''': 5D<br />'''Shields''': 0D+1<br />'''Sensors''':\n*Passive: 20/1D\n*Scan: 120/2D+2\n*Search: 120/2D+2\n*Focus: 4/2D\n'''Weapons''':\n*Laser Cannon\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 1D+2<br />Space Range: 1-5/10/17<br />Atmosphere Range: 100-500/1/1.7 km<br />Damage: 2D+2\n\n'''Capsule''': The H-2 Deuterium-class scoutship is an older and discontinued line of scoutships put out by CEC. By the Empire's standards it is slow in real space and seems even slower in hyperspace than anything other than the StarCab, it boasts a very heavy hull, plenty of cargo space for samples and vehicles, and a unique sensor suite.\n\nThe impressive hull strength has definite drawbacks, that, in part aided the eventual discontinuation of the Deuterium line. When a major component of the ship was damaged and needed replaced or repaired, large sections of the hull plating had to be removed in their entirety, while this was convenient for large fleets of the vessels, small operations decided that this was more trouble then the vessel was worth. (In game terms this means that two repair rolls are required to replace or fix a part.)\n\nThe sensors provided better detection then many ships even of this day and age are very fragile. The design was conceived by a pair of Given miners who had spend a little too much time off on their own. They are a mass of jumbled wires and parts that, once damaged require the expertise that many of the most skilled technicians do not posses. (If damaged in anyway a difficult Space Transport Engineering roll is required in order to repair them.) The technical know how to manufacture these units was lost when the Given died. Naturally, very few of these systems are still in operation, but if someone is lucky enough to find one that is, corporations like KDY and CEC would pay large sums for a working unit.\n\nWhen released a little over 500 years before the Clone Wars, the Deuterium saw little use near the core as it was confined to its designated role of scoutship. As time went on, the little craft became more popular among free traders, and even some smugglers begun to use them to haul small amounts of cargo. Though in these other roles they never became as popular as the YT-series, they still were a common site in space for several decades. Today some can still be seen in the service of scouts and others, the owners, when not upgrading old systems or adding new ones, seem content to run an otherwise outdated ship on scouting missions.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/H-2%20Deuterium-class%20Scoutship",
  "retrievedAt": "2025-10-10T19:12:05.399Z"
}