{
  "title": "Hapan Battle Dragon MK II",
  "pageId": 713,
  "revisionId": 12321,
  "wikitext": "[[File:battledragon.jpg|500px|thumb|right]]\n\n'''Craft''': Olanji/Charubah Battle Dragon II<br />'''Type''': Heavy Assault Warship<br />'''Scale''': Capital<br />'''Length''': 500 Meters in diameter<br />'''Skill''': Capital ship piloting: Hapan Battle Dragon<br />'''Crew''': 1,210, '''gunners''': 190, '''skeleton '''700/+10<br />Crew Skill: Astrogation 5D, capital ship gunnery 5D+2, capital ship piloting: Hapan Battle Dragon 6D, capital ship shields 6D+2, communications 5D+2, sensors 4D+2<br />Passengers: 500 troops<br />'''Cargo Capacity''': 4000 metric tons<br />'''Consumables''': 1 year<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x14<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 4<br />'''Hull''': 7D+2<br />'''Shields''': 2D+1<br />'''Sensors'''\n*Passive: 50/1D\n*Scan: 100/3D\n*Search: 200/4D\n*Focus: 6/4D+2\n'''Weapons''':\n*40 Turbolaser Batteries\n: Fire Arc: Rotational*<br />Crew: 3<br />Skill: Capital Ship Gunnery<br />Fire Control: 2D<br />Fire Rate: 1<br />Space Range: 3-15/35/75<br />Atmosphere Range: 30-150/350/750<br />Damage: 6D\n*40 Ion Cannons\n: Fire Arc: Turret<br />Crew: 2<br />Skill: Capital Ship Gunnery<br />Fire Control: 3D<br />Space Range: 1-10/25/50<br />Atmosphere Range: 2-20/50/100km<br />Damage: 3D\n*4 Pulse Mass Generator Tubes\n: Fire Arc: 1 front, 1 right, 1 left, 1 rear<br />Crew: 3<br />Skill: Capital Ship Gunnery: Pulse Mass Generator<br />Fire Control: 5D<br />Space Range: 1-5/75/150<br />Ammo: 16<br />Damage: Blocks hyperspace travel, each mine equals a 30 unit diameter\n*2 Triple Ion Cannons\n: Fire Arc: Turret<br />Crew: 2<br />Skill: Capital Ship Gunnery<br />Fire Control: 1D<br />Space Range: 2-20/50/80<br />Damage: 3D+2\n*10 Tractor Beam Projectors\n: Fire Arc: Turret<br />Crew: 3<br />Skill: Capital Ship Gunnery<br />Fire Control: 4D<br />Space Range: 1-5/15/30<br />Damage: 6D\n\n'''Capsule''': Hapan Battle Dragons have their turbolasers on a rotational track, which spins to replace previously fired turbolasers with fresh ones. If used in this manner, a particular fire arc may receive up to three times the normal amount of fire from a Battle Dragon's turbolasers in a single round.Following the Battle of Fondor, in which a large portion of a Hapan battle fleet was destroyed by the blast from Centerpoint Station, the New Republic turned over the long-withheld quick-recharge turbolaser technology the Hapans had sought for many years. Though the Hapans were dealt a terrible blow on the battle, the newly reconfigured and redesigned Battle Dragons are a formidable force which is being wielded by the allied forces of the New Republic and the Hapans against the Yuuzhan Vong fleet. The rotational nature of the Battle Dragon's turbolaser batteries are a particularly effective weapon against the Yuuzhan Vong dovin basals, overloading them with a rapid succession of turbolaser blasts. The quick-recharge rate of the turbolasers does have its drawbacks, such as reducing the overall power of the turbolasers themselves, and detracting from shield strength in order to power the recharge cells. The new Battle Dragons have also been outfitted with the upgraded sensor packages used by the New Republic to track Yuuzhan Vong spacecraft, retrofitting them in preparation for front-line combat",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Hapan%20Battle%20Dragon%20MK%20II",
  "retrievedAt": "2025-10-08T08:30:20.480Z"
}