{
  "title": "I-Wing",
  "pageId": 1829,
  "revisionId": 39048,
  "wikitext": "[[File:I-Wing.jpg|thumb|500px]]\n\n'''I-Wing'''<br />'''Craft''': Modified Slayn & Korpil B-wing<br />'''Type''': Heavy assault starfighter<br />'''Scale''': Starfighter<br />'''Length''': 36 meters<br />'''Skill''': Starfighter piloting<br />'''Crew''': 1, gunners 1, skeleton: 1/+10<br />'''Crew Skill''': Varies<br />'''Passengers''': 1 plus R2 Unit<br />'''Cargo capacity''': 60 kilograms<br />'''Consumables''': 10 days<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x1<br />'''Nav Computer''': Yes (limited to 10 jumps), Astromech Droid stores 20 jumps<br />'''Maneuverability''': 2D+1<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 kmh<br />'''Hull''': 5D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 30/+2\n*Scan: 50/+1D+1\n*Search: 75/+2D+1\n*Focus: 5/+4D\n'''Weapons''':\n*10 Heavy Laser Cannons (1)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12-25<br />Atmosphere: 100-300/1.2/2.5 km<br />Damage: 5D\n*10 Heavy Ion Cannons (1)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 4D<br />Space Range: 1-3/7/36<br />Atmosphere: 100-300/700/3.6 km<br />Damage: 4D\n*4 Proton Torpedo Launchers\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere: 50-100/300/700<br />Damage: 9D\n\n'''Notes''': (1) One cannon is installed in each of the two gunpods, one on each of the eight S-Foils.\n\n'''Capsule''': The I-Wing design is of David Quinn, an ex-fighter jock, who retired and took up a business on Nal Hutta. He specialized in fixing and modifying starfighters (all types) and repairing freighters. It is a small family job, crewed by David, and 4 of his 6 sons (2 died in the war between the Empire and the Rebellion).<br />The I-wing takes two B-wing main bodies, and removed their engines and cockpit. Then, placing the engine housings around the cockpit in a circular fashion (leaving room around the cockpit for cooling), it is encased in the gyroscopic stabilizer coolings. The two main wings from the B-Wings are set on this gyroscopic stabilizer, 180 degrees apart forming a perfect \"I\". Maneuvering thrusters are all along the length, which greatly increases the ships maneuvering capability. To this, are added four sets of S-foils from other B-Wings, chopped down by 40 percent. Two pairs are on each main wing, and open out in opposition to one another, improving the ship's atmospheric maneuverability. They only open out to a 45 percent angle from baseline.<br />Due to the increase in hull, there is room for extra shield generators, fuel cells, power converters and two additional Proton Torpedo Launchers. The launchers have an increased missile capacity of ten shots, but are fully self-encased, so they can be jettisoned if needed. The only change is that the targetting laser has been removed, and in it's place is an improved targetting computer. The cockpit has been expanded so that there is space for up to two people and an Astromech Droid (R2 Unit). Although one person can handle both, the piloting and gunnery, the I-Wing, is flown best with two crew members. If the main wings of the ship get damaged, they can be ejected, leaving just the engines and the cockpit as a hyperspace equipped escape pod.<br />Currently, only two models of the I-Wing have been built, and of those only one is a full production model that works. The other is lacking the internals (it is just a frame of painted wood). The production model is in the hands of David's youngest son, Staveren.\n\n'''Source:''' David \"Garhkal\" Stairs",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/I-Wing",
  "retrievedAt": "2025-10-07T22:29:54.684Z"
}