{
  "title": "Imperial Broadcast Ship",
  "pageId": 5593,
  "revisionId": 10754,
  "wikitext": "[[File:ImperialBroadcastShip.jpg|500px|thumb|right]]\n\n'''Imperial '''Broadcast Ship<br />'''Craft''': ‘Merthyog Communication’ II-xC Maintenance/Broadcast Ship<br />'''Affiliation''': Empire<br />'''Era''': Rise of the Empire<br />'''Source''': The Abduction of Crying Dawn Singer (page 27)<br />'''Type''': Maintenance and broadcast ship<br />'''Scale''': Starfighter<br />'''Length''': 30 meters<br />'''Skill''': Space transports: broadcast ship<br />'''Crew''': 4, '''skeleton''': 2/+10<br />'''Crew Skill''': Space transports 3D, sensors 4D<br />'''Passengers''': 10 (normally technicians)<br />'''Cargo Capacity''': 10 metric tons<br />'''Consumables''': 2 weeks<br />'''Cost''': 9,000<br />'''Hyperdrive Multiplier''': x4<br />'''Nav Computer''': Limited to 5 jumps<br />'''Maneuverability''': 2D<br />'''Space''': 4<br />'''Atmosphere''': 280; 800 kmh<br />'''Hull''': 2D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 15/0D\n*Scan: 30/1D\n*Search: 50/3D\n*Focus: 2/4D\n\n\n'''Capsule''': The II-xC maintenance/broadcast ship was manufactured by Merthyog Communications.\n\nThe II-xC's were produced and primarily purchased by and for the Empire. Deployed as independent broadcast centers, an II-xC lacked weapons in favor for powerful broadband receivers and transceivers, and where used to quickly move in and out of a system to either relay messages to a subspace relay stations, or to eavesdrop on enemy communications. The II-xC measured thirty meters in length, and normally had a command crew of four with ten communications technicians. The ship could operate however, on a skeleton crew of two, one for communications and the other for piloting. As the ships were unarmed, Imperial protocol required them to hide within the defenses of subspace relay stations if attacked, so that any imperial frequencies or command codes could not be salvaged.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Imperial%20Broadcast%20Ship",
  "retrievedAt": "2025-10-07T22:32:09.657Z"
}