{
  "title": "Imperial I Star Destroyer",
  "pageId": 426,
  "revisionId": 32067,
  "wikitext": "[[File:imperialsd.gif|500px|thumb|right]]\n\n[[File:imperialsdcore.jpg|thumb|right|500px]]\n\n'''Imperial I Star Destroyer'''<br />'''Craft''': Kuat Drive Yards' Imperial I Star Destroyer<br />'''Type''': Star Destroyer<br />'''Scale''': Capital<br />'''Length''': 1,600 meters<br />'''Skill''': Capital ship piloting: Star Destroyer<br />'''Crew''': 36,810, '''gunners''': 275, '''skeleton''': 5,000/+20<br />'''Crew Skill''': Astrogation 4D, capital ship gunnery 4D+2, capital ship piloting 5D+1, capital ship shields 4D+1, sensors 4D<br />'''Passengers''': 9,700 (troops)<br />'''Cargo Capacity''': 36,000 metric tons<br />'''Consumables''': 6 years<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x8<br />'''Nav Computer '''Yes<br />'''Maneuverability''': 1D<br />'''Space''': 6<br />'''Hull''': 7D<br />'''Shields''': 3D<br />'''Sensors''':\n*Passive: 50/1D\n*5can: 100/3D\n*Search.200/4D\n*Focus. 6/4D+2\n'''Weapons''':\n*60 Turbolaser Batteries\n: Fire Arc: 20 front, 20 left, 20 right<br />Crew: 1 (20), 2 (40)<br />Skill: Capital ship gunnery<br />Fire Control: 4D<br />Space Range: 3-15/36/75<br />Atmosphere Range: 6-30/72/150 km<br />Damage: 5D\n*60 Ion Cannons\n: Fire Arc: 20 front, 15 left, 15 right, 10 back<br />Crew: 1(15), 2(45)<br />Skill: Capital ship gunnery<br />Fire Control: 2D+2<br />Space Range: 1-10/25/50<br />Atmosphere Range: 2-20/50/100 km<br />Damage: 3D\n*10 Tractor Beam Projectors\n: Fire Arc: 6 front, 2 left, 2 right<br />Crew: 1 (2), 4 (2), 10(6)<br />Skill: Capital ship gunnery<br />Fire Control: 4D<br />Space Range: 1-5/15/30<br />Atmosphere Range: 2-10/30/60 km<br />Damage:6D\n\n'''Capsule''': Designed by Lira Wessex, daughter of the man who designed the Victory-class Star Destroyer, the Imperial-class Star Destroyer was an engineering and budget-planning nightmare. But the Navy pushed for it and the Emperor demanded it, so the standard Star Destroyer was built.The Imperial Star Destroyer has enough firepower to reduce a civilized world to slag or take on a fleet of lesser enemy vessels. Each carries a full stormtrooper division, complete with assault craft and ablative heat shields for orbital drops, 20 AT-AT and 30 AT-ST walkers for ground assault, and six TIE fighter squadrons for escort and patrol.There are whole star systems whose gross domestic product is less than the cost of a single Imperial Star Destroyer. There are whole nations which, throughout their entire history, do not use as much energy as an Imperial expends to make a single hyperspace jump.To carry out the Emperor's mandate of rule through fear and the swift destruction of opposition, the Imperial-class Star Destroyer is the weapon of choice. By deploying a Star Destroyer and support ships to a system, the Empire can destroy virtually any foe.It is impossible to garrison every world in every system in the Empire, but the imperial Star Destroyers give the Emperor the ability to project his power anywhere he wishes in a short period of time. These vessels are more than weapons platforms. They also act as space stations, repair docks, and heavy transports for smaller craft. An Imperial-class vessel usually carries combat craft, shuttles, repair and recovery vehicles, landing barges, drop ships, ground assault vehicles, and pre-fabricated garrison bases for immediate deployment.Since its introduction, an improved version of the Star Destroyer has begun to see action. The Imperial II is an upgraded model featuring increased hull shielding and heavier firepower.\n\nSource: Star Wars Core Rulebook 2nd Edition pages 118-119, Star Wars Core Rulebook 2nd Edition Revise page 252",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Imperial%20I%20Star%20Destroyer",
  "retrievedAt": "2025-10-08T08:30:24.861Z"
}