{
  "title": "Imperial Star Galleon",
  "pageId": 690,
  "revisionId": 30225,
  "wikitext": "[[File:stargalleon.gif|500px|thumb|right]]\n\n'''Craft''': Kuat Drive Yards' Star Galleon<br />'''Type''': Cargo/escort frigate<br />'''Scale''': Capital<br />'''Length''': 300 meters<br />'''Skill''': Capital ship piloting: Star Galleon<br />'''Crew''': 130, '''gunners''': 20, '''skeleton '''50/+10<br />'''Crew Skill''': Astrogation 3D, capital ship gunnery 4D, capital ship piloting 5D, capital ship shields 5D, sensors 3D<br />'''Passengers''': 300 (troops)<br />'''Cargo Capacity''': 100,000 metric tons<br />'''Consumables''': 6 months<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''':x2<br />'''Hyperdrive Backup''': x15<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 3<br />'''Hull''':5D+2<br />'''Shields''':2D<br />'''Sensors''':\n*Passive: 15/1D\n*Scan: 45/lD+l\n*Search: 90/2D\n*Focus: 3/2D+1\n'''Weapons''':\n*10 Turbolasers\n: Fire Arc: 5 left, 5 right<br />Crew: 1 (6), 2 (2), 3 (2)<br />Skill: Capital ship gunnery<br />Fire Control: 3D<br />Space Range: 3-15/35/75<br />Atmosphere Range: 6-30/70/150 km<br />Damage: 4D\n*Concussion Missile Launcher\n: Fire Arc: Front<br />Crew: 4<br />Skill: Capital ship gunnery<br />Fire Control: 5D<br />Space range. 2-12/30/60<br />Atmosphere Range: 200-1.2/3/6 km<br />Damage: 5D\n\n'''Capsule''': As more and more cargo freighters suffer capture and destruction at the hands of pirates and rebels, the Empire decided to experiment with a new class of capital ship. This new vessel contains enough storage capacity to make it function as a transport ship, but also has the added benefit of sophisticated weaponry and shielding. In essence, this vessel can serve as both transport and escort — simultaneously. The Star Galleon-class frigate takes the place of two ships, thus saving the Empire credits. Previous Imperial transports were unarmed or lightly armed cargo ships that could not compete against starfighters or powerful capital ships. They needed the protection of escort frigates or some other type of combat craft. However, the new Star Galleons can carry equivalent amounts of goods while protecting themselves from the ravagers of the space lanes. A combination of concussion missiles and turbolasers creates a decent fire perimeter. In addition, the vessels are designed to repel invaders intent on capturing their store of goods. Up to 300 troopers are stationed aboard a Star Galleon. The interior of these ships bristle with anti-intruder defenses. The troopers, for example, can make use of fortress-like emplacements that line the inner hallways and corridors from which to defend their ship. Individual sections can be sealed and held by the defenders, creating pockets within a Star Galleon. One of the more interesting features of a Star Galleon is the cargo hold. Placed in the very center of the craft, the hold is actually a separate vessel that can detach and be jettisoned into hyperspace for collection at a later time. A built-in homing device allows Imperial agents to track the hold as it randomly jumps across the hyperlanes.\n\n'''Source''': Imperial Sourcebook, p. 56-57",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Imperial%20Star%20Galleon",
  "retrievedAt": "2025-10-08T08:30:27.266Z"
}