{
  "title": "Inexpugnable-class tactical command ship",
  "pageId": 7661,
  "revisionId": 51405,
  "wikitext": "[[File:Inexpugnable-class Tactical Command Ship1.jpg|thumb|500px|right]]\n[[File:Inexpugnable-class Tactical Command Ship2.jpg|thumb|500px|right]]\n\n=='''Inexpugnable-class Tactical Command Ship'''==\n\n'''Craft''': Rendili Hyperworks (design)-Rendili/Vanjervalis Drive Yards Inexpugnable-class tactical command ship<br />'''Type''': Command Ship<br />'''Era''': Old Republic<br />'''Affiliation''': Galactic Republic<br />'''Scale''': Capital<br />'''Length''': 3,100 meters diameter<br />'''Skill''': capital ship piloting<br />'''Crew''': 4,187; gunners: 113; skeleton: 1,000/+10<br />'''Crew Skill''': varies<br />'''Passengers''': 2,000 troops<br />'''Cargo Capacity''': 50,000 metric tons<br />'''Consumables''': 2 years<br />'''Hyperdrive''': x2<br />'''Hyperdrive Backup''': x10<br />'''Nav Computer''': yes<br />'''Maneuverability''': 0D<br />'''Space''': 2<br />'''Hull''': 6D+2<br />'''Shields''': 3D<br />'''Sensors'''\n*Passive: 50 / 1D\n*Scan: 100 / 1D+2\n*Search: 200 / 2D\n*Focus: 20 / 3D\n'''Weapons'''\n*'''15 Double Turbo Laser Batteries'''\n: Fire Arc: turret<br />Crew: 5<br />Scale: capital<br />Skill: capital ship gunnery<br />Fire Control: 2D<br />Space Range: 3-15/35/75<br />Atmosphere Range: 6-30/70/150 km<br />Damage: 6D\n*'''40 Light Turbo Laser Batteries'''\n: Fire Arc: turret<br />Crew: 10<br />Scale: capital<br />Skill: capital ship gunnery<br />Fire Control: 2D<br />Space Range: 3-10/30/60<br />Atmosphere Range: 6-20/60/120 km<br />Damage: 3D\n*'''20 Point Defense Laser Cannon Batteries'''\n: Fire Arc: turret<br />Crew: 5<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/10/20<br />Atmosphere Range: 2-6/20/40km<br />Damage: 3D\n*'''6 Tractor Beam Batteries'''\n: Fire Arc: turret<br />Crew: 2<br />Scale: capital<br />Skill: capital ship gunnery<br />Fire Control: 1D<br />Space Range: 3-10/30/60<br />Atmosphere Range: 6-20/60/120km<br />Damage: 6D\n'''Compliment''':\n*144 - [[Aurek-class tactical strikefighter]]s\n*24 - [[S-250 Chela-class starfighter]]s\n*24 - Conductor-class short-haul landing craft\n*6 - Ministry-class orbital shuttles\n*Various support craft\n\n'''Notes''': Informally known as \"Inexies,\" these ships are designed to transmit commands instantaneously and simultaneously to as many as 64 [[Hammerhead-class Cruiser]]s. They are designed as much as space stations as starships, but are intended to be used as part of a fleet, and not as an independent craft.\n\n=='''Capsule'''==\n\n''\"That's it—the cordon is complete! Freighters, liners, Mandalorian dreadnaughts—nobody else is going to Coruscant today without going through Swiftsure and the Republic Navy!\"''<br />'''―Admiral Saul Karath'''\n\nThe Inexpugnable-class tactical command ship was a large warship class used by the Republic Navy during the Mandalorian Wars. Designed and manufactured by Rendili Hyperworks and Rendili/Vanjervalis Drive Yards, the Inexpugnable-class was used as a flagship and command ship. Often described as a mobile space station, at 3,100 meters in diameter it was one of the largest Republic spacecraft of its time. Warships of the class saw combat at a number of battles in the Mandalorian Wars, including the First Battle of Taris and the Battle of Serroco. The Inexpugnable-class was renowned for its ability to lead massive Republic fleets, employing advanced command techniques such as the Vanjervalis Chain to command up to sixty-four Hammerhead-class cruisers simultaneously. Despite its usefulness as a fleet flagship, the ship had several weaknesses, and as such, only six Inexpugnable-class ships were manufactured—two of which, the Courageous and the Reliance, were destroyed in early 3,963 BBY, shortly following the Republic's involvement in the Mandalorian Wars. They were replaced as Republic command ships by the Centurion-class battlecruiser before the end of the Mandalorian Wars.\n\n==='''Characteristics'''===\n\nThe Inexpugnable-class tactical command ship was disc-shaped, with an opening in its center. At 3,100 meters in diameter, it was often described as a mobile space station. The bridge was innovative in design; holograms were projected over a transparent deck on the bridge, providing a merger of electronic and visual data and facilitating command. This bridge design, referred to as the \"wishing well\" by Republic helmsmen, could sometimes produce vertigo. The Inexpugnable-class was operated by a crew of 4,300 Republic officers and enlisted personnel. It also carried a total of 2,000 troops. The class could carry up to 50,000 metric tons of cargo and enough consumables for optimal ship and crew operations for two years.\n\nVessels of the Inexpugnable-class were equipped with five double turbolaser batteries, five light turbolaser batteries, two point-defense laser cannon batteries, and two tractor beam batteries. Three turbolaser batteries were situated on each side of the main circular superstructure, along with two near the bridge of the vessel. The Inexpugnable-class was propelled by four large thrusters that were in turn powered by engines deep within the circular superstructure. For faster-than-light travel, it came equipped with a Class 2 hyperdrive and a Class 10 hyperdrive as backup.\n\nThe warship had large hangars and a command area located underneath the main superstructure, to the stern. Additional hangar decks were located on the vessel's bow to allow rapid deployment of fighters from multiple levels. In addition to the fighter decks, there was a cargo bay located adjacent to the ship's brig. The class could carry 144 Aurek tactical strikefighters and twenty-four S-250 Chela-class starfighters. The ship was also capable of housing small transports—twenty-four Conductor-class landing craft and six Ministry-class orbital shuttles. In addition, its hangar bays could carry a number of Republic support ships.\n\n==='''Role'''===\n\nThe Inexpugnable-class served as a command ship in the Republic Navy. Rendili Hyperworks and Rendili/Vanjervalis Drive Yards designed it in order to sell more Hammerhead-class cruisers to the Republic. Weapons coordination during the Mandalorian Wars became a major concern for Republic tacticians, as Republic lines were often defended by dozens of Hammerhead-class cruisers. The Inexpugnable-class was designed with an enhanced sensor package and an innovative bridge design, which allowed a flag officer to command a fleet of up to sixty-four Hammerhead-class cruisers at once. The Inexpugnable-class's many large hangar bays allowed it to rapidly deploy its fighter squadrons, but also made the ship vulnerable to ramming attacks and boarding operations. The role of command ship was later taken up by the smaller Centurion-class battlecruiser.\n\n==='''History'''===\n\nPrior to the Republic's involvement in the Mandalorian Wars, the Republic determined the need for a tactical command ship to coordinate the large fleets of Hammerhead-class ships defending its lines. The proof-of-concept Swiftsure was built at some point prior to the Mandalorian Wars. Less than half a dozen Inexpugnable-class prototypes were constructed before the outbreak of the Mandalorian Wars, designed by Rendili Hyperworks and launched from the Rendili/Vanjervalis Drive Yards at Corellia. This new line of command ships, at an estimated cost of 70,000,000 credits, effectively replaced the Republic's older command ships, such as the Reliance I. Among those prototypes were the Courageous and the Reliance. The production line also included the Indefatigable and the Tremendous. They were nicknamed \"Inexies\" by Republic crewmen.\n\nAt the end of 3,964 BBY, the Mandalorian Wars finally hit the Republic when Mandalorian fleets attacked Vanquo and Taris. Inexpugnable-class vessels served as large command ships and battle group flagships in the Republic Navy during the Mandalorian Wars. The Courageous, commanded by then-Captain Saul Karath, led its battle group against the Mandalorians during the Battle of Vanquo. In early 3,963 BBY, at Serroco, following an intense Force vision, Zayne Carrick, the Jedi apprentice accused of committing the Padawan Massacre of Taris, stowed aboard Lieutenant Carth Onasi's ship, the Conductor-class landing craft Deadweight, to warn Karath of an upcoming Mandalorian attack.\n\nHowever, Karath immediately recognized Carrick as a fugitive and imprisoned him in the Courageous's brig, ignoring the warning. As predicted, the Mandalorians attacked Serroco in force, using nuclear missiles to destroy cities and Republic troops on the planet's surface. Following the attack, the Courageous was boarded and captured by the Mandalorians. However, Karath, Carrick, and Onasi were able to escape, as Carrick had used the Force to dismantle the wall in his prison cell, allowing them to access the Deadweight in the Courageous's landing bay. The Courageous was taken by the Mandalorians and recycled for their own use; Mandalore the Ultimate later claimed that his battle-axe was forged from the Courageous's hull. The remnants of the Courageous battle group joined the Tremendous and its own battle group, while now-Admiral Karath transferred his flag to the Swiftsure shortly after the Battle of Omonoth. Meanwhile, the Reliance was lost with all hands, including its commander, Admiral Jimas Veltraa, at the First Battle of Taris. Another Inexpungable-class that served was the Diligence, captained by Dallan Morvis.\n\nAfter the Battle of Serroco, the remaining Inexpugnable-class ships, including the Swiftsure, the Tremendous, and the Indefatigable, were equipped with a new sensor package that allowed them to use tactics such as the Vanjervalis Chain, an advanced sensor system that slaved the controls of up to sixty-four Hammerhead-class cruisers, predicted enemy movements, and adjusted the fleet for maximum efficiency. The Swiftsure was the first to be fitted with the system by the manufacturers, and became the basis for the production model. Karath, in command of the Swiftsure, used the Vanjervalis Chain to protect the Republic capital of Coruscant from any attack or infiltration, specifically so that Republic and Jedi forces might intercept Carrick, whom the Jedi Covenant believed was going to attack their operations on Coruscant. However, Haazen, the secret leader of the Jedi Covenant, was able to control all Republic ships linked to the Vanjervalis Chain, since he had directed the Draay Trust to purchase Vanjervalis Systems, and integrated fleet remote controls into Haazen's Sith artifact, the Gauntlet of Kressh the Younger. He commanded Karath's fleet, including the Swiftsure, to attack the Republic strike team threatening his plans. Haazen's Vindication, the Jedi Covenant's insurrection against the Jedi Order, was stopped when Carrick and his former Master, Lucien Draay, retrieved the Gauntlet of Kressh and used it to command the Swiftsure and the Republic fleet to fire upon both Haazen and the Draay Estate on Coruscant's surface.\n\nLater that year, Karath took the Swiftsure and its task force to an asteroid field not far from Ithor. Anticipating a Mandalorian attack, the Swiftsure's fleet prepared for an engagement with Cassus Fett, a prominent Mandalorian Field Marshal, and his forces. Fett's fleet fought a brief battle with the Republic, but the attack was a ruse. Carrick and Fett—who owed a debt to Carrick after having warned the Mandalorians of the Rakghoul plague on Jebble—arranged for the false attack on Republic forces to draw out the Crucible slaver ship Gladiator, which Carrick and his friend, Jarael, had previously encountered. When Karath learned of the ruse and its ultimate goal, he directed the Swiftsure's fleet to capture the Gladiator and its captain, Dace Golliard. Golliard revealed the position of the planet Osadia, an important Crucible base of operations and where Jarael was being held captive, to the Republic, and Karath detached the Hammerhead-class cruiser Testament from his fleet to investigate, taking Carrick and his associate, Marn Hierogryph, along, with the goal of shutting down the Crucible and rescuing Jarael.\n\nOnly six Inexpugnable-class vessels, including prototypes and production models, were ever manufactured, since problems began cropping up with the design. The rest of the production line was abandoned and the role of tactical command ship was filled by the smaller Centurion-class battlecruiser. Millennia later, the massive freighters-turned-battleships of the Trade Federation resembled the class's design, with Hoersch-Kessel Drive's Lucrehulk-class battleship having a similar, circular superstructure and even incorporating Rendili StarDrive–made engines.\n\n'''Source'''\n*KORSE p184-185. Converted from d20 Saga Edition rules.</p>",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Inexpugnable-class%20tactical%20command%20ship",
  "retrievedAt": "2025-10-08T08:30:27.756Z"
}