{
  "title": "Ipc Personnel Shuttle",
  "pageId": 5608,
  "revisionId": 10777,
  "wikitext": "[[File:IpcPersonnelShuttle.png|500px|thumb|right]]\n\n'''Ipc Personnel Shuttle'''<br />'''Craft''': Telgorn II Ipc Gamma-class Light Personnel Carrier<br />'''Affiliation''': Empire<br />'''Era''': Rebellion<br />'''Source''': The Abduction of Crying Dawn Singer (page 22)<br />'''Type''': Personnel shuttle<br />'''Scale''': Capital (due to power output)<br />'''Length''': 30 meters<br />'''Skill''': Space transports: assault shuttle<br />'''Crew''': 2, '''gunners''': 3, '''skeleton''': 1/+10<br />'''Crew Skill''': Capital ship gunnery 3D+2, capital ship shields 4D, space transports 5D<br />'''Passengers''': 40<br />'''Cargo Capacity''': 1 metric ton<br />'''Consumables''': 3 days<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x18<br />'''Nav Computer''': Limited to 3 jumps<br />'''Maneuverability''': 3D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 kmh<br />'''Hull''': 5D+2<br />'''Shields''': 2D+2<br />'''Sensors''':<br />\n*Passive: 40/1D\n*Scan: 80/1D+2\n*Search: 130/3D\n*Focus: 4/3D\n'''Weapons''':\n*4 Laser Cannons<br />Fire Arc: 2 front, 2 rear<br />Crew: 2 guns are handled by “gunner #1”, two guns are handled by “gunner #2”<br />Skill: Capital ship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 2D\n\n'''Capsule''': The Gamma-class Light Personnel Carrier was an Imperial shuttle used to supply planetary forces. It was also known as the Telgorn II lpc Gamma-class personnel shuttle, while Rebel ground forces referred to them as Gift boxes.\n\nThe Gamma-class Light Personnel Carrier was an extensive modification of the Gamma-class assault shuttle designed to quickly supply planetary forces. It had a large landing gear that left the hull of the ship two meters off the ground when fully extended. The troops and cargo were deployed via a ramp in the belly of the ship.\n\nIn comparison with the assault shuttle, the Light Personnel Carrier was only lightly armed with four laser cannons.\n\nDue to the harmless outer appearance but with the capability to deploy a full complement of troops, Rebel ground forces nicknamed these shuttles \"gift boxes\".\n\nOne of these shuttles was carried by the Imperial-class Star Destroyer Impending Doom, flagship of Moff Nile Owen. It was destroyed during the Skirmish at Najarka.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Ipc%20Personnel%20Shuttle",
  "retrievedAt": "2025-10-10T19:12:14.401Z"
}