{
  "title": "IR-3F Patrol Ship",
  "pageId": 5774,
  "revisionId": 32573,
  "wikitext": "[[File:ir3f.jpg|500px|thumb|right]]\n\n'''IR-3F Patrol Ship'''<br />'''Craft''': Sienar Fleet Systems IR-3F<br />'''Affiliation''': General / Empire<br />'''Era''': Rise of the Empire<br />'''Source''': Pirates & Privateers (page 74), The Far Orbit Project (pages 83-84), The Truce at Bakura Sourcebook (page 119)<br />'''Type''': Intra-system patrol/customs craft<br />'''Scale''': Capital<br />'''Length''': 110 meters<br />'''Skill''': Capital ship piloting<br />'''Crew''': 3, '''gunners''': 8, '''skeleton''': 1/+5<br />'''Passengers''': 10 (troops)<br />'''Cargo Capacity''': 180 metric tons<br />'''Consumables''': 3 months<br />'''Cost''': Not available for sale<br />'''Maneuverability''': 2D<br />'''Space''': 7<br />'''Atmosphere''': 350; 1,000 kmh<br />'''Hull''': 3D<br />'''Shields''': 2D+2<br />'''Sensors''':\n*Passive: 40/1D\n*Scan: 80/1D+1\n*Search: 130/2D\n*Focus: 4/2D+2\n'''Weapons''':\n*'''4 Turbolaser Cannons'''\n: Fire Arc: Turret<br />Crew: 2<br />Skill: Capital ship gunnery<br />Fire Control: 2D<br />Space Range: 3-15/35/75<br />Atmosphere Range: 300-1.5/3.5/7.5 km<br />Damage: 4D\n\n'''Description''': The IR-3F-class light frigate, commonly referred to as the IR-3F patrol craft or IR-3F, was a light frigate designed by Sienar Fleet Systems for use as a system patrol and customs ship. \n\nThe IR-3F was 110 meters long. It had a high power output and fast sublight engines for a ship of its size, and could achieve atmospheric flight at 1,000 kilometers per hour; however, it was not equipped with a hyperdrive. It was equipped with shields, and armed with four turbolaser cannon turrets, though some models were equipped with four fire-linked heavy laser cannons instead.\n\nThe ship had a crew of 11 (including 8 gunners), though it could be staffed by a single individual in some circumstances. It carried ten troops, three months' worth of consumables, and had space for 180 metric tons of cargo. The small crew was often inadequately rotated, resulting in a tendency for them to wear down quickly.\n\nPatrol ship tactics generally led to these ships operating within an hour's distance of their base of operations, and maintaining continuous comlink contact with it. When engaging a target, they employed their high speed and brute force to disable or destroy it before it could escape into hyperspace.\n\nThe IR-3F was the predecessor of the IPV-1 System Patrol Craft. However, the craft still saw some use with single-system governments, including Core Worlds within the Ringali Shell. It also saw limited use in the Imperial services, particularly in systems with large support vessel populations or ongoing blockades.\n\nIR-3Fs formed the Imperial Navy's Digit Squadron at Bakura. Five of them fought against the Ssi-ruuk at the Battle of Bakura; three of those ships survived, becoming the property of the Bakuran government when that world became independent. They continued serving under the Bakuran government for decades afterward.",
  "category": "capital",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/IR-3F%20Patrol%20Ship",
  "retrievedAt": "2025-10-08T08:30:22.931Z"
}