{
  "title": "J-Wing",
  "pageId": 10437,
  "revisionId": 20228,
  "wikitext": "[[File:J-Wing Starfighter.jpg|thumb|500px|right]]\n\n'''Name''': J-Wing Starfighter<br />'''Type''': Galactic Alliance Justice Class \"J-Wing\" MultiRole Starfighter<br />'''Scale''': Capital<br />'''Length''': 7.4m Long, 20.4m Wide<br />'''Skill''': Starfighter Piloting - J-Wing<br />'''Crew''': 1<br />'''Crew Skill''': Starfighter Piloting 5D, Starship Gunnery 4D+2, Starship Shields 3D<br />'''Consumables''': 1 Week<br />'''Cost''': 290,000 (new)<br />'''Cargo Capacity''': 75 Kg<br />'''Hyperdrive Multiplier''': X1<br />'''Hyperdrive Backup''': na<br />'''Nav Computer''': Limited to 8 Jumps<br />'''Space''': 8<br />'''Atmosphere''': 400;1,100kmh<br />'''Maneuverability''': 2D<br />'''Hull''': 3D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 30/0D\n*Scan: 50/1D\n*Search: 75/2D\n*Focus: 4/4D+1\n'''Weapons''':\n*'''4 Laser Cannons''' (Fire-Linked)\n: Fire Arc: Front<br />Scale: Capital<br />Fire Control: 1D<br />Space: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5km<br />Damage: 4D\n*'''2 Medium Ion Cannons''' (Fire-Linked)\n: Fire Arc: Front<br />Scale: Capital<br />Fire Control: 2D<br />Space: 1-3/7/36<br />Atmosphere Range: 100-300/700/3.6km<br />Damage: 2D\n*'''AutoBlaster'''\n: Fire Arc: Front<br />Scale: Starfighter<br />Fire Control: 2D<br />Space: 1-8/25/40<br />Atmosphere Range: 100-800/2.5/4km<br />Damage: 3D\n*'''Proton Torpedo Launcher''' (12 Torpedo Magazine)\n: Fire Arc: Front<br />Scale: Starfighter<br />Fire Control: 3D<br />Space: 1/3/7<br />Atmosphere Range: 50-100/300/700m<br />Damage: 9D\n\n'''Description''': As wars continued against the remnants of the Empire and the invading Yuuzhan Vong the failing New Republic and its replacement the Galactic Alliance short of a heavy assault fighter capable of handling capital ships. The Skipray Blastboat was becoming extremely old and were hand-me-downs from captured Imperial squadrons, and the B-Wing Starfighters were truely powerful enough to deal with Capital ships. The engineers of the Alliance who had once worked on the A-Wing starfighter started with the B-Wing design and parts and reworked them into a powerful new vessel. The Justice Class or J-Wing as it was often called uses common parts from the B-Wing starfighter, but its design has much in common with the Skipray even down to the wings swiveling around the main hull into combat mode, and being so overpowered that such a small vessel is considered to be Capital scale with many of its weapons capable of inflicting damage on far larger starships. The power signature is also a disadvantage making weapons and sensors lock onto the starfighter as easily as they would lock onto a 100 meter plus capital ship. However the powerful weapons, hull and shields make the J-Wing a powerful combatant, and the Galactic Alliance have started to produce as many of these vessels as their limited manufacturing capacity allows.<br />\n\n'''Source''': http://www.RPGGamer.org",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/J-Wing",
  "retrievedAt": "2025-10-07T22:29:56.138Z"
}