{
  "title": "K-wing",
  "pageId": 455,
  "revisionId": 11037,
  "wikitext": "[[File:K-wing1.jpg|500px|thumb|right]]\n\n'''Craft''': Sinear Fleet Systems K-Wing Starfighter<br />'''Type''': Space Superiority Bomber<br />'''Scale''': Starfighter<br />'''Length''': 11m<br />'''Skill''': Starfighter Piloting: K-Wing<br />'''Crew''': 2 (pilot/gunner)<br />'''Consumables''': 3 days<br />'''Cost''': 200,000 (new)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': 2 Jumps<br />'''Maneuverability''': 2D<br />'''Space''': 10<br />'''Atmosphere '''435; 1250 kmh<br />'''Hull''': 2D+1<br />'''Shields''': 1D<br />'''Sensors''':  \n*Passive: 20/0D\n*Scan: 35/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''': [[File:K-wing2.jpg|500px|thumb|right]]\n*'''4 Laser Cannons''' (fire linked)\n: fire arc: front<br />skill: starship gunnery<br />crew: 1<br />fire control: 1D+1<br />space range: 1-4/15/30<br />atmosphere range: 100-400/1,500/3,000m<br />damage: 5D\n*'''3 Proton Torpedo '''Launchers\n: fire arc: front<br />skill: starship gunnery<br />crew: 1<br />fire control: 0D+2<br />space range: 1/3/7<br />atmosphere range: 30-100/300/700m<br />ammo: 4 per launcher (12 total)<br />damage: 9D\n\n'''Characteristics''': The K-wing assault starfighter was produced by Koensayr Manufacturing, the same company responsible for producing the venerable Y-wing. Like many other New Republic starfighters, the K-wing was designed to excel in a specific primary role in combat while retaining the flexibility to serve secondary functions if needed.\n\nThe K-wing starfighter's primary missions included precision bombing of planetary targets, slow-moving capital ships, and spaceborne installations. It also performed secondary missions as an escort or reconnaissance ship. \n\nThe hull design of the K-wing consisted of two primary wings attached to a fixed stabilizer. The two main ion engines located at the junction between the wings and stabilizer allowed the K-wing to achieve a sublight speed similar to the Y-wing, despite its larger size.\n\nAn additional engine mounted along the centerline on the aft dorsal section of the stabilizer allowed the fighter to accelerate rapidly in short bursts, much like the SLAM system found on the Imperial Missile Boat. Unfortunately, the K-wing had no hyperdrive capability, and was always deployed from a capital ship.\n[[File:K-wing3.jpg|500px|thumb|right]]\nTo fulfill its role in the New Republic Defense Fleet, the K-wing carried an unusually large arsenal for a vessel of its size. The hull had a total of 18 hard points, five on each upper wing and four on each lower wing, to allow technicians to arm the ship with a large variety of weapons including flechétte and concussion missiles, proton and other sublight torpedoes, thermal and other inertial bombs, small space mines, and T-33 plasma torpedoes.\n\nWhen attacked by enemy fighters, the K-wing could return fire with a short-range quad turbolaser turret with multi-stage lasers located at the fore and a medium-range twin laser cannon turret mounted on the top of its command module. Also, the K-wing could be outfitted with slugthrower cannons on the hardpoints for additional short-range firepower. Like most New Republic fighters, it was also equipped with a deflector shield.\n\nDue to its large weapons loadout, the K-wing required a bombardier. The pilot and gunner sat in cockpits on either side of the command section. In case of emergency, this module was able to detach from the rest of the ship to serve as an escape pod.\n\n'''History''': K-wings were first deployed in combat by the New Republic during the Yevethan crisis. Throughout their service years, they were generally deployed in outsize squadrons, with three flights of six bombers a piece.\n\nSome Viscount-class Star Defenders were known to have K-wings in their hangar complements as an alternative to B-wings.\n\nDuring the Second Galactic Civil War, Commenor deployed K-wings for defense during the Battle of Commenor.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/K-wing",
  "retrievedAt": "2025-10-08T13:06:44.938Z"
}