{
  "title": "Katarn Boarding Shuttle",
  "pageId": 5605,
  "revisionId": 11151,
  "wikitext": "[[File:katarn1.jpg|500px|thumb|right]]\n[[File:katarn2.png|500px|thumb|right]]\n[[File:GrekTroopShuttle.png|500px|thumb|right]]\n\n'''Katarn Boarding Shuttle'''<br />'''Craft''': Rendili StarDrive’s Katarn-class Boarding Shuttle<br />'''Affiliation''': Empire / Rebel Alliance / General<br />'''Era''': Rise of the Empire<br />'''Source''': Rules of Engagement: The Rebel SpecForce Handbook (page 48), Pirates & Privateers (page 88), The Far Orbit Project (page 32)<br />'''Type''': Boarding shuttle<br />'''Scale''': Starfighter<br />'''Length''': 28 meters<br />'''Skill''': Space transports: Katarn shuttle<br />'''Crew Skill''': Varies widely<br />'''Crew''': 2, '''gunners''': 1<br />'''Passengers''': 50<br />'''Cargo Capacity''': 500 kilograms<br />'''Consumables''': 1 day<br />'''Cost''': 10,000 (new), 55,000 (used)<br />'''Maneuverability''': 1D+2<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 kmh<br />'''Hull''': 5D<br />'''Shields''': 2D<br />'''Sensors''':<br />\n*Passive: 10/0D\n*Scan: 20/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''': \n*Double Laser Cannon\n: Fire Arc: Front<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 5D\n*Plasma Torch Boarding Device\n: Fire Arc: Front<br />Crew: 2<br />Skill: Starship gunnery<br />Fire Control: 0D<br />Range: 4 meters<br />Damage: 8D\n\n'''Note''': The plasma torch boarding device is mounted on a ship’s airlock system. The controls are just inside the main airlock. Roll the target ship’s hull -2D; if the torches roll scores a “lightly damaged” result, it has breached the hull. Once the hull is breached, the torch requires a full minute to cut a one-meter-wide-by-two-meter-high hole. The extendable boarding tube attaches to the hull and forms and airtight seal in 30 seconds.\n\n'''Capsule''': The 28 meter-long Katarn-class boarding shuttle was a Rendili StarDrive design made with a nose-end airlock. It could carry up to 50 troops and 500 kg of equipment, with a crew requirement of 3 people. \n\nThe enhanced structure of the shuttle allowed for the ramming of enemy vessels. Plasma torches mounted around the airlock could then open up a hole, which the airlock would seal itself around. In less than two minutes, boarding troops would be able to deploy into the target vessel.\n\nThe Katarn-class' only armament was one double laser cannon mounted at the front.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Katarn%20Boarding%20Shuttle",
  "retrievedAt": "2025-10-10T19:12:22.799Z"
}