{
  "title": "L19 Heavy Freighter",
  "pageId": 5408,
  "revisionId": 10473,
  "wikitext": "[[File:L19 HeavyFreighter.jpg|500px|thumb|right]]\n\n'''L19 Heavy Freighter'''<br />'''Craft''': Surronian StarTech L19 Heavy Freighter<br />'''Affiliation''': General<br />'''Era''': Rebellion<br />'''Source''': Stock Ships (pages 57-59), Pirates & Privateers (pages 65-66)<br />'''Type''': Heavy freighter<br />'''Scale''': Starfighter<br />'''Length''': 50 meters<br />'''Skill''': Space transports: L19 freighter<br />'''Crew''': 1<br />'''Crew Skill''': Varies widely<br />'''Passengers''': 10<br />'''Cargo Capacity''': 150 metric tons<br />'''Consumables''': 8 weeks<br />'''Cost''': 75,000 (new), 28,500 (used)<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x16<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 kmh<br />'''Hull''': 6D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 30/1D\n*Scan: 80/2D\n*Search: 120/3D\n*Focus: 4/4D\n'''Weapons''':\n*Twin Blaster Cannon\n: Fire Arc: Turret<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 5D\n\n'''Capsule''': Surron StarTech's L19 heavy freighter was its second attempt to make its mark on the freighter market with a short-range hauler. Moderately more successful, the L19, a heavy freighter only in comparison to the tugs and short-range barges it is intended to compete against, has managed to create a small niche for itself in the short-and medium-range market.\n\n\nThe L19 was a freighter produced by Surron StarTech. It included A1.50 ion engines.\n\nMoff Aricos Dreleene owned an L19, named the First Edition. He had modified this ship, however, to resemble a more expensive L19a.\n\nAbout 50 meters in length the L19 could move at 950 Km/h within atmosphere, and contained two hyper-drives (one for backup and one for primary use) the quality of which was relatively low unless upgraded by the owner. The L19 freighter was flown by a single pilot and had the capacity to house 10 passengers, as well as 150 metric tons of cargo. The ship also boasted the pantry space to hold about 8 weeks. Surron StarTech's L19 heavy freighter was its second attempt to make its mark on the freighter market with a short-range hauler. Being inexpensive the L19 enjoyed moderately wide use, although never recognized by the galaxy at large anywhere as much as the YT series freighters and the like.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/L19%20Heavy%20Freighter",
  "retrievedAt": "2025-10-10T19:12:26.320Z"
}