{
  "title": "Lambda Shuttle",
  "pageId": 5607,
  "revisionId": 33763,
  "wikitext": "[[File:LambdaShuttle.jpg|500px|thumb|right]]\n\n'''Lambda Shuttle'''<br />'''Craft''': Sienar Fleet Systems Shuttle<br />'''Affiliation''': Empire<br />'''Era''': Rebellion<br />'''Source''': Star Wars Trilogy Sourcebook SE (pages 135-136), The Thrawn Trilogy Sourcebook (pages 237-238), Heir to the Empire Sourcebook (pages 132-134), Starships of the Galaxy (pages 69-70), The Essential Guide to Vehicles and Vessels (pages 100-101)<br />'''Type''': Lambda-class Shuttle<br />'''Scale''': Starfighter<br />'''Length''': 20 meters<br />'''Skill''': Space transports: Lambda Shuttle<br />'''Crew''': 2 (2 can coordinate), '''gunners''': 4, '''Skeleton''': 1/+10<br />'''Crew skill''': Space transports 5D, starship gunnery 5D, starship shields 4D<br />'''Passengers''': 10 (modifiable to hold up to 20)<br />'''Cargo capacity''': 80 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': No available for sale (500,000 credits aprox.)<br />'''Hyperdrive multiplier''': x1<br />'''Hyperdrive backup''': x10<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 5<br />'''Atmosphere''': 295; 850 kmh<br />'''Hull''': 4D<br />'''Shields''': 1D+2<br />'''Sensors''':<br />\n*Passive: 20/0D\n*Scan: 40/1D\n*Search: 80/2D\n*Focus: 4/2D+2\n'''Weapons''':[[File:LambdaShuttle2.jpg|500px|thumb|right]]\n*3 Double Blaster Cannons<br />Fire arc: 2 front, 1 back<br />Crew: 3<br />Skill: Starship gunnery<br />Fire control: 2D<br />Space range: 1-3/12/25<br />Atmosphere range: 100-300/1.2/2.5 km<br />Damage: 4D\n*2 Double Laser Cannons (Fire-linked)<br />Fire arc: Front<br />Crew: 1<br />Skill: Starship gunnery<br />Fire control: 3D+1<br />Space range: 1-4/12/25<br />Atmosphere range: 100-400/1.2/2.5 km<br />Damage: 4D+1\n\n'''Capsule''': Shuttles are small ships which ferry passengers or cargo between capital ships, space docks, and planets. They usually do not have hyperdrive engines, although some Imperial models do. Most have only light armaments and are clearly not intended for combat.\n\nOne particular type of shuttle in common usage, and integral to the Battle of Endor, is the Imperial Lambda class shuttle. This Imperial shuttle can carry a twenty man squad of soldiers and their supplies, or the equivalent in other mass. The shuttle is easily identified by its inverted Y shape, formed by three extended wings during flight. The two lower wings fold upward for landing.\n\nThe sleek cockpit has a bottom hatch which drops down to discharge personnel and cargo. It has a hyperdrive engine, as well as sublight and repulsorlift drives. The Imperial shuttle is also more heavily armed than most, with five weapon emplacements and room for more.\n\nThough these vehicles are still primarily used by the Empire, the New Republic does have a number of captured Imperial shuttles in service, especially in Imperial City. The ships are normally used to ferry important ambassadors, although they have been pressed into hauling small, but important cargoes.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Lambda%20Shuttle",
  "retrievedAt": "2025-10-10T19:12:27.299Z"
}