{
  "title": "Lantillian Short Hauler",
  "pageId": 479,
  "revisionId": 10490,
  "wikitext": "[[File:LantillianShortHauler.jpg|500px|thumb|right]]\n\n'''Craft''': Lantillian Short Hauler<br />'''Type''': Light freighter<br />'''Scale''': Starfighter<br />'''Length''': 27 meters<br />'''Skill''': Space transports: Lantillian short hauler<br />'''Crew''': 2<br />'''Crew Skill''': Varies widely<br />'''Passengers''': 6<br />'''Cargo Capacity''': 85 metric tons<br />'''Consumables''': 1 months<br />'''Cost''': 20,500 (used)<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x12<br />'''Nav Computer''': Yes&nbsp;<br />'''Maneuverability''': 1D<br />'''Space''': 4<br />'''Atmosphere''': 280; 800 kmh<br />'''Hull''': 4D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/2D\n'''Weapons''':\n*'''Laser Cannon'''\n: Fire Arc: Turret<br />Skill: Starship gunnery<br />Fire Control: 1D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5<br />Damage: 3D\n\n'''Capsule''': A short-range freighter out of Lantilies mainly used for local shipments.\n\nThe Lantillian Short Hauler was a rugged and well-engineered vessel. Originally designed as a pleasure craft, it featured several amenities geared towards the comfort of its owner, such as a well-designed galley, a holotheater, and large living quarters. For defense, the basic configuration was armed with a civilian-graded turbolaser cannon and some modest shielding. These defenses however, often proved inadequate against attacks from pirates and other attackers, so most owners quickly upgraded them.\n\nThe Lantillian Short Hauler was easily converted from pleasure craft to cargo hauler, by removing most \"pleasure\" amenities. Its solid construction and reliability made it a good choice for cargo transport, and many smuggler captains retrofitted them to serve as smuggling vessels.\n\nOne of its most infamous flaws was that its landing gear was extremely complex and maintenance-heavy. Obstructions such as dust and corrosion could easily jam its mechanisms and prevent it from retracting or deploying properly. \n\nThe Lantillian Short Hauler original marketing targets were affluent retirees interested in cruising the starlanes in a well-equipped and comfortable vessel without the high price tags of other larger star yachts.\n\nThe Lantillia-based design team of engineers led by Project Engineer Shil Tervo intended to produce a model that would compete with the more popular designs from the Corellian Engineering Corporation that were in high demand during that time. They did not succeed in that respect, but unintentionally managed to create one of the first luxury pleasure craft that was within the average consumer's financial reach. \n\nIn 22 BBY, the corporation had to recall all GX1s with serial prefixes TRE-0034 through TRE-5215 due to faulty electronics. Shil Tervo released an apologetic statement and revealed that thousands of GX1s had left the assembly line with malfunctioning Fabritech 7Y4 sensor suites, although Fabritech officials claimed that it was Lantillian's mishandling that resulted in the hardware problems. To alleviate this issue, Lantillian allowed owners to bring their starships to any Lantillian Spacer's Brotherhood guild office to get their electronics upgraded free of charge.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Lantillian%20Short%20Hauler",
  "retrievedAt": "2025-10-10T19:12:28.297Z"
}