{
  "title": "Light Corvette",
  "pageId": 5652,
  "revisionId": 10874,
  "wikitext": "[[File:LightCorvette.jpg|400px|thumb|right]]\n\n'''Light Corvette'''<br />'''Craft''': Rendili StarDrive’s Light Corvette (Imperial Customs corvette)<br />'''Affiliation''': Empire<br />'''Era''': Rise of the Empire<br />'''Source''': Galaxy Guide 6: Tramp Freighters (pages 76-77), Pirates & Privateers (page 83), The Far Orbit Project (pages 76-77)<br />'''Type''': Imperial customs vessel<br />'''Scale''': Starfighter<br />'''Length''': 180 meters<br />'''Skill''': Space transports: light corvette<br />'''Crew''': 52, '''gunners''': 6, '''skeleton''': 18/+10<br />'''Crew Skill''': Space transports 5D, starship gunnery 5D+2, starship shields 5D+1<br />'''Passengers''': 20<br />'''Cargo Capacity''': 500 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x8<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 2D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 kmh<br />'''Hull''': 5D+1<br />'''Shields''': 3D<br />'''Sensors''':[[File:LightCorvette4.jpg|400px|thumb|right]]\n*Passive: 30/1D\n*Scan: 60/2D\n*Search: 90/4D\n*Focus: 4/4D+1\n'''Weapons''':[[File:LightCorvette3.jpg|400px|thumb|right]]\n*6 Double Turbolaser Cannons\n: Fire Arc: Turret<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 3-15/35/75<br />Atmosphere Range: 300-1.5/3.5/7.5 km<br />Damage: 4D\n\n[[File:LightCorvette2.jpg|400px|thumb|left]]'''Capsule''': Rendili's light corvette is a fast, nimble, durable little craft with good weapons and shielding. It was designed to counter the reckless tendencies of smugglers and does a good job of it. Not surprisingly, shadowport knockoffs are in high demand.\n\nThe Imperial Customs Office employed a force of patrol vessels that operated independently from the Imperial Navy in order to spare the Imperial government the expense of assigning ships of the line to monitor shipping, interdict piracy, and perform search-and-rescue operations.\n\nRendili StarDrive's light corvette was the backbone of this force. Systems with an Imperial Customs branch generally had at least one of these vessels, and more important systems had several. While it was not capable of taking on large warships, these ships were more than adequate for taking on most freighters or starfighters. For boarding operations, the corvette carried a stormtrooper platoon. They were often supported by the smaller Imperial Customs frigate, also a Rendili product.\n\nRendili StarDrive sold the Light Corvette to the Imperial Customs Office by an exclusive contract, but smaller governmental organizations, such as the Rodian Home Fleet, also acquired the light corvette for system patrol and defense. The utility and efficiency of these craft also created a demand from less legal organizations. Pirates often made an effort to capture light corvettes, and smaller shipbuilding operations such as those at shadowports manufactured copies of the design.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Light%20Corvette",
  "retrievedAt": "2025-10-10T19:12:31.390Z"
}