{
  "title": "Loronar Medium Transport",
  "pageId": 5543,
  "revisionId": 10949,
  "wikitext": "[[File:LoronarMediumTransport.jpg|400px|thumb|right]]\n\n[[File:LoronarMedium.jpg|thumb|right]]\n\n'''Loronar Medium Transport'''<br />'''Craft''': Loronar Corporation Medium Transport<br />'''Affiliation''': General<br />'''Era''': Rise of the Empire<br />'''Source''': Gamemaster Handbook<br />'''Type''': Medium transport<br />'''Scale''': Capital<br />'''Length''': 75 meters<br />'''Skill''': Space transports: Loronar Medium Transport<br />'''Crew''': 4, '''skeleton '''2/+10<br />'''Crew Skill''': Astrogation 3D, capital ship piloting 3D+2, capital ship shields 2D+2, space transports 4D<br />'''Passengers''': 10<br />'''Cargo Capacity''': 17,000 metric tons<br />'''Consumables''': 3 months<br />'''Cost''': 320,000 credits (new), 110,000 credits (used)<br />'''Hyperdrive Multiplier''': x3<br />'''Hyperdrive Backup''': x15<br />'''Nav Computer''': Yes<br />'''Space''': 2<br />'''Atmosphere''': 225; 650 kmh<br />'''Hull''': 2D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 35/2D\n*Focus: 2/3D\n\n'''Capsule''': The Loronar medium transport was designed by the Loronar Corporation just prior to the Clone Wars.\n\nWith a total length of 75 meters and a standard crew of four, it could carry ten passengers and 17,000 metric tons of cargo. The vessel was notoriously easy to modify, and many were converted to a variety of uses. The drive system was not so easily modified, and so they were rarely used for trades where sublight speed is desired, such as military conversion or illicit shipping.\n\nAlthough not known for its speed or agility, it performed well in its designed role and was a very durable vessel. This made it popular among budget-minded captains who wished to avoid high maintenance bills.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Loronar%20Medium%20Transport",
  "retrievedAt": "2025-10-10T19:12:35.949Z"
}