{
  "title": "Mantaris Amphibious Transport",
  "pageId": 5409,
  "revisionId": 10482,
  "wikitext": "[[File:MantarisAmphibiousTransport.jpg|500px|thumb|right]]\n\n'''Mantaris Amphibious Transport'''<br />'''Craft''': Theed Palace Space Vessel Eng. Corps/Otoh Gunga Bongowerks Mantaris-class Amphibious Medium Transport<br />'''Affiliation''': Naboo<br />'''Era''': Rise of the Empire<br />'''Source''': Wizards Website<br />'''Type''': Medium transport<br />'''Scale''': Starfighter<br />'''Length''': 68 meters (plus 30 meter long heat sink finials)<br />'''Skill''': Space transports: Mantaris<br />'''Crew''': 4 and 1 Astromech droid<br />'''Crew Skill''': Typically 4D in all applicable skills.<br />'''Passengers''': 20, plus additional depending on attached modules (see below)<br />'''Cargo Capacity''': 250 metric tons, plus additional depending on attached modules (see below)<br />'''Consumables''': 3 months, plus additional depending on attached modules (see below)<br />'''Cost''': 280,000 (new)<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x8<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 kmh<br />'''Hull''': 4D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':\n*2 Concussion Missile Launchers (6 missiles each)\n: Fire Arc: 1 front, 1 back<br />Skill: Starship gunnery<br />Fire Control: 1D<br />Space Range: 1/3/7<br />Atmosphere Range: 50-100/300/700<br />Damage: 9D\n\n'''Notes''': The Mantaris-class transport can be fitted with up to four bubble-shaped, modular sections. These sections can increase cargo or passenger capacity, or be used to transport wildlife. Each modular section can accommodate an additional 30 passengers, or an extra 100 metric tons of cargo.\n\n'''Capsule'''<br />The Mantaris-class amphibious medium transport was a unique design of ship, made by a joint effort between the Naboo and Gungan people, led by Chief Science Advisor Graf Zapalo.\n\n'''Characteristics'''<br />Being a joint venture, the design reflected the artistic qualities of both races and were remarkably adaptable to different environments, which included atmospheric flight, space, and underwater.\n\nThe basic frame was based on a Gungan cargo submersible and was enhanced by Naboo engineers to make it space worthy and included bubble shaped modular sections. This allowed a cargo capacity increase of 100 metric tons, or add 30 people or hold wildlife in the cargo bay, which in turn allowed the Mantaris Medium Transport to carry four pods at a time. It could also carry ER-1 probe droids. The vessel also boasted a Holoviewer. The class was named after a fish species it resembled. \n\n'''History'''<br />The design came to fruition during the attempt to colonize Ohma-D'un, a moon of Naboo. The Mantaris Medium Transport was the Gungans' principle means of transport between worlds.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Mantaris%20Amphibious%20Transport",
  "retrievedAt": "2025-10-10T19:12:46.218Z"
}