{
  "title": "MC-18 Light Freighter",
  "pageId": 5410,
  "revisionId": 10486,
  "wikitext": "[[File:MC-18LightFreighter.jpg|500px|thumb|right]]\n\n'''MC-18 Light Freighter'''<br />'''Craft''': Mon Calamari MC-18 Light Freighter<br />'''Affiliation''': General / Rebel Alliance<br />'''Era''': Rebellion<br />'''Source''': Adventure Journal<br />'''Type''': Light freighter<br />'''Scale''': Starfighter<br />'''Length''': 23.6 meters<br />'''Skill''': Space transports: MC-18<br />'''Crew''': 1 or 2<br />'''Crew Skill''': Varies widely<br />'''Passengers''': 5<br />'''Cargo Capacity''': 75 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': 110,000 credits (new)<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': x10<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D+2<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 kmh<br />'''Hull''': 4D<br />'''Shields''': 2D, '''backup''': 4D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 45/3D\n*Focus: 3/4D\n'''Weapons''':\n*Laser Cannon\n: Fire Arc: Turret<br />Crew: 1 (co-pilot)<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere: 100-300/1.2/2.5 km<br />Damage: 4D\n\n'''Capsule'''<br />The MC18 measured 23.6 meters in length, and could transport up to five passengers and 75 metric tons of cargo.\n\nLike all Mon Calamari designs, the MC18 was custom-built, and no two ships were exactly the same. It also was equipped with a backup shield generator, as was standard Mon Calamari practice. It had a landing claw, standard landing gear, and inflatable puncture-proof pontoons for water landings. The MC-18 was also submersible (maximum depth 1,000 meters). When submerged, its shields must be reconfigured to handle the strong exterior pressure and this weakens the shields vs. other attacks",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/MC-18%20Light%20Freighter",
  "retrievedAt": "2025-10-10T19:12:42.562Z"
}