{
  "title": "Med Runner",
  "pageId": 5610,
  "revisionId": 10779,
  "wikitext": "[[File:MedRunner.jpg|500px|thumb|right]]\n\n'''Med Runner'''<br />'''Craft''': SoroSuub Sprint-class Rescue Craft<br />'''Affiliation''': General / Rebel Alliance<br />'''Era''': Rebellion<br />'''Source''': The Truce at Bakura Sourcebook (pages 113-116)<br />'''Type''': Fast response emergency ship<br />'''Scale''': Starfighter<br />'''Length''': 30 meters<br />'''Skill''': Space transports: Sprint rescue craft<br />'''Crew''': 3, '''skeleton''': 1/+10<br />'''Crew Skill''': Astrogation 4D+2, sensors 6D, space transports 5D, starship shields 4D+2, first aid 6D+1<br />'''Passengers''': 5 (medics), 40 (patients)<br />'''Cargo Capacity''': 2 metric tons<br />'''Consumables''': 1 month<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': x12<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 2D+1<br />'''Space''': 9<br />'''Atmosphere''': 400; 1,150 kmh<br />'''Hull''': 3D+1<br />'''Shields''': 2D<br />'''Sensors''':<br />\n*Passive: 40/1D\n*Scan: 80/1D+2\n*Search: 130/2D\n*Focus: 6/3D\n'''Life-Form Indicators''': Med runners have sophisticated lifeform sensors to find survivors in starship wreckage. Sensor operators receive a +1D+2 bonus when in focus mode and searching for life-forms only.\n\n'''Capsule''': Thirty meters long, the Sprint-class carried three crew members and five medics, with space for up to forty patients. The ships could also hold one month's worth of consumables, and two metric tons of cargo.\n\nIt had a Class 1 hyperdrive and a Class 12 backup. The ship could achieve 1,150 kilometers per hour in atmosphere. The ship was shielded, but lacked offensive weaponry. With military-grade sensors, the med runner was able to respond to distress signals in deep space. \n\nMed runners were used by the Galactic Republic during the Clone Wars. Several med runners transported the dead and wounded to Coruscant following the Battle of Boz Pity. The med runner Bright Flight was hijacked by Asajj Ventress, who used it to escape into the Unknown Regions after her betrayal at the hands of Count Dooku.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Med%20Runner",
  "retrievedAt": "2025-10-10T19:12:49.187Z"
}