{
  "title": "Mining Ship",
  "pageId": 5546,
  "revisionId": 10644,
  "wikitext": "'''Mining Ship'''<br />'''Craft''': Arakyd Stellar Mag V Mining Vessel<br />'''Affiliation''': General<br />'''Era''': Rise of the Empire<br />'''Source''': Supernova (page 75)<br />'''Type''': Mine repair and supply vessel<br />'''Scale''': Capital<br />'''Length''': 542 meters<br />'''Skill''': Space transports: Mag V<br />'''Crew''': 3, '''droids''': 19, '''gunners''': 1<br />'''Crew Skill''': Varies<br />'''Passengers''': 10<br />'''Cargo Capacity''': 500,000 metric tons<br />'''Consumables''': 1 month<br />'''Cost''': 5 million credits<br />'''Maneuverability''': 1D<br />'''Space''': 5<br />'''Atmosphere''': 295; 850 kmh<br />'''Hull''': 4D+1<br />'''Sensors''':\n*Passive: 20/0D\n*Scan: 50/1D\n*Search: 70/2D\n*Focus: 2/3D\n'''Weapons''':\n*Turbolaser Battery\n: Fire Arc: Turret<br />Crew: 1<br />Skill: Capital ship gunnery<br />Fire Control: 2D+2<br />Space Range: 3-15/36/75<br />Atmosphere Range: 6-30/72/150 km<br />Damage: 3D\n\n'''Capsule''': The Stellar Mag V Mining Vessel was the ship deployed by the Empire to the planetoid of Jatee for an Imperial rutgar-4 (a high density crystalline explosive) mining operation based there. It was employed to repair the mine's processing shaft and carry the finished product from the top of the shaft, depressurize it, and transport it to a cargo ship in low orbit. A rebel, Dr. Soron Hegerty and her co-conspirators of Ssither managed to steal the Stellar Mag V Mining Vessel that the Empire deployed to Jatee.\n\nInternally, the vessel features a very large cylindrical chamber, which maintains a self-propelled walkway. Its recessed areas feature massive cranes. A number of ladders and lifts can be found set into the wall of the cylinder at various heights. In the cylinder, gravity can be altered so that the outside of the cylinder is always \"down\", thus allowing an individual to walk on any surface. A number of chambers can be accessed from this point. Those same consoles that unlock those chambers can also be used to affect the gravity in the very large cylinder.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Mining%20Ship",
  "retrievedAt": "2025-10-10T19:12:51.665Z"
}