{
  "title": "Mining Survey Ship",
  "pageId": 5570,
  "revisionId": 10685,
  "wikitext": "[[File:MiningSurveyShip.jpg|400px|thumb|right]]\n\n'''Mining Survey Ship'''<br />'''Craft''': SoroSuub MKI Mining Survey Vessel<br />'''Affiliation''': General<br />'''Era''': Old Republic<br />'''Source''': Tapani Sector Instant Adventures<br />'''Type''': Exploration vessel<br />'''Scale''': Starfighter<br />'''Length''': 45 meters<br />'''Skill''': Space transports: MKI<br />'''Crew''': 6, '''gunners''': 1, '''skeleton '''2/+10<br />'''Crew Skill''': Astrogation 3D+2, space transports 5D, starship gunnery 4D+1, starship shields 4D, sensors 4D+2<br />'''Passengers''': 8<br />'''Cargo Capacity''': 200 metric tons<br />'''Consumables''': 6 months<br />'''Cost''': 300,000 credits (new), 120,000 credits (used)<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x15<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 5<br />'''Atmosphere''': 295; 850 kmh<br />'''Hull''': 4D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 30/1D\n*Scan: 60/2D\n*Search: 90/4D\n*Focus: 4/4D+1\n'''Weapons''':\n*Heavy Laser Cannon\n: Fire Arc: Turret<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-5/15/30<br />Atmosphere: 100-500/1.5/3 km<br />Damage: 6D\n\n'''Capsule''': One of the most popular side enterprises used by scouts to improve their income, is mining. With little effort, the chances for additional reward are quite good. The MKI mining vessel, manufactured by the SoroSuub Company due to their interests in mining, fits perfect in this role. As a mining survey vessel, the ship explores the more remote regions of space, and searches thes systems for mineral and ore deposits. Therefore, the ship features an excellent sensor suite. It is also equipped with a powerful Laser Cannon, which is used to receive small samples out of large asteroids. If valuable ores or minerals are found, large mining vessels is sent to begin the operation.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Mining%20Survey%20Ship",
  "retrievedAt": "2025-10-10T19:12:52.155Z"
}