{
  "title": "MRX-BR Pacifier",
  "pageId": 579,
  "revisionId": 10827,
  "wikitext": "[[File:MRX-BRPacifier.jpg|500px|thumb|right]]\n\n'''Craft''': Sydon Vehicle Works MRX-BR Pacifier combat/contact vessel<br />'''Type''': Exploration Fighter<br />'''Scale''': Starfighter<br />'''Length''': 25 meters<br />'''Skill''': Space transport piloting<br />'''Crew''': 1<br />'''Passengers''': 3<br />'''Cargo Capacity''': 25 metric tons; 10 cuic meters<br />'''Consumables''': 1 Years<br />'''Hyperdrive Multiplier:''' x1<br />'''Hyperdrive Backup''': x8<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 7<br />'''Atmosphere''': 600; 1200 km/h<br />'''Hull''': 2D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 30/1D\n*Scan: 60/2D\n*Search: 120/3D\n*Focus: 10/3D+2\n'''Weapons''':\n*'''2 Proton Torpeado Launchers'''\n: Scale: Starfighter<br />Fire Arc: Front<br />Crew: 1 Gunner<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 50-100/300/700m<br />Damage: 9D\n*'''3 Laser Cannons'''\n: Scale: Starfighter<br />Fire Arc: 1 Rear, 1 Left, 1 Right<br />Crew: 1 Gunner each<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5km<br />Damage: 3D\n\n'''Capsule''': The Pacifier was the Galactic Empire's scout vessel of choice. It was designed to act as either a high-tech contact vessel or as a powerful assault vessel, successful in both roles. The Empire employed this craft to seek out new worlds and if necessary deliver a devastating strike to them. Though it normally held three gunners, powerful computer-controlled weapons enabled the craft to inflict maximum destruction with minimal effort with a single pilot.\n\nThe Pacifier was equipped with some of the most powerful sensor arrays built in its era. Its sensors were capable of counting the number of leaves on a particular tree from orbit. The New Republic considered this craft too provocative for encounters with frightened primitives and discontinued use of it.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/MRX-BR%20Pacifier",
  "retrievedAt": "2025-10-10T19:12:43.749Z"
}