{
  "title": "MSS-41F “Prowler” Minesweeper",
  "pageId": 608,
  "revisionId": 10941,
  "wikitext": "'''Craft''': IMS' MSS-41F \"Prowler\" Deep Space Minesweeper<br />'''Type''': Deep space minesweeper<br />'''Length''': 62 meters<br />'''Scale''': Starfighter<br />'''Skill''': SF piloting: \"Prowler\" Minesweeper<br />'''Crew''': 12, gunners: 8<br />'''Crew Skill''': Astrogation 4D, sensors 5D, space transports 5D, SS gunnery 4D+1, SS shields 4D <br />'''Passengers''': None<br />'''Cargo Capacity''': 10 metric tons<br />'''Consumables''': 8 months<br />'''Cost''': NAFS<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': x10<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D+2<br />'''Space''': 5<br />'''Atmosphere''': 300; 750 kmh<br />'''Hull''': 3D<br />'''Shields''': 1D+2<br />'''Sensors''':<br />&nbsp;&nbsp;&nbsp; ''Passive'': 35/2D+1<br />&nbsp;&nbsp;&nbsp; ''Scan'': 70/3D<br />&nbsp;&nbsp;&nbsp; ''Search'': 200/4D<br />&nbsp;&nbsp;&nbsp; ''Focus'': 8/5D<br />&nbsp;&nbsp;&nbsp; ''Sensor ''Stealth: Adds +1D to enemy sensor difficulty.<br />'''Weapons''':<br />4 Laser Cannons<br />Fire Arc: Turret<br />Crew: 2<br />Skill: SS gunnery<br />Fire Control: 4D<br />Space Range: 1-6/12/25<br />Atmosphere Range: 2-12/24/50km<br />Damage: 4D\n\n== Capsule: ==\nThe MSS-41F \"Prowler\" Deep Space Minesweeper is the most advanced minesweeper that has been designed to date. Combining a revolutionary sensor package and fast-tracking laser turrets, the Prowler was designed with enemy mine interdiction in mind. Though it has less-than-stellar shielding and maneuverability, the Prowler can hold its own against transports and even some starfighters.The Prowler is a response to complaints from the Imperial military about many of their ships being destroyed by enemy laser, ion, and warhead mines. IMS designed the Prowler with sensor stealth so it could effectively sneak up on mines until it was too late. The main idea behind minesweepers to to eliminate mines before they can go off - and the Prowler is the perfect example.Tactical Deployment: Prowlers are usually deployed alone, but they can occasionally be sent out in pairs. Groups larger than that are rarely heard of. They can also be sent out with TIE craft for added protection. However, because of their scarcity, Imperial commanders are having to resort to using older models and TIE craft to perform minesweeping tasks.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/MSS-41F%20%E2%80%9CProwler%E2%80%9D%20Minesweeper",
  "retrievedAt": "2025-10-10T19:12:44.741Z"
}