{
  "title": "Naboo J-type Cruiser",
  "pageId": 5303,
  "revisionId": 10409,
  "wikitext": "[[File:jtype.jpg|300px|thumb|right]]\n\n'''Naboo J-type Cruiser'''<br />'''Craft''': Theed Palace Space Vessel Engineering Corps Jtype Royal Cruiser<br />'''Type''': Diplomatic transport<br />'''Scale''': Starfighter<br />'''Length''': 39 meters, 91-meter wingspan<br />'''Skill''': Space transports: J-type royal starship<br />'''Crew''': 3<br />'''Crew Skill''': Varies, usually 4D in all applicable skills<br />'''Passengers''': 8<br />'''Cargo Capacity''': 6 metric tons<br />'''Consumables''': 6 months<br />'''Cost''': Not for sale<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': x1<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 2D<br />'''Space''': 5<br />'''Atmosphere''': 295; 850 kmh<br />'''Hull''': 6D<br />'''Shields''': 4D<br />'''Sensors''':\n*Passive: 30/1D\n*Scan: 65/2D\n*Search: 80/3D\n*Focus: 5/4D\n\n'''Starfighter Complement''': 4 N-1 Starfighters\n\n'''Note''': The Naboo Royal Cruiser was a starship used by the royalty of Naboo for diplomatic transport. Designed by the Theed Palace Space Vessel Engineering Corps, the craft succeeded the Naboo Royal Starship as primary transport for Naboo’s queen and royal entourage. To remedy prior design flaws, the new vessel was fitted with improved deflector shield generators and multiple backup S-6 hyperdrive generators, ensuring hyperspace ability and crew safety while retaining the high speed and sleek aerodynamics that exemplified its predecessor.\n\nIn accordance with Naboo custom for diplomatic ships, the Royal Cruiser was unarmed, instead relying on its high speed, powerful shields, and fighter escort to escape enemy fire. Because of the limited range of most escort fighters, the cruiser was equipped with four under-wing recharge sockets for use by N-1 starfighters during long voyages.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Naboo%20J-type%20Cruiser",
  "retrievedAt": "2025-10-10T19:13:00.466Z"
}