{
  "title": "Naboo H-type Yacht",
  "pageId": 5302,
  "revisionId": 10407,
  "wikitext": "[[File:NabooHtype.jpg|300px|thumb|right]]\n\n'''Naboo H-type Yacht'''<br />'''Craft''': Theed Palace Space Vessel Engineering Corps Htype Yacht<br />'''Type''': Space yacht<br />'''Scale''': Starfighter<br />'''Length''': 47.9 meters<br />'''Skill''': Space transports: H-type yacht<br />'''Crew''': 1 (1 can coordinate)<br />'''Passengers''': 6<br />'''Cargo Capacity''': 2 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': Not for sale<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': x5<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 3D<br />'''Space''': 9<br />'''Atmosphere''': 400; 1,150 kmh<br />'''Hull''': 3D+2<br />'''Shields''': 3D<br />'''Sensors''':\n*Passive: 30/1D\n*Scan: 65/2D\n*Search: 80/3D+1\n*Focus: 4/4D\n\n'''Notes''': The ship’s narrow profile and sheltered sublight engines grants it considerable sensor stealth abilities, adding +1D to sensors difficulties to detect it.\n\n'''Capsule''': The Naboo Yacht was the personal craft and royal starship of Padmé Amidala. It was a customized H-type Nubian yacht and was employed as a getaway vessel, being the smallest non-fighter craft in the Theed Hangars, though much faster than most civilian ships. It featured a powerful shield system, an array of electronic countermeasures, a slim, narrow profile and sheltered engines giving a small sensor signature for evading pursuits and an escape pod. The vessel was unarmed in accordance with the peaceful culture of Naboo. The yacht only required a small crew and Padmé could pilot the ship on her own from the cockpit in the central area of the yacht’s upper section. Below the cockpit were maintenance consoles, the class 0.9 Nubian 150 hyperdrive core and stores to contain supplies and astromech droids. The lower and upper levels were connected by a turbolift platform, situated before the lounge and crew bunks on the upper level. At the front section of the upper level was Padmé’s bedroom which could serve as a portable throne room.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Naboo%20H-type%20Yacht",
  "retrievedAt": "2025-10-10T19:12:59.400Z"
}