{
  "title": "NF-1 Lyon",
  "pageId": 618,
  "revisionId": 11878,
  "wikitext": "[[File:NF-1-Lyon.jpg|thumb|500px]]\n\n'''Craft''':&nbsp; Relkor-Grib NF-1 \"Lyon\"<br />'''Type''':&nbsp; Space Superiority Fighter<br />'''Scale''':&nbsp; Starfighter<br />'''Length''':&nbsp; 15 meters<br />'''Skill''':&nbsp; Starship Piloting; Lyon<br />'''Cost''':&nbsp; 310,000 credits&nbsp;<br />'''Crew''':&nbsp; 1<br />'''Passengers''':&nbsp; None&nbsp;<br />'''Cargo Capacity''':&nbsp; 245 kg, 1.1 cubic meter<br />'''Consumables''':&nbsp; 1 month<br />'''Hyperdrive Multiplier''':&nbsp; X1.5<br />'''Hyper Backup''':&nbsp; None<br />'''Nav Computer''':&nbsp; Yes<br />'''Maneuverability''':&nbsp; 3D+2<br />'''Space''':&nbsp; 10<br />'''Atmosphere''':&nbsp; 415; 1,200<br />'''Hull''':&nbsp; 3D+1<br />'''Shields''':&nbsp; None<br />'''Sensors''':\n*Passive: 30/1D&nbsp;\n*Scan:&nbsp; 60/2D\n*Search:&nbsp; 100/3D\n*Focus:&nbsp; 6/5D\n'''Weapons''':&nbsp;\n*'''1 Free Pivoting Laser Cannon'''\n: Scale:&nbsp; Starfighter<br />Fire Arc:&nbsp; All<br />Crew:&nbsp; Pilot<br />Skill:&nbsp; Starship Gunnery<br />Fire Control:&nbsp; 2D+2 (see below)<br />Space Range:&nbsp; 1-5/15/30<br />Atmosphere Range:&nbsp;100-500/1.5Km/3.0Km<br />Damage:&nbsp; 6D+1\n*'''2 Heavy MiniNuke Torpedo Launchers'''\n: Scale:&nbsp; Starfighter<br />Fire Arc:&nbsp; Front<br />Crew:&nbsp; Pilot<br />Skill:&nbsp; Starship Gunnery<br />Fire Control:&nbsp; 1D+1<br />Space Range:&nbsp; 1/3/6<br />Atmosphere Range: 100/300/600<br />Damage:&nbsp; 10D+1\n\n'''Capsule''': The first ship produced by the Relkor-Grib corporation after Kaldron has been freed from the Imperial Yoke, the Lyon is named after Lyon Destrier, one of Kaldron's most well known sons, a Jedi Knight who recently helped free the planet before the New Republic's fleet could liberate them, enabling Kaldron to negotiate their inclusion to the New Republic on very favorable terms. The ship is a very fast, lightly armored craft that packs quite a punch.&nbsp; The MiniNuke Torpedoes are among the most effective starfighter missiles in the galaxy, though they do violate a number of strategic weapons treaties in various sectors.&nbsp; The free pivoting laser is based on the Mini-turret of Lyon's own ship, the Arcburner, and while somewhat less effective than that weapon, it still allows a 360ø field of fire for a one man craft.&nbsp; However, as the camera link is still in development, the Fire Control drops to 2D for the Right and Left arcs, and 1D+1 for the rear. The Lyon has met with some success among top pilots in the New Republic and Independent operators, but most prefer ships with more armor and shielding.&nbsp; Still the Lyon project has been a net gain for the Relkor-Grib corporation, and many of the innovations of this ship are expected to be included in their newer vessels.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/NF-1%20Lyon",
  "retrievedAt": "2025-10-07T22:30:02.018Z"
}