{
  "title": "Penumbra Attack Shuttle",
  "pageId": 13279,
  "revisionId": 27093,
  "wikitext": "[[File:Penumbra Attack Shuttle.jpg|thumb|500px|right]]\n\n'''Penumbra Attack Shuttle'''<br />'''Craft''': Haor Chall Engineering Penumbra-class Attack Shuttle<br />'''Affiliation''': Separatists / General<br />'''Era''': Rise of the Empire<br />'''Type''': Fast Attack Shuttle<br />'''Scale''': starfighter<br />'''Length''': 29 meters<br />'''Skill''': space transports: Penumbra Shuttle<br />'''Crew''': 3; skeleton: 2/+5<br />'''Passengers''': 10<br />'''Cargo Capacity''': 20 metric tons<br />'''Consumables''': 1 month<br />'''Cost''': 250,000 (new); 135,000 (used)<br />'''Maneuverability''': 2D+2<br />'''Space''': 9<br />'''Atmosphere''': 400; 1,175kmh<br />'''Hull''': 3D+2<br />'''Shields''': 1D+1<br />'''Sensors'''\n*Passive: 20/0D\n*Scan: 30/1D\n*Search: 50/2D\n*Focus: 3/2D+2\n'''Weapons'''\n*'''4 Medium Laser Cannons''' (fire-linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1,200/2,500m<br />Damage: 5D\n*'''Concussion Missile Launcher'''\n: Fire Arc: turret<br />Crew: co-pilot<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 100/300/700m<br />Ammo: 12 missiles<br />Damage: 10D\n\n'''Source''': Galaxy at War (page 65)\n\n'''Description''': The Flarestar-class attack shuttle, also known as the Flarestar-class Weequay ship, the Penumbra-class attack shuttle, or the Weequay saucer craft, was a small saucer-shaped shuttle used by the Weequay pirates of Florrum.\n\nThe Flarestar-class attack shuttle could be launched from a Surronian cruiser and land on surfaces too small for the mothership. It was at least 1/11 the size of the carrier vessel. The saucer craft had a dual cockpit design, with transparisteel canopies on the dorsal surface of the saucer.\n\nOn the ventral side, the vessel had two thrusters, two laser cannons, missile launchers and three boarding ramps. Two on the front side leading towards the two cockpits and another one located on the back for passengers/cargo. Hondo Ohnaka stole several of these ships from a collector on Farana. The mark of Hondo Ohnaka's pirate crew was painted on both sides of the ship.\n\nA ship of this kind, called the Rapier One transported Count Dooku and Ohnaka to the surface of Florrum. Later, an accomplice of Turk Falso used the saucer to attack and take down a Republic Nu-class attack shuttle bringing a ransom of spice proving that the craft was very capable as a starfighter against enemy craft. Count Dooku used the vessel as an escape craft after breaking out of the Weequay prison.\n\nShahan Alama, a Weequay bounty hunter, crash landed on Florrum in a Flarestar-class ship when he was shot by a Confederate frigate. He was then found by Ohnaka and two other pirates.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Penumbra%20Attack%20Shuttle",
  "retrievedAt": "2025-10-10T19:13:09.985Z"
}