{
  "title": "Pi Fighter",
  "pageId": 5239,
  "revisionId": 11888,
  "wikitext": "[[File:Pi-Fighter.jpg|thumb|500px]]\n\n'''Pi Fighter'''<br />'''Craft''': Nova Corporation's Pi fighter<br />'''Type''': Medium bomber<br />'''Scale''': Starfighter<br />'''Length''': 14.5 meters<br />'''Skill''': Starfighter piloting - Pi fighter (can use TIE specialty at -1D)<br />'''Crew''': 1<br />'''Crew Skill''': Starfighter piloting 4D+2, starship gunnery 5D+1, starship shields 3D+2<br />'''Cargo Capacity''': 250 kilograms<br />'''Consumables''': 2.5 weeks<br />'''Cost''': 175,000 (new)<br />'''Hyperdrive Multiplier''': x2<br />'''Nav Computer''': Uses R2 unit<br />'''Maneuverability''': 3D+1<br />'''Space''': 7<br />'''Atmosphere''': 415; 1,200 kmh<br />'''Hull''': 4D<br />'''Shields''': 1D+2<br />'''Sensors''':\n*Passive: 25/1D\n*Scan: 60/2D+1\n*Search: 120/3D+2\n*Focus: 5/5D\n'''Weapons''':\n*2 Heavy Ion Cannons\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 0D<br />Space Range: 1-4/15/27<br />Atmosphere Range: 100-400/1.5/2.7 km<br />Damage: 8D\n*2 Missile/Torpedo/Heavy Space Bomb Launchers\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Ammo: 18/12/6 (each)<br />Fire Control: 4D/2D+1/+2<br />Space Range: variable by warhead<br />Atmosphere Range: variable by warhead<br />Damage: 7D/9D/12D\n\n'''Capsule''': Several years after destruction of the second Death Star, Nova Corporation fielded its first fighter for the use of governments other then that of the Raccadi Sector. The Pi fighter was designed with the more wealthy corporations in mind, it is designed for anti-capital vessel combat. The Pi bomber combined the design for the rotating cockpit of the B-wing with a modified TIE cockpit and totally new body. When landed the cockpit sits out to the right of the craft, a connector peace curves forward to the first engine, and bomb-bay. The connector continues to the second set. It finishes off in a blunted end that protects the shield generator back across the vessel.<br />Its controls are similar to the newer TIE fighters so anyone who uses these craft should adept to the Pi fighter easily. For a Bomber it has exceptional maneuverability and decent speed. Against large targets it outperforms the B-wing, but it is an even worse dogfighter than the TIE bomber.<br />The Pi fighter is being produced in modest quantities and sold to some independent governments. The Corporate Sector has put in a request for twelve squadrons, the Bothans for two. The biggest buyers so far are the Hutts, which already purchased twenty-four squadrons and have ordered another thirty-six. For large quantities (greater then six squadrons), the price per unit is 150,000 credits.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Pi%20Fighter",
  "retrievedAt": "2025-10-08T13:07:02.110Z"
}