{
  "title": "PSI-Fighter",
  "pageId": 5240,
  "revisionId": 11887,
  "wikitext": "[[File:PSI-Fighter.jpg|thumb|500px]]\n\n'''Psi Fighter'''<br />'''Craft''': Nova Corporation's Psi fighter<br />'''Type''': Space superiority fighter<br />'''Scale''': Starfighter<br />'''Length''': 14.4 meters<br />'''Skill''': Starfighter piloting - Psi fighter (can use Z-95 specialty at -1D)<br />'''Crew''': 1<br />'''Crew Skill''': Starfighter piloting 4D+2, starship gunnery 5D+1, starship shields 3D+2<br />'''Cargo Capacity''': 116 kilograms<br />'''Consumables''': 2 weeks<br />'''Cost''': 155,000 (new)<br />'''Hyperdrive Multiplier''': x1.5<br />'''Nav Computer''': Uses R2 unit<br />'''Maneuverability''': 3D<br />'''Space''': 8<br />'''Atmosphere''': 415; 1,200 kmh<br />'''Hull''': 3D+2<br />'''Shields''': 1D+1<br />'''Sensors''':\n*Passive: 20/0D\n*Scan: 40/1D+1\n*Search: 80/2D+2\n*Focus: 4/4D\n'''Weapons''':\n*2 Laser Cannons\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 3D+2<br />Space Range: 1-4/15/27<br />Atmosphere Range: 100-400/1.5/2.7 km<br />Damage: 5D (6D dual fire)\n*1 Ion Cannon (computer controlled)\n: Fire Arc: Back<br />Skill: Starship gunnery<br />Fire Control: 8D<br />Space Range: 1-4/15/27<br />Atmosphere Range: 100-400/1.5/2.7 km<br />Damage: 3D\n*1 Concussion Missile Launcher\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 4D<br />Space Range: 2/5/10<br />Atmosphere: 30-100/300/700 m<br />Damage: 7D\n\n'''Capsule''': The Psi fighter is a relatively old fighter craft. The design has been around since the destruction of Alderan, but only entered production recently. The decision for the Nova Corporation to sell combat craft to organizations other than the government of the Raccadi Sector has let them release the designs for craft that did not match the specifications of their employer.The Psi fighter was designed by an older engineer who had a love of the early model Z-95 Headhunters. The cockpit design is straight from the Headhunter, with the bubble canopy, and two laser cannons replacing the Concussion missile launch tubes. The single launch tube that is remaining is directly in the nose of the craft replacing the old sensor unit. The fuselage was expanded and hyperdrive engines and a astromech droid socket was added. In the very end is an ion cannon that had a modified droid brain installed to act as the gunner. The cannon is too under-powered to disable most freighters or even some fighters, but it does enough that most pilots will not follow to closely.Out of the sides of the fuselage are two wings. They sweep out for a space the angle 90% to the front, the endings are tapered to points and contain the ship's sensor system. Parallel and to the outside of the wings are the ion engines that propel the craft in space. These small, unobtrusive units propel the craft as fast as a T-65B X-Wing.The Psi fighter is also being marketed on the open market and has several steady buyers. There are many systems in the Outer-Rim that have been using older craft like the Z-95 that are looking for upgrades. The Psi fighter allows them to buy the newer craft but still use most of the equipment and training programs they have. If sold in bulk (more then 6 squads) the Psi fighter has a price tag of 135,000 credits.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/PSI-Fighter",
  "retrievedAt": "2025-10-07T22:30:05.495Z"
}