{
  "title": "Rendili StarDrive´s Container Train",
  "pageId": 5561,
  "revisionId": 10648,
  "wikitext": "[[File:Containertrain.gif|400px|thumb|right]]\n\n'''Container '''Train<br />'''Craft''': Rendili StarDrive’s Container Train<br />'''Affiliation''': General<br />'''Era''': Rise of the Empire<br />'''Source''': Black Ice (pages 16-20)<br />'''Type''': Container train<br />'''Scale''': Capital<br />'''Length''': 7,800 meters (9 cargo pods: 600 meters each; 2 engine pods: 1,200 meters each)<br />'''Skill''': Capital ship piloting: container train<br />'''Crew''': 200, '''skeleton '''100/+10<br />'''Crew Skill''': Astrogation 3D, capital ship piloting 4D<br />'''Passengers''': None<br />'''Cargo Capacity''': 1,210,000,000 metric tons (110,000,000 metric tons in each of the 9 cargo balls; 110,000,000 metric tons in each of the 2 engine pods)<br />'''Consumables''': 6 months<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x6<br />'''Hyperdrive Backup''': x24<br />'''Nav Computer''': Yes<br />'''Space''': 1 (increases always +1, when two cargo balls are removed)<br />'''Hull''': 4D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 20/1D+1\n*Search: 40/1D+2\n*Focus: 2/2D\n\n'''Capsule''': The container train is designed and built by Rendili StarDrive, builders of the Victory-class Star Destroyers. At full size, with all force containers active, the container train is 7,800 meters long, with a weight of 1,210,000,000 metric tons.\n\n'''Cargo Holds''': Most of the ship is cargo space. The nine black balls, 600 meters in diameter, are force fields, each contained beween field projectors. The balls are filled with refined fuel for power cells. A large conduit runs down the center of each hold, carrying power from the engine units to the force fields and connecting the engine units with each other. Balls can be added or removed to change the size of the train.\n\nEngine Pods: The two engine pods are huge, dwarfing even the engines on Star Destroyers and rivaling those on the Death Star. The fore and aft engine pods are identical (as the ship moves in eihter direction with ease, the terms \"fore\" and \"aft\" change from trip to trip, depending upon which way the vessel is moving).\n\n'''Command Capsules''': The crew spends most of its time in the command capsules which sit atop the engine pods. These are 330 meters in lenght and 75 meters in wide, about the size of a frigate. The entire ship is controlled from these capsules, and the crew is rarely required to enter the engine pods, and almost never visits the cargo balls.\n\n'''Crew''': Despite its huge size, the container train virtually runs itself, requiring a standard crew of only 200 - 100 in each capsule. \n\n'''Droids''': The engine pods are maintained by a diverse population of maintenance and repair Droids, ranging in size from the EB-89 Engine Maintenance Droid, fully as big as a stock light freighter and armored to withstand the backblast from a firing sublight engine, to the mouselike SW1-04 Computer Repair Droid.\n\nThe Droids function completely on their own; when human supervision is required, humans communicate with Droids via personal Droid/Human interfaces (comlinks with data pads), or through the Droid Control Stations in Secondary Engineering and the Maintenance Section.\n\n'''Transport''': The ship is crisscrossed by a complex system of walkways, repulsortubes, and crawlspaces. In addition, each engine pod contains a low-powered shuttle for longer journeys and for carrying heavy loads. The shuttle travels through the cargo balls, connecting the fore and aft pods.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Rendili%20StarDrive%C2%B4s%20Container%20Train",
  "retrievedAt": "2025-10-10T19:13:16.432Z"
}