{
  "title": "Republic Peace Defender",
  "pageId": 598,
  "revisionId": 11894,
  "wikitext": "[[File:Republic-Peace-Defender.jpg|thumb|500px]]\n\n'''Craft''': Incom Corporation Peace Defender<br />'''Type''': Planetary Defense Fighter<br />'''Scale''': Starfighter<br />'''Length''': 13.1 meters<br />'''Skill''': Starfighter Piloting: Peace Defender<br />'''Crew''': 1<br />'''Crew Skill''': Starfighter Piloting 3D+2, Starship Gunnery 3D+2, Starship Shields 2D<br />'''Cargo''': 30 kg<br />'''Consumables''': 3 Days<br />'''Cost''': 85,000 new<br />'''Hyperdrive Multiplier''': x3<br />'''Nav Computer''': No; Astromech Droid holds 5 jumps<br />'''Maneuverability''': 2D+1<br />'''Space''': 6<br />'''Atmosphere''': 330/950 kmh<br />'''Hull''': 3D<br />'''Shield''': 2D<br />'''Sensors''':\n*Passive 25/0D\n*Scan 70/1D\n*Search 105/2D\n*Focus 6/4D\n'''Weapons''':\n*'''2 Laser Cannons''' (Fire Linked)\n: Fire Arc: Front<br />Crew: Pilot<br />Skill: Starship Gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 1-300/1.2/2.5km<br />Damage: 5D\n*'''Ion Cannon'''\n: Fire Arc: Front<br />Crew: Pilot<br />Skill: Starship Gunnery<br />Fire Control: 2D<br />Space Range: 1-3/7/15<br />Atmosphere Range: 1-150/300/700<br />Damage: 4D\n\n'''Capsule''': This is the standard planetary defense fighter issued to Republic worlds by the Galactic Government itself. Though the majority of planets have their own style of starfighter, this standard craft is found in sectors with little starship manufacturing of their own. Many worlds who join the Republic do so for the safety and stability which it provides. Though the Republic is in a time of relative peace and stability, occasional pirate bands and the like wreak havoc on smaller, less defended systems. It is to these members of the Republic that the Defender is issued, on loan for the protection of that system's sovereignty. Members who value their liberty and have sufficient resources will often refuse the Republic's offer to provide such a craft, as they see their defense as their own responsibility, and any help from the Republic could lead to a permanent presence in the system.This craft doesn't fare incredibly well in deep space combat, however in gravity wells it exceeds the standard for speed quite well. It boasts advanced sensors to allow for detecting threats to its respective planets and systems, and moderately powerful shields. The craft is also easily modified to adapt to the different types of star systems; radiation shielding, increased atmospheric thrusters, and the like can be swapped in or added to this craft for greater adaptability. Its swiveling engine design makes it an excellent patrol craft as well. When extended, the thrusters offer more lateral control for maneuverability in combat, but losing overall sublight speed. When contracted, however, the focused thrust of the engines decrease maneuverability but offer a higher top speed (especially within a planet's atmosphere).",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Republic%20Peace%20Defender",
  "retrievedAt": "2025-10-07T22:30:11.677Z"
}