{
  "title": "Selonian Coneship",
  "pageId": 5416,
  "revisionId": 10498,
  "wikitext": "[[File:SelonianConeship.jpg|500px|thumb|right]]\n\n'''Selonian Coneship'''<br />'''Craft''': Selonian Hunchzuc Den Coneship<br />'''Affiliation''': Selonia<br />'''Era''': Rise of the Empire<br />'''Source''': Cracken’s Threat Dossier (page 143), Coruscant and the Core Worlds (page 147)<br />'''Type''': Homemade coneship<br />'''Scale''': Starfighter<br />'''Length''': 20.5 meters<br />'''Skill''': Archaic starship piloting: Selonian coneship<br />'''Crew''': 1<br />'''Crew Skill''': Archaic starship piloting 3D+1<br />'''Passengers''': 2<br />'''Cargo Capacity''': 1 metric ton<br />'''Consumables''': 1 week<br />'''Space''': 5<br />'''Atmosphere''': 225; 650 kmh<br />'''Hull''': 3D\n\n'''Capsule''': \nSelonian cone ships were short-range craft of primitive design, incapable of interstellar travel (and some would say barely capable of interplanetary travel), used by the Selonians. \n\nTheir height and length were roughly equal, their shape roughly that of a flattened cone, hence their name.\n\nCone ships were unusual in that they took off vertically, launching much like ancient rocket craft from the murky Pre-Republic days. The forward viewports and pilot seats were located at the tip of the cone, and the exit hatch extended to the ground from a point 1.5 meters above the base.\n\nArchaic in design, cone ships were the only spacecraft designed by the Selonians themselves. Not adventurous by nature, Selonians avoided space travel generally, and when it was unavoidable, they used ships acquired from other races. Cone ships were slow, sluggish to maneuver, and had sensors so poor that it was easy for enemy craft to sneak up on them from the stern. \n\nSelonia's \"fleet\" of cone ships was decades old and poorly maintained when pressed into service during the First Corellian Insurrection. By that time, the Overden had purchased several squadrons of Corellian Light Attack Fighters to handle the bulk of homeworld defense.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Selonian%20Coneship",
  "retrievedAt": "2025-10-10T19:13:21.499Z"
}