{
  "title": "Sentinel Landing Craft",
  "pageId": 5618,
  "revisionId": 10793,
  "wikitext": "[[File:SentinelLandingCraft.jpg|500px|thumb|right]]\n\n'''Sentinel Landing Craft'''<br />'''Craft''': Sienar Fleet Systems Sentinel-class troop carrier<br />'''Affiliation''': Empire<br />'''Era''': Rise of the Empire<br />'''Source''': Star Wars Trilogy Sourcebook SE (pages 133-134), The Essential Guide to Vehicles and Vessels (pages 78-79)<br />'''Type''': Heavily armed landing craft<br />'''Scale''': Starfighter<br />'''Length''': 20 meters<br />'''Skill''': Space transports: Sentinel-class shuttle<br />'''Crew''': 2; 2 can coordinate, '''gunners''': 3 , '''skeleton''': 1/+10<br />'''Crew Skill''': Space transports 5D, starship gunnery 5D, starship shields 4D<br />'''Passengers''': 54 (troops)<br />'''Cargo Capacity''': 180 metric tons<br />'''Consumables''': 1 month<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': x10<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 2D+2<br />'''Space''': 7<br />'''Atmosphere''': 350; 1,000 kmh<br />'''Hull''': 4D+2<br />'''Shields''': 3D+2<br />'''Sensors''':<br />\n*Passive: 20/0D\n*Scan: 40/1D\n*Search: 80/2D\n*Focus: 4/2D+2\n'''Weapons''':[[File:SentinelLandingCraft2.jpg|500px|thumb|right]]\n*'''8 Laser Cannons''' (retractable, fire-linked)\n: Fire Arc: Front<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 6D\n*'''2 Concussion Missile Tubes''' (fire-linked)\n: Fire Arc: Front<br />Skill: Missile weapons<br />Fire Control: 3D<br />Space Range: 1/3/7<br />Atmosphere Range: 100/300/700<br />Damage: 9D\n*'''2 Repeating Blaster Cannons''' (retractable)\n: Fire Arc: Turret<br />Scale: Speeder<br />Crew: 1<br />Skill: Vehicle blasters<br />Fire Control: 4D<br />Atmosphere Range: 1-50/100/250<br />Damage: 3D+2\n*'''Ion Cannon''' (retractable)\n: Fire Arc: Turret<br />Crew: 1<br />Skill: Starship gunnery<br />Space Range: 1-3/7/36<br />Atmosphere Range: 100-300/700/3.6 km<br />Damage: 4D\n\n'''Capsule''': With its folding wing configuration and matching cockpit module, the Sentinel-class landing craft was based on the Lambda-class shuttle,[5] both shuttles having seen design origins in the Theta-class shuttle. However, unlike its predecessor and its counterpart, the landing craft's exterior was encased in armor plating 25% heavier than the armor of a Lambda-class. The landing craft was also equipped with four deflector shield projectors. Despite its large size and heavy weight, the Sentinel was fast and agile due to its Cygnus HD7 engine array.\n\nThe Sentinel relied on a crew consisting of a pilot, a co-pilot/sensor officer, as well as three gunners. The vehicle's sensor suite, which was located in the cockpit, allowed navigation in nearly all conditions and featured infrared imaging, motion detectors, and life-form indicators. The vessel's computer also featured an automatic mapping function and a rudimentary autopilot that could pilot the vessel towards an Imperial garrison, starship, or homing beacon during emergencies, and included powerful communication arrays which enabled contact with all Imperial starships and garrisons within a given system.\n\nIn its standard configuration, a Sentinel could carry 54 stormtroopers (approximately six squads), 12 E-web heavy repeating blasters, and 6 74-Z speeder bikes. When its seats were removed and it was converted to carrying supplies, it could transport 36 74-Z speeder bikes, or 12 compact assault vehicles such as AT-STs or AT-PTs. Its total cargo capacity was 180 metric tons.\n\nThe landing craft's weapons load consisted of 8 laser cannons, 2 concussion missile launchers, 1 retractable ion cannon, and 2 rotating repeating blasters. Three gunners were responsible for manning these weapons, which were all linked to the shuttle's precise targeting computers. Since the Sentinel-class was heavily armed, it also served as a combat support vehicle. \n\nAfter the Clone Wars, the Galactic Empire made the change from starships like the Acclamator-class assault ship that were able to land on planets to offload troops, to spacebound Star Destroyers, the sheer size of which required them to remain in orbit above the planet. This change brought about the need for a dedicated, armored, and maneuverable landing craft to safely transport troops directly into battle. The Cygnus-Sienar shuttle family fulfilled most of the Empire's need for light transports, introducing the Sentinel-class landing craft some time before the Battle of Yavin, and it eventually became the main troop transport in the Imperial Navy.\n\nThe primary use of the Sentinel-class was to transport troops between Star Destroyers/Cruisers/Star Dreadnoughts and the surface of a planet, but they could also serve as air support, short-range scouts, light cargo vessels, and even starfighter support.[1] The vehicle was also used in conjunction with larger Y-85 Titan dropships or AT-AT barges for joint infantry and armor assaults, as well as making an excellent atmospheric transport, with many Imperial garrisons keeping at least one Sentinel on-hand for this purpose. Several Sentinel-class landing craft were used on the desert world Tatooine, where they deployed sandtroopers and their dewback mounts to search for the missing Death Star plans in 0 BBY.\n\nBecause of its versatility and heavy arms and armor, the Sentinel-class saw great popularity inside, and outside, the Galactic Empire, being used by various other groups including the Rebel Alliance, the New Republic, Galactic Federation of Free Alliances, mercenary groups, and continued serving the Imperial Remnant long after the death of Emperor Palpatine during the Battle of Endor in 4 ABY.\n\nDuring the Galactic Civil War, the Rebels used a fleet of captured Sentinel-class landing craft as support ships. The Alliance logo was painted on their central wing, to help tell them apart from the Imperial ships. The New Republic also developed its own unique replacement for the Sentinel-class, the Bantha-class assault shuttle, which featured much heavier armor than its Imperial counterpart.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Sentinel%20Landing%20Craft",
  "retrievedAt": "2025-10-10T19:13:24.117Z"
}