{
  "title": "Seth Fighter",
  "pageId": 470,
  "revisionId": 11898,
  "wikitext": "[[File:Seth-Fighter.jpg|thumb|500px]]\n\n'''Craft''':&nbsp; Sienar&nbsp; Fleet Systems X-4 SETH<br />'''Type''':&nbsp; Experimental Space Superiority Fighter<br />'''Scale''':&nbsp; Starfighter<br />'''Length''':&nbsp; 10 meters<br />'''Skill''':&nbsp; Starship Piloting; SETH<br />'''Cost''':&nbsp; Not for Sale (5,000,000 credits, used only)<br />'''Crew''':&nbsp; 1 (2)<br />'''Crew Skill''':&nbsp; Varies considerably<br />'''Passengers''': 1<br />'''Cargo Capacity''':&nbsp; 200 kg.<br />'''Consumables''':&nbsp; 1 month<br />'''Hyperdrive Multiplier''': x1<br />'''Hyper Backup''':&nbsp; None<br />'''Nav Computer''':&nbsp; Yes<br />'''Maneuverability''':&nbsp; 3D<br />'''Space''':&nbsp; 10<br />'''Atmosphere''':&nbsp; 415; 1200<br />'''Hull''':&nbsp; 3D<br />'''Shields''':&nbsp; 2D<br />'''Sensors''':\n*Passive:&nbsp; 20/0D\n*Scan:&nbsp; 40/1D\n*Search:&nbsp; 45/2D\n*Focus:&nbsp; 2/3D\n'''Weapons''':&nbsp;\n*'''1 Concussion Missile Launcher'''\n: Scale:&nbsp; Starfighter<br />Fire Arc:&nbsp; Front<br />Crew:&nbsp; Pilot<br />Skill:&nbsp; Starship Gunnery<br />Fire Control:&nbsp; 2D<br />Space Range:&nbsp; 1-2/4/8<br />Atmosphere Range:&nbsp; 100-200/400/800<br />Damage:&nbsp; 7D\n*'''4 Laser Cannons''' (fire linked)\n: Scale:&nbsp; Starfighter<br />Fire Arc:&nbsp; Front<br />Crew:&nbsp; Pilot<br />Skill:&nbsp; Starship Gunnery<br />Fire Control:&nbsp; 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range:&nbsp; 100-300/1.2 km/ 2.5 km<br />Damage: 5D\n\n'''Capsule''': Before the Sienar Fleet Systems produced the widely success TIE fighter, they produced a number of other prototype fighters.&nbsp; The SETH (Single Engine Twin Heatpump) was one of the most successful of those ships, going through several versions before the fighter type was finally abandoned. The SETH fighter is widely considered one of the finest fighters ever, a far superior vehicle to the later TIE series.&nbsp; However, it did not become the standard space superiority fighter of the Old Republic or the Empire, for a pair of reasons.&nbsp; Firstly, the SETH ships had a troublesome problem with the integration of their heatpumps.&nbsp; Very often, one of the two solar panel would wind up overheating, and failing to function.&nbsp; Advances in Engineering under the Empire have solved that problem, but too late for the SETH fighters;&nbsp; The TIE had already become standard.&nbsp;\n\nSecondly, the SETH was simply too expensive.&nbsp; One of these ships had the same production cost as 23 TIEs.&nbsp; In an attempt to solve this problem, SFS came up with the earliest TIE fighters.&nbsp; Even with all the advances made in engineering, SETH fighters will still be just about as expensive to produce as they were at their inception, though they would probably be even better in terms of speed and weaponry.\n\nIn form, the SETH is a work of art.&nbsp; The body of the ship is long and smoothly molded, with the laser cannons set flush against the craft's sides, and the concussion missile hardpoint directly below the nose.&nbsp; A pair of solar panels extend outward, past it's rear.&nbsp; They are angled slightly, away from the ship and down (sorry if you can't really see it, but I don't have a scanner....)&nbsp; In combat, the SETH has no virtually no equal.&nbsp; No ship of it's time was capable of it's performance, and few modern ship are a match for a mint condition SETH with a repaired heatpump mechanism.&nbsp; The SETH's combat effectiveness is due to a number of advances that SFS built into it.&nbsp; Many of these were discarded from the TIE series due to their great cost.&nbsp; The Laser cannons are the equal of modern starship weapons, despite their age.&nbsp; The SETH was one of the first ships built with modern gyro-stabilizers, enabling it to reach great speeds without smearing it's crew on the viewscreen when it makes sharp turns.&nbsp; The controls of the SETH are highly intuitive, and are designed to be used by either one or two pilots:&nbsp; The pilot's chair can be moved to the right, and a second seat folded out of the rear bulkhead.&nbsp;<br />\n\nFinally, their is a high level of top quality miniaturization in all of the SETH's internal systems, from the hyperdrive to the shield generators, allowing for such a high level of performance from all the internal systems, despite the thick reactant armoring of the SETH. The final run of the SETH was of twenty ships.&nbsp; These ships had almost none of the problems that plagued the earlier versions of the fighter (except for the heatpump interface).&nbsp; Budget concerns and budget concerns only kept this ship from going into production.&nbsp; Those final run SETHs that survived the various tests that the craft was put through all wound up in the hands of government officials.&nbsp; Those that are still around are either in the hands of Moffs that fancy themselves either fighter pilots or collectors of rare items.&nbsp; The blueprints of the SETH were erased from the Imperial records during the capture of Coruscant with many other classified documents, and if the New Republic ever gets their hands on a working SETH, they may very well resurrect this fighter type, in a somewhat stripped down and modernized version.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Seth%20Fighter",
  "retrievedAt": "2025-10-08T13:07:14.659Z"
}