{
  "title": "Sheathipede Shuttle",
  "pageId": 5620,
  "revisionId": 10796,
  "wikitext": "[[File:SheathipedeShuttle.jpg|500px|thumb|right]]\n\n'''Sheathipede Shuttle'''<br />'''Craft''': Trade Federation Sheathipede-class Lapiz Cutter Shuttle<br />'''Affiliation''': Neimoidians<br />'''Era''': Old Republic<br />'''Source''': Secrets of Naboo (page 18)<br />'''Type''': Transport shuttle<br />'''Scale''': Starfighter<br />'''Length''': 15 meters<br />'''Skill''': Space transports: Sheathipede shuttle<br />'''Crew''': 2 pilot droids<br />'''Crew Skill''': As pilot droid<br />'''Passengers''': 5<br />'''Cargo Capacity''': 500 kilograms<br />'''Consumables''': 5 days<br />'''Cost''': 22,000 (new), 9,000 (used)<br />'''Space''': 5<br />'''Atmosphere''': 295; 850 kmh<br />'''Hull''': 2D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 15/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 1/2D\n'''Weapons''':\n*Blaster Cannon\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-5/10/17<br />Atmosphere Range: 100-500/1/1.7km<br />Damage: 3D\n\n'''Capsule''': They were shaped like soldier beetles, and their clawfooted landing legs could only settle down on hard surfaces. This was due to the businessmen's distaste for dealing with poor, underdeveloped worlds.\n\nThese shuttles often had their cockpits removed and replaced by automated pilots, so that cabin space could be increased. The Sheathipede-class shuttle was a short-range ship, used only for planetary travel or to ferry passengers to and from an orbital space station or starship.\n\nThe personal shuttle of Trade Federation Viceroy Nute Gunray was named the Lapiz Cutter. This ship had no weapons, although it was protected by powerful deflector shields.\n\nA distinct variant of the Sheathipede had several laser cannons and a seat for a gunner next to the pilot, thus widening the cockpit. Due to the additional armament on the dorsal fin, the communications antenna was shortened.\n\nThe shuttle bore a resemblance to the larger Neimoidian trader.\n\nSheathipede-class shuttles were used by Neimoidian officials to land on Naboo after they had invaded the planet. 10 years later, when the Battle of Geonosis appeared to go in favor of the Republic, the Neimoidian representatives took off in one of these craft.\n\nCount Dooku maintained an armed shuttle onboard his personal frigate. Obi-Wan Kenobi and Anakin Skywalker used it to shoot his solar sailer down over Vanqor, though the Sith Lord escaped. During the Battle of Tirahnn, the Separatist spy Braxus Lyn attempted to transport the Zygerrian Zolghast off Tirahnn in one.\n\nGeneral Grievous used a shuttle to escape Saleucami when his landing craft crash landed on the planet. Another shuttle was used by Anakin Skywalker, his Padawan Ahsoka Tano and clone troops to escape Cad Bane's Munificent-class star frigate just before it exploded. Mother Talzin and her Nightsister tribe also had a shuttle which they used to travel to Dooku's palace on Serenno. How they acquired it is unknown, although it may have been a gift from the Count.\n\nGeneral Grievous also used one of these shuttles to land on the planet Utapau following the Battle of Coruscant. His shuttle had an unaltered cockpit, due to the General's distrust of automated systems.\n\nAfter the Clone Wars ended, few Neimoidians would venture outside their systems unless on business trips. When doing so, they still used Sheathipede-class shuttles. Bail Organa used an \"antique\" model of the shuttle on several missions prior to the Corellian Treaty.\n\nAbout 1 year prior to the Battle of Yavin Galen Marek's clone was chasing Baron Tarko on Cato Neimoidia, at one point he damaged a landing platform and a ship of this class (possibly Tarko's personal transport) slid off the platform and plunged to the planet below. Later on, Marek's clone also saw a hologram of a Sheathipede-class.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Sheathipede%20Shuttle",
  "retrievedAt": "2025-10-10T19:13:25.953Z"
}