{
  "title": "Sienar Fleet Systems TIE Air Cruiser Assault Platform",
  "pageId": 6906,
  "revisionId": 12268,
  "wikitext": "[[File:Sienar-Fleet-Systems-TIE-Air-Cruiser-Assault-Platform.jpg|thumb|500px|right]]\n\n'''Name''': Tie Air Cruiser<br />'''Type''': Sienar Fleet Systems TIE Air Cruiser Assault Platform<br />'''Scale''': Starfighter<br />'''Length''': 22.3 Meters<br />'''Skill''': Starfighter Piloting; Tie Air Cruiser<br />'''Crew''': 2 + 2 Gunners<br />'''Crew Skill''': Starfighter Piloting 5D, Starship Gunnery 5D+2, Starship Shields 3D<br />'''Consumables''': 2 Weeks<br />'''Cost''': 500,000 (new)<br />'''Cargo Capacity''': 150 kg<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': N/A<br />'''Nav Computer''': Limited to 6 Jumps<br />'''Space''': 5<br />'''Atmosphere''': 250; 750kmh<br />'''Maneuverability''': 1D<br />'''Hull''': 5D<br />'''Shields''': 4D<br />'''Sensors''':\n*Passive: 25/1D\n*Scan: 40/2D\n*Search: 60/3D\n*Focus: 4/3D+2\n'''Weapons''':\n*'''Turbolaser Cannon'''\n: Fire Arc: Front<br />Scale: Capital<br />Fire Control: 4D<br />Fire Rate: 1/3<br />Space: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5km<br />Damage: 6D\n*'''Proton Bomb Launchers''' (30 Bomb Magazine)\n: Fire Arc: Front<br />Scale: Starfighter<br />Fire Control: 3D<br />Space: 3/9/21<br />Atmosphere Range: 200-300/900/2.1km<br />Damage: 9D<br />\n\n'''Description''': Although sharing some components with the TIE series of fighters, the Tie Air Cruiser is a totally different design, designed to control the skies above planets and provide TIE Bomber Squadrons with Anti Capital ship support. The Air Cruiser is basically a heavily armored Aerial vehicle with extremely powerful weapons mounted on it, the Turbolaser cannon is capable of large amounts of damage although has a slow recharge rate, being mainly used to smash enemy installations or to destroy entire columns of enemy troops, but is equally good at disabling enemy starships and destroying transports. The Proton Bomb Launcher is similar to that on TIE Bombers, and is a long ranged weapon capable of heavy damage to opponents, and is used as a backup weapon capable of firing more often than the Turbolaser. Air Cruisers obviously need protected due to their erratic fire rate and ammunition capacity, but used properly can swing the scales on the battlefield, however due to their expense the Empire has fielded only very few of these vessels, much preferring to use cheaper more disposable equipment and vehicles.\n\n\n'''Source''': [http://www.RPGGamer.org www.RPGGamer.org]",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Sienar%20Fleet%20Systems%20TIE%20Air%20Cruiser%20Assault%20Platform",
  "retrievedAt": "2025-10-10T19:13:26.998Z"
}