{
  "title": "SkyBlind Recon Ship",
  "pageId": 576,
  "revisionId": 10694,
  "wikitext": "[[File:SkyBlindReconShip.jpg|400px|thumb|right]]\n\n'''Craft''': Loronar SkyBlind Recon Ship<br />'''Type''': Reconnaissance scoutship<br />'''Scale''': Starfighter<br />'''Length''': 21 meters<br />'''Skill''': Space transport piloting: SkyBlind<br />'''Crew''': 1<br />'''Passengers''': 7<br />'''Cargo Capacity''': 50 metric tons; 20 cubic meters<br />'''Consumables''': 6 months<br />'''Hyperdrive Multiplier''': x3<br />'''Hyperdrive Backup''': x20<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 0D<br />'''Space''': 2<br />'''Atmosphere''': 225; 650 km/h<br />'''Hull''': 6D<br />'''Shields''': 3D (shields apply to defence against sensors as well)<br />'''Sensors''':\n*Passive: 50/2D\n*Scan: 30/1D\n*Search: 50/2D\n*Focus: 3/3D\n'''Weapons''':\n*'''1 Proton Torpeado Launcher'''\n: Scale: Starfighter<br />Fire Arc: All<br />Crew: Pilot<br />Skill: Starship gunnery<br />Fire Control: 0D<br />Space Range: 1/3/7<br />Atmosphere Range: 50-100m/300m/700m<br />Damage: 7D\n\n\n\n'''Landing Sphere'''<br />'''Craft''': Loronar Landing Sphere<br />'''Type''': Surface to starship transport<br />'''Scale''': Starfighter<br />'''Length''': 6 meters<br />'''Skill''': Repulsor lift operations: SkyBlind landing sphere<br />'''Crew''': 1<br />'''Passengers''': 7<br />'''Cargo Capacity''': 5 metric tons; 2 cubic meters<br />'''Consumables''': 1 week<br />'''Maneuverability''': 0D<br />'''Move''': 225; 650 km/h<br />'''Body Strength''': 5D<br />'''Shields''': 1D (Applies only to sensors)<br />'''Sensors''':\n*Passive: 5/0D\n*Scan: 10/1D\n*Search: 15/2D\n*Focus: 1/2D\n'''Weapons''': None\n\n'''Capsule''': The SkyBlind reconnaissance ship was a starship designed by Loronar Corporation for planetary exploration. The main idea in mind for the design was to stay concealed while gathering information over a planet, to avoid hostile reactions from unknown lifeforms or primitive cultures. The SkyBlind used both sensor jammers and visual cloaking, appearing to a casual observer on the ground as a discoloration in atmosphere that would be easily confused with natural phenomena.\n\nThe ship included a repulsorlift module for closer inspection and landing on small spots. This \"landing sphere\" could carry all the mission crew along with 5 metric tons of cargo, and like the main Skyblind body, it had cloaking capability.\n\nThe SkyBlind was used by the Imperial Navy for seeking Rebel bases, and later by the New Republic Scout Service to explore Outer Rim and Wild Space systems.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/SkyBlind%20Recon%20Ship",
  "retrievedAt": "2025-10-10T19:13:30.279Z"
}