{
  "title": "Speeder Transport",
  "pageId": 5661,
  "revisionId": 11193,
  "wikitext": "[[File:SpeederTransport.jpg|500px|thumb|right]]\n\n[[File:Vwing.jpg|thumb|right]]\n\n'''Speeder Transport'''<br />'''Craft''': Slayn & Korpil V-Wing Speeder Transport, Model A<br />'''Affiliation''': New Republic<br />'''Era''': New Republic<br />'''Source''': Dark Empire Sourcebook (pages 120-121)<br />'''Type''': Orbital interface transport<br />'''Scale''': Starfighter<br />'''Length''': 20 meters<br />'''Skill''': Space transports: V-wing transport<br />'''Crew''': 2, '''skeleton''': 1/+5<br />'''Crew Skill''': Space transports 5D, starship shields 4D<br />'''Passengers''': 4(pilots)<br />'''Cargo Capacity''': 2 metric tons, docking sleeves for 4 VWings<br />'''Consumables''': 3 days<br />'''Cost''': 175,000 credits<br />'''Maneuverability''': 1D+2<br />'''Space''': 4<br />'''Atmosphere''': 350; 1,000 kmh<br />'''Hull''': 5D<br />'''Shields''': 2D\n[[File:SpeederTransport2.jpg|500px|thumb|right]]\n'''Capsule''': The V-wing airspeeder transport was a transport used by the New Republic to deploy V-wing airspeeders from capital starships. Like the V-wing itself, the transport was manufactured by Slayn & Korpil.\n\nIt was twenty meters long and could carry four V-wing airspeeders under its arching wings. These transports were similar in shape to the airspeeders they carried, but much larger in size. The V-wings were carried externally, and could be accessed through retractable docking tubes, as they were not sealed for space flight. As such, pilots travelled onboard the transport while in space.\n\nOnce the transport reached the upper atmosphere of a planet, the V-wing pilots would climb down and strap into their airspeeders. After releasing its V-wings, the transport could return to its mothership to take another group of V-wings or remain in near orbit to await its speeders at a rendezvous point.\n\nThe V-wing transport was unarmed and thus had to depend on starfighters such as X-wings and E-wings for protection.\n\nThe design came about due to frustration over the slow deployment of military airspeeders, which had previously depended on slower transports or assembly on-site. As the V-wing speeder was being designed, an accompanying transport was also being made by New Republic engineers.\n\nDuring the First Battle of Mon Calamari, V-wing airspeeder transports were launched from capital ships such as the Imperial-class Star Destroyer Emancipator, which had been captured and put to use by the Republic. They saw action against the cloned Emperor Palpatine's World Devastators, TIE/D fighters, and wavewalkers.\n\nThe airspeeder/transport combination tactic had been used successfully in over a dozen battles around the time of the World Devastator assault on Dac. The Model B, an upgraded version of the V-wing transport, was later produced by Slayn & Korpil. It could ferry six V-wing airspeeders.\n\nFollowing the successful deployments, the transport docking tube was studied by Slayn & Korpil for possible addition of an universal adapter that would allow T-47 airspeeders and other models to be used with the transport.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Speeder%20Transport",
  "retrievedAt": "2025-10-10T19:13:33.738Z"
}