{
  "title": "Sphious",
  "pageId": 563,
  "revisionId": 11904,
  "wikitext": "[[File:Sphious.jpg|thumb|500px]]\n\n'''Craft''': Sphious<br />'''Type''': Illuthian Small Wasp fighter.<br />'''Scale''': Starfighter<br />'''Length''': 12 meters<br />'''Skill''': Starfighter piloting: Wasp fighters<br />'''Crew''': 1 or 2<br />'''Passengers''': None<br />'''Cargo Capacity''': None<br />'''Consumables''': 2 days<br />'''Hyperdrive Multiplier''': None<br />'''Hyperdrive backup''': None<br />'''Nav Computer''': None<br />'''Manuverability''': 3D+1<br />'''Space''': 11<br />'''Atmosphere''': 450; 1300 KMH<br />'''Hull''': 3D+1 (4D+2 for energy attacks)<br />'''Shields''': None<br />'''Sensors''':&nbsp;\n*Passive: 30/1D\n*Scan: 60/2D\n*Search: 90/4D\n*Focus 4/4D+1\n'''Weapons''':\n*'''2 Light ShockBlasts''' (linked)*\n: Fire arc: Front<br />Ammo: 40 shots<br />Skill: Starship gunnery<br />Fire control: 3D<br />Space range: 1-3/12/25<br />Atmosphere range: 100-300m/1.2km/2.5km&nbsp;<br />Damage: 5D\n\n'''Capsule''': The Sphious light fighters are made mainly from smaller adolescent wasps. They have the appearance of a wasp with cropped wings. At the base of the wings are now small engine boosters, which enable better manuverability and speed. The stinger portion has been completely removed leaving the ship the sleekest of the awkward vessels, though landing legs have been fitted. The Sphious easily docks to the underbelly of the larger capital ships for caring, since they have no hyperdrive they rely on larger vessels for docking and support.*Illuthian shockblast weapons are much like Blasters in most respects, though they have some solid matter in them, they are like very small missiles will a charged electric field which delivers a shock upon impact, due to the shock enemy ships suffer -1 to space after being hit for 3 rounds(not to exceed -2). The loss in speed is due to the violent nature of the impact and the light electric shocks which often cause the targets engines to appear to be overloading.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Sphious",
  "retrievedAt": "2025-10-08T13:07:19.355Z"
}