{
  "title": "Spiral Assault Ship",
  "pageId": 5623,
  "revisionId": 10801,
  "wikitext": "[[File:SpiralAssaultShip.jpg|500px|thumb|right]]\n\n'''Spiral Assault Ship'''<br />'''Craft''': Sienar Ships Spiral-class Assault Ship<br />'''Affiliation''': Empire<br />'''Era''': Rebellion<br />'''Source''': Black Ice (page 21)<br />'''Type''': Single-use boarding ship<br />'''Scale''': Starfighter<br />'''Length''': 12 meters long, 20 meters wide<br />'''Skill''': Space transports<br />'''Crew''': 2<br />'''Crew Skill''': Space transports 4D, starship shields 3D<br />'''Passengers''': 4<br />'''Cargo Capacity''': 2 metric tons (600 kilograms in overhead bin; 1,400 kilograms in rear cargo compartment)<br />'''Consumables''': 1 week<br />'''Cost''': Not available for sale<br />'''Maneuverability''': 1D+2<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 kmh<br />'''Hull''': 5D<br />'''Shields''': 2D+2<br />'''Sensors''':<br />\n*Passive: 25/0D\n*Scan: 40/1D\n*Search: 60/2D\n*Focus: 3/3D\n'''Stealth''': +4D sensor difficulties<br />'''Weapons''':\n*One-Shot Proton Charge\n: Fire Arc: Front<br />Crew: 1 (co-pilot)<br />Skill: Starship gunnery<br />Fire Control: 0D<br />Damage: Penetrates hull and shielding\n\n'''Capsule''': This unarmed vessel was designed to sneak up on an unsuspecting target and release a strike force directly onto the enemy vessel.\n\nUnlike other assault shuttles, the Spiral-class was completely unarmed, relying on its advanced stealth suite to allow the craft to achieve striking distance. Once the vessel reached its target's particle shields, a one-use proton charge would explode, causing the target's shields to weaken enough for the Spiral to pass through.\n\nOnce through the shield, the Spiral smashed itself headlong into the target. The hull of the Spiral was composed of tekonite, which would vaporize upon collision, absorbing up to 92% of the damage. The resulting impact damage to the target ship allowed enemy forces to enter the vessel via hull breaches using vac-suits.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Spiral%20Assault%20Ship",
  "retrievedAt": "2025-10-10T19:13:35.783Z"
}