{
  "title": "Starlancer Project Starship",
  "pageId": 595,
  "revisionId": 11903,
  "wikitext": "[[File:Starlancer-Project-Starship.jpg|thumb|500px]]\n\n'''Craft''': Starlancer Project Starship<br />'''Type''': Superweapon Starfighter<br />'''Scale''': Starfighter<br />'''Length''': 8.7 Meters<br />'''Skill''': starfighter piloting: Starlancer<br />'''Crew''': 1<br />'''Crew Skill''': Starfighter piloting 3D+1, starship gunnery 4D<br />'''Passengers''': 0<br />'''Cargo Capacity''': 15 kg<br />'''Consumables''': 1 day<br />'''Cost''': Not Available for Sale (estimated value 159,000 credits)<br />'''Space''': 3<br />'''Atmosphere''': 260; 750 kmh<br />'''Maneuverability''': 0D<br />'''Hull''': 0D+1<br />'''Shields''': 1D<br />'''Sensors&nbsp;'''\n*Passive: 30/1D+1&nbsp;\n*Scan: 80/2D+2&nbsp;\n*Search: 130/4D&nbsp;\n*Focus: 10/4D+2\n'''Weapons''':\n*'''Starlancer Cannon'''\n: Fire Arc: Front<br />Crew: Pilot<br />Skill: Starship Gunnery<br />Scale: Capital<br />Fire Control: 3D<br />Space Range: 10-15/30/60 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Damage: 7D\n\n'''Capsule''': When three Starlancer Project Starships fire their Starlancer Cannons at a focusing ship and make a successful attack, the damage from their attacks is combined and redirected at a target of the focusing ship's choice, and the focusing ship takes no damage. Starlancer ships may fire at targets at and beyond sensor range when fed data from another source.The Starlancer Project is a top-secret superweapon project designed on Borleias by the teams working for Wedge Antilles and the New Republic forces based there. The ships are cobbled together, and are composed of a large piece of what appears to be V-Shaped piping with irising lenses on each end. Bisecting the angle of the piping is a cockpit, resembling that of a Y-Wing, with a large cannon of its own beneath the cockpit. The Starlancers Cannons can produce a powerful blast of energy capable of dealing massive damage to capital ships, and can then combine their fire to focus their beams through one ship, firing a laser blast that can travel long distances of space at faster-than-light speeds and attack ships in remote systems as well as those close by. Using the cannon requires massive amounts of energy, and one shot causes the ship to drain nearly all of its power. The ship must recharge for 1 hour before being able to fire again. This superweapon is still in the developmental stages, and the ships themselves are rickety and dangerous to pilot even when not engaged in combat.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Starlancer%20Project%20Starship",
  "retrievedAt": "2025-10-08T13:07:23.153Z"
}