{
  "title": "Starjumper",
  "pageId": 5548,
  "revisionId": 27375,
  "wikitext": "[[File:Starjumper.jpg|400px|thumb|right]]\n\n'''Starjumper'''<br />'''Craft''': Ergesh Starjumper<br />'''Affiliation''': Ergesh<br />'''Era''': Old Republic<br />'''Source''': Planets Collection (page 214)<br />'''Type''': Customized biological vessel<br />'''Scale''': Starfighter<br />'''Length''': 200 meters<br />'''Skill''': Space transports<br />'''Crew''': 50, '''gunners''': 5, '''skeleton''': 30/+10<br />'''Crew Skill''': Space transports 4D, starship gunnery 4D+1<br />'''Passengers''': 30<br />'''Cargo Capacity''': 400 metric tons<br />'''Consumables''': 6 momths<br />'''Cost''': Not available for sale<br />'''Hyperdrive Multiplier''': x6<br />'''Hyperdrive Backup''': x22<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 2<br />'''Atmosphere''': 225; 650 kmh<br />'''Hull''': 3D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 30/1D\n*Scan: 40/2D\n*Search: 50/2D+2\n*Focus: 4/3D\n'''Weapons''':\n*Electrical Beam\n: Fire Arc: Front<br />Crew: 5<br />Skill: Starship gunnery<br />Fire Control: 2D+2<br />Space Range: 1-3/7/10<br />Atmosphere Range: 100-300/700/1 km<br />Damage: 5D\n\n'''Note''': Starjumpers are biologically engineered sentient creatures, with the ability to self-repair battle damage with natural healing rolls made every three hours.\n\n'''Capsule''': The Ergesh Starjumper was a unique form of starship created by the [[Ergesh]] species. The ship was technically a living organism that was powered by the life energies of 800 Ergesh making them the only species that could pilot their own ships as the symbiosis between ship and crew was not possible with other species. These ships measured 30 meters in diameter and were biologically grown in the Industrial Swampfields of Ergeshui. These ships relied on organic appendages to function in the roles of navigation, fire control and communications.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Starjumper",
  "retrievedAt": "2025-10-10T19:13:43.593Z"
}