{
  "title": "Star Cab",
  "pageId": 578,
  "revisionId": 10697,
  "wikitext": "[[File:StarCab.png|400px|thumb|right]]\n\n'''Craft''': Orlean Star Explorer<br />'''Type''': Ancient Exploration Vessel<br />'''Scale''': Starfighter<br />'''Length''': 70 meters<br />'''Skill''': Space transport piloting<br />'''Crew''': 1 Human, 3 Droid<br />'''Passengers''': 11<br />'''Cargo Capacity''': 100 metric tons; 40 cuic meters<br />'''Consumables''': 5 Years<br />'''Hyperdrive Multiplier''': x10<br />'''Nav Computer''': None (Astromech Droid)<br />'''Maneuverability''': 1D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1050 km/h<br />'''Hull''': 4D<br />'''Shields''': 0D<br />'''Sensors''':\n*Passive: 10/1D\n*Scan: 15/2D\n*Search: 25/3D\n*Focus: 3/4D\n'''Weapons''':\n*'''4 Blaster Cannons'''\n: Scale: Starfighter<br />Fire Arc: 2 front, 2 rear<br />Crew: 1 (usually droid)<br />Skill: Starship gunnery<br />Fire Control: 0D<br />Space Range: 1-4/15/20<br />Atmosphere Range: 100-400m/1.5/2 km<br />Damage: 2D\n\n'''Capsule''': The Orlean Star Explorer, colloquially known as the Star Cab, was an exploration vessel considered ancient by the time of the New Republic Scout Service. Star Cabs were frequently crewed by droids, presumably to minimize consumption of air, water, and food during long surveys. The standard navigation droid equipped on Star Cabs may have been an ancient predecessor to the R2-series astromech droid. Scouts who served aboard Star Cabs for extended periods were said to develop disagreeable attitudes toward the ships' droid crews. Luskin Exovar kept a Star Cab hanging from the ceiling of his emporium along with several other vehicles.\n\nStar Cabs originated early enough in Galactic history that hyperdrive units were not yet completely reliable. A Star Cab's Class 10 hyperdrive was much slower than those employed by most New Republic scouts; indeed, by that era a Class 10 would have been a more common speed for a backup hyperdrive (which the Star Cab lacked entirely).\n\nStar Cabs were usually heavily armed, considering the wilder state of the Galaxy in their heyday. (However, they lacked shields, possibly due to technological constraints at the time.) Their standard armament consisted of four blaster cannons, two firing forward and two aft.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Star%20Cab",
  "retrievedAt": "2025-10-10T19:13:42.099Z"
}