{
  "title": "Tannhauser Shipyards JF-39 StarFighter",
  "pageId": 5254,
  "revisionId": 11909,
  "wikitext": "[[File:Tannhauser-Shipyards-JF-39-StarFighter.jpg|thumb|500px]]\n\n'''Tannhauser Shipyards JF-39 StarFighter'''<br />'''Craft''': Tannhauser JF-39<br />'''Type''': Short Range StarFighter<br />'''Scale''': StarFighter<br />'''Length''': 12.6 meters<br />'''Skill''': StarFighter Piloting: JF-39<br />'''Crew''': 1<br />'''Crew Skill''': Varies<br />'''Passengers''': 1<br />'''Cargo Capacity''': 85 Kilograms<br />'''Consumables''': 2 Days<br />'''Cost''': 105,000 (new) 66,000 (used)<br />'''Manoeuvrability''': 3D+1<br />'''Space''': 7<br />'''Atmosphere''': 375; 1,075 KMH<br />'''Hull''': 2D+1\n'''Sensors''':\n*Passive: 30 / 1D\n*Scan: 45 / 3D\n*Search: 60 / 2D\n*Focus: 4 / 3D+2\n'''Weapons''':\n*Twin Medium Laser Cannon\n: Fire Arc: Front<br />Skill: Starship Gunnery<br />Fire Control: 1D+2<br />Space Range: 1-4 / 15 / 27<br />Atmosphere Range: 100-300 / 1.1 / 1.8 km<br />Damage: 4D+2\n\n'''Capsule''':<br />Another offering from Tannhauser Shipyards, the JF-39 was initially designed as a high-profile, status escort starfighter. The initial contract was brought through Eldjinn HoloVideo Productions, a major entertainment company. The design brief was for a short range starfighter, capable of defending inter-system pleasure yachts. Although their primary role was as a defence craft, Eldjinn required that the fighter, which was not expected to engage in combat frequently, meet other, less common requests. In order to satisfy both the company's image, and to pacify the somewhat flighty egos of the corporate pilots, the JF-39 was fitted with extensive non-essential systems. The Corporate version featured; a complete Hypersonique™ hexaphonic turbo sound system with 128 datachip changer, a full Prummann & Holst™ holovid suite with wideband multiplexing connection for total channel scanning and a fully stocked, auto-tender equipped mini-bar, with two days worth of food storage in Uber-Cryo™ hoppers. The cockpit, finished in burnished chrome and greel wood, was touched off by Maximumm Style™ detailing, and a level seven AI assisted adaptive control system, which deployed controls to the various positions as and when the pilot required them. This allowed the main seat to be virtually free of control mechanisms, and was finished in hand stitched Kabassa beast leather.<br />Immediately behind the cockpit, lay a small 'chill' area. This featured a semicircular couch, in Kabassa beast leather, with greel wood trimmings. This area contained the auto-tender and the holovid station, and was set off by the sweeping plexiglastoid rear window, allowing un paralleled visibility when reclining.<br />The exterior was designed to look more like starfighters from the holovids Eldjinn produced than representative of a real fighter. The twin laser cannon were enhanced with unusually large emplacements, making them fully twice as large as they needed to be, with no improvement in effectiveness.<br />Extra vents, grills, antennae and a completely fake missile system slung under each wing, made the ship LOOK extremely impressive. After seeing the ships in action, during an attempted kidnapping of Eldjinn's famous starlet Kassadi Hotblakk, Tannhauser Shipyards were inundated by inquiries about the fighter. Work began on a budget version of the craft. Alterations included improving the sensor package and replacing most of the high end design features with more economical versions. Tannhauser decided to keep the cosmetic features of the cannon, however, as it was felt, and verified by a voxpop, that if these were altered, then the ship would look different enough that brand recognition would be harmed.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Tannhauser%20Shipyards%20JF-39%20StarFighter",
  "retrievedAt": "2025-10-08T13:07:53.332Z"
}