{
  "title": "Theta Shuttle",
  "pageId": 5628,
  "revisionId": 10815,
  "wikitext": "[[File:ThetaShuttle.jpg|500px|thumb|right]]\n\n'''Theta Shuttle'''<br />'''Craft''': Cygnus Spaceworks Theta-class T-2c Personnel Transport<br />'''Affiliation''': Old Republic / Empire<br />'''Era''': Rise of the Empire<br />'''Source''': Wizards Website<br />'''Type''': Personnel shuttle<br />'''Scale''': Starfighter<br />'''Length''': 18.5 meters<br />'''Skill''': Space transports: Theta Shuttle<br />'''Crew''': 5, '''skeleton''': 1/+10<br />'''Passengers''': 16<br />'''Cargo capacity''': 50 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': Not available for sale (valued at 210,000)<br />'''Hyperdrive multiplier''': x1<br />'''Hyperdrive backup''': x15<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 4<br />'''Atmosphere''': 285; 825 kmh<br />'''Hull''': 4D<br />'''Shields''': 1D+1<br />'''Sensors''':\n*Passive: 20/0D\n*Scan: 40/1D\n*Search: 75/2D\n*Focus: 4/2D+1\n'''Weapons''':[[File:ThetaShuttle2.jpg|500px|thumb|right]]\n*2 Quadlaser Cannons\n: Fire arc: Front<br />Skill: Starship gunnery<br />Fire control: 2D (Can be set to automated computer controlled fire)<br />Space range: 1-3/12/25<br />Atmosphere range: 100-300/1.2/2.5 km<br />Damage: 6D\n*Laser Cannon\n: Fire arc: Rear<br />Skill: Starship gunnery<br />Fire control: 2D (Can be set to automated computer controlled fire)<br />Space range: 1-4/12/25<br />Atmosphere range: 100-400/1.2/2.5 km<br />Damage: 4D\n\n'''Capsule''': The Cygnus Spaceworks Theta-class T-2c shuttle was a tri-winged personnel transport craft, most often used by influential senators, officers, and courtiers to travel between planets and starships while maintaining high levels of security.\n\nThe shuttle's long wings projected powerful shielding fields, which were used for both defense and added stability in atmosphere. In flight, the lower two wings were extended to either side of the shuttle, but during landing, the wings folded up to bracket the hull and concentrate shield energy on the main body. The Theta-class transport was both fast and agile thanks to its powerful sublight engines. It also had an internal Class 1 hyperdrive.\n\nThe Theta-class shuttle could not rely on speed alone, however, while transporting important dignitaries between worlds. Thus, it was equipped with twin forward-mounted quad laser cannons and a high-powered tail gun. Both the quad and standard laser cannons could be computer-controlled or operated manually from a combined communications and gunnery station in the reinforced cockpit. Upon landing, the shuttle computer surveyed the area for potential dangers, ready to open fire at enemies in an instant. The shuttle could accommodate about five crew members, though it could be flown by a single experienced pilot.\n\nPalpatine's own T-2c was upgraded by Warthan's Wizards, the best starship technicians in the galaxy at the time. The Wizards added a hyperwave reflector for trans-galactic communication that rivaled the quality of the secret Jedi homing devices. Palpatine's shuttle also featured sensor masks to hide whatever secrets the shuttle's interior held from conventional scanners. During flight, Palpatine's shuttle was often escorted by elite V-wing starfighters that were upgraded with internal hyperdrives and improved shields.\n\nTheta-class shuttles were observed ten years after the end of the New Sith Wars and were at that time considered new. The class would go on to see service in the centuries leading up to the establishment of the Galactic Empire.\n\nOne was used by the Sith to pick up Qymaen jai Sheelal's broken body after his shuttle crash accident, right before the Clone Wars. Another was used by the Supreme Chancellor Palpatine as a personal transport when attending to off-world matters during the Clone Wars. One was also used to transport a group of Republic agents to the Venator-class Star Destroyer Solidarity, so that they could be given an assignment by Jedi Master Ezar Elasra.\n\nNot long after his declaration founding the Galactic Empire, the newly-christened Emperor Palpatine used his shuttle on a top secret mission to Mustafar. Piloted by Captain Kagi, the T-2c shuttle reached Mustafar in time for Palpatine to rescue his dying apprentice, Darth Vader, formerly Anakin Skywalker. During the return trip to Coruscant, the Emperor made use of the shuttle's onboard medical facilities to treat Darth Vader's wounds prior to a more extensive reconstruction at a medical facility. The shuttle also acted as a mobile command base, with various torture devices and Sith potions for interrogations.\n\nThough the Theta-class shuttle served the Empire and Palpatine well, it was later replaced by the more advanced Lambda-class. Even so, Theta-class shuttles were still used by the Empire as support vessels, alongside older models like the Kappa-class shuttles. Following the dissolution of the Senate, many of the senators' Theta-class shuttles were sold off and converted to freighters. Some were bought by collectors who valued the classic design or were used by the Rebel Alliance.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Theta%20Shuttle",
  "retrievedAt": "2025-10-10T19:13:57.093Z"
}