{
  "title": "TIE Phantom",
  "pageId": 2026,
  "revisionId": 11957,
  "wikitext": "[[File:TIE-Phantom1.jpg|thumb|500px]]\n[[File:TIE-Phantom2.jpg|thumb|500px]]\n\n'''TIE Phantom'''<br />'''Craft''': Sienar Fleet Systems V-38 TIE<br />'''Affiliation''': Empire<br />'''Era''': Rebellion<br />'''Type''': Strategic fighter<br />'''Scale''': Starfighter<br />'''Lenght''': 14.6 meters<br />'''Skill''': Starfighter piloting: V-38 TIE<br />'''Crew''': 1<br />'''Cargo Capacity''': 50 kilograms<br />'''Consumables''': 3 days<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': x15<br />'''Nav Computer''': Limited to 5 jumps<br />'''Maneuverability''': 3D<br />'''Space''': 11<br />'''Atmosphere''': 415; 1,000 kmh<br />'''Hull''': 2D<br />'''Shields''': 1D+2<br />'''Sensors''':\n*Passive: 40/3D\n*Scan: 80/5D\n*Search: 130/5D+2\n*Focus: 7/6D\n'''Weapons''':\n*3 Laser Cannons (fire-linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 6D\n====='''Note'''s:=====\n'''Cloaking Device''': When activated, all sensors and visual contact is lost. Additionally, starfighter is invisible to all sensors and visual scanning while cloaked.\n\n'''Self Destruct Sequence''': If a proper clearance code is not entered when ship is powered down a sequence of shaped charges are activated five minuets after power off, to keep the Phantom from falling into Rebel hands. It's damage is to internal systems only (re: no power core overload) and causes a 4D (starship scale) explosion. The ship itself cannot roll versus damage\n=====Capsule=====\nAfter the battle of Yavin and the destruction of the Death Star, the Rebels Alliance proved that they were a serious threat to the Empire. The Empire forced to take that threat seriously, responded with new technology and weapons such as the Dark Trooper project and the TIE Phantom. The TIE Phantom research, under the direction of Admiral Sarn, was conducted in the Dreighton Nebula. The Nebula, the site of a major battle in the Old Republic was rumored to be haunted and the source of ships mysteriously disappearing. This provided perfect cover for development of a top secret stealth starfighter. The TIE Phantom packs slightly above normal firepower for a starfighter of it's class.<br />However the main improvement of the ship was a cloaking device. With the stealth shield in place, short and long range delectability of the ship was almost non-existent. Should the Phantom have gone into wide production, the Empire would certainly have had the upper hand. Sigma Squadron, the first wave of these deadly TIE fighters, came within 12 hours of launch before the construction facility on Imdaar Alpha was destroyed, along with the Empire's stockpile of the ship. Admiral Sarn's command ship, the Super Star Destroyer Terror was also eliminated along with the base. The admiral was retired from active duty personally by Lord Vader. The Rebel strike team, commanded by Ru Murleen captured one of the precious vessels, but the fighter was destroyed at a rebel base due to Imperial security fail-safe measures.<br />",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/TIE%20Phantom",
  "retrievedAt": "2025-10-08T13:07:46.945Z"
}