{
  "title": "TIE/F Starfighter",
  "pageId": 2015,
  "revisionId": 11788,
  "wikitext": "[[File:TIE-F-Starfighter.jpg|thumb|500px]]\n\n'''TIE/F Starfighter'''<br />'''Craft''': Super Design Team / Raccadi Shipyards TIE/F (flat) Starfighter<br />'''Type''': Space superiority starfighter<br />'''Scale''': Starfighter<br />'''Length''': 5.9 meters<br />'''Skill''': Starfighter piloting (TIE)<br />'''Crew''': 1<br />'''Crew Skill''': Starfighter piloting 4D+1, starship gunnery 4D<br />'''Cargo Capacity''': 60 kilograms<br />'''Consumables''': 2 days<br />'''Cost''': 45,000 (new) 25,000 (used, rare)<br />'''Maneuverability''': 2D+1<br />'''Space''': 10.5<br />'''Atmosphere''': 415; 1,200 kmh<br />'''Hull''': 2D<br />'''Sensors''':\n*Passive: 15/0D\n*Scan: 30/1D\n*Search: 50/2D\n*Focus: 2/2D+1\n'''Weapons''':\n*Two Laser Cannons (fire-linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 4D\n\n'''Capsule''': After the Emperors death at Endor the Galaxy became an even more dangerous place for many civilians. Not only were remnants of the Empire fighting the Alliance, and later the new Republic, but also each other. Some of these Warlords looked to new or more advanced technology to aid them, undertaking such projects as to build the TIE Raptors, or Enforcer Picket Cruisers, others took to the field with cheaper equipment.<br />The Raccadi Shipyards purchased the design specifications of the TIE/ln as well as the license to produce fighters based on it from Sienar Fleet Systems some 4 months after Endor. To meet the demand for cheaper equipment the Super design team went to work modifying the TIE/ln. Several months later the single solar paneled fighter begun its first production run. The fighter utilizes the classic TIE cockpit, but with a single, horizontal solar panel located emerging 3/4 of the way down the cockpit, emerging from it and sweeping to the back.<br />This design reduces the power of the laser cannons as well as the sensors, but provides superior maneuvering systems and ION drive capabilities. The removal of a solar panel, as well as the connecting equipment has allowed Raccadi Shipyards to drop the price of the TIE/F well below that of the TIE/ln. It costs only 45,000 credits new. Several warlords purchased a limited number of the craft, in addition sales to planetary governments have been decent.<br />TIE/F Starfighter",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/TIE%2FF%20Starfighter",
  "retrievedAt": "2025-10-08T13:07:30.546Z"
}