{
  "title": "TL-1800 Transport",
  "pageId": 530,
  "revisionId": 10509,
  "wikitext": "[[File:TL-1800Transport.jpg|500px|thumb|right]]\n\n'''Craft''': Suwantek Systems TL-1800 Transport<br />'''Type''': Stock light freighter<br />'''Scale''': Starfighter<br />'''Length''': 30 meters<br />'''Skill''': Space transports: TL-1800 transport<br />'''Crew''': 1 to 2<br />'''Crew Skill''': Varies widely<br />'''Passengers''': 7<br />'''Cargo Capacity''': 110 metric tons<br />'''Consumables''': 3 months<br />'''Cost''': 28,000<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x10 Nav Computer: Yes<br />'''Maneuverability''': 1D+2<br />'''Space''': 4<br />'''Atmosphere''': 280; 800 KMH<br />'''Hull''': 4D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':\n*2 Laser Cannons (fire-linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5KM<br /> Damage: 5D\n\n'''Capsule''': The product of a local Outer Rim corporation, the TL-1800 was designed with modern security issues in mind; it has above-average maneuverability and shielding, and is equipped with two fire-linked laser cannons.\n\nThe wide-bodied 30 meter long ship could carry 110 tons of cargo in its internal cargo bay, but could also attach four external cargo pods to its hull, which each had an additional capacity of 100 tons. This gave the TL-1800 an exceptional cargo capacity for its size, exceeding that of significantly larger ships such as the Etti-class light transport and the YZ-775. However, these pods reduced the already sluggish freighter's limited speed and maneuverability, and only one pod could be carried during atmospheric flight.\n\nThe TL-1800 was also notable for its highly efficient Y-v-6 model sublight engines and StarBurn 4 hyperdrive, which could operate for a year or more without a major overhaul.\n\nSuwantek Systems would normally contract Fabritech or Industrial Automaton in the creation of systems such as the nav computer. With the TL-1800 Transport, Suwantek Systems instead tried to develop their own nav computer system, the Portal Delta, in order to cut costs. The Portal Delta was very glitch prone and required constant maintenance. It would shut down when activated due to an inherent design flaw unless the user could work around it. Furthermore, once shut down, it could take a number of minutes for the restart sequence to boot it back up again. Later models of this vessel contain the more reliable Fabritech units, though earlier models can still be found with the flawed Portal Delta nav computer system.\n\nTL-1800 freighters were occasionally used by the Imperial Security Bureau. One, the Gillia, was used by Daric LaRone on his escape from the Imperial Star Destroyer Reprisal.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/TL-1800%20Transport",
  "retrievedAt": "2025-10-10T19:13:53.104Z"
}