{
  "title": "Trilex Starfighter",
  "pageId": 5256,
  "revisionId": 39051,
  "wikitext": "[[File:Trilex-Starfighter.jpg|thumb|500px]]\n\n'''Trilex Fighter'''<br />'''Craft''': Nerouble works Trilex Fighter<br />'''Type''': Space superiority fighter<br />'''Scale''': Starfighter<br />'''Length''': 16 meters (long), 43 meters (wingspan)<br />'''Skill''': Starfighter piloting<br />'''Crew''': 2, skeleton1/+10<br />'''Crew Skill''': Starfighter piloting 5D, starship gunnery 5D+1<br />'''Cargo Capacity''': 30 kilograms<br />'''Consumables''': 8 days<br />'''Cost''': Not available for sale (black market300,000 credits)<br />'''Hyperdrive Multiplier''': x4<br />'''Nav Computer''': Uses R2 unit<br />'''Maneuverability''': 2D+1<br />'''Space''': 10<br />'''Atmosphere''': 415; 1,200 kmh<br />'''Hull''': 4D+1<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 15/+2\n*Scan: 35/1D+2\n*Search: 60/2D+2\n*Focus: 5/4D\n'''Weapons:'''\n*6 Laser Cannons (fire-linked)\n: Fire Arc: Front<br />Crew: 1 (co-pilot)<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere: 100-300/1.2/2.5 km<br />Damage: 7D\n*6 Light Ion Cannons (fire-linked)\n: Fire Arc: Front<br />Crew: 1 (co-pilot)<br />Skill: Starship gunnery<br />Fire Control: 3D+2<br />Space Range: 1-3/7/36<br />Atmosphere: 100-300/700/3.6 km<br />Damage: 5D+2\n*Concussion Missile Launcher\n: Fire Arc: Front<br />Crew: 1 (pilot)<br />Skill: Missile weapons<br />Fire Control: 1D<br />Space Range: 1/3/7<br />Atmosphere: 50-100/300/700<br />Damage: 7D\n\n'''Note''': If both, the Ion Cannons and Laser Cannons are fired at once, the resultant energy drain drops the fighter's maneuverability to 1D and its sublight to 6 for 2 rounds.\n\n'''Capsule''': Juh Gragg, a pirate gang leader and a very inteligent and sadistic Corellian, got sick and tired of losing his troops, shot up by X-Wings and TIE Interceptors. He also lost his brother to a pair of trips from Admiral Trava's fleet (see I, Jedi). He was looking for a good fighter which could also be used for other things, and came across a slicer who had the designs for the Trilex. Unfortunately, the slicer died in interrogation before revealing where he got the designs. The Trilex starfighter looks like an expanded TIE Fighter ball, with a gyroscopic stabalization unit around it. Three dual wings set 60 degrees apart which (like S-foils) fold out 30 degrees from where they start. One Laser Cannon and one Light Ion Cannon are mounted on each wing, and one concussion missile laucher is installed in the ball. The Trilex has a hyperdrive for emergencies, and features modest shields.\n\n'''Source:''' David \"Garhkal\" Stairs",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Trilex%20Starfighter",
  "retrievedAt": "2025-10-08T13:07:56.457Z"
}