{
  "title": "Trilon Mining Barge",
  "pageId": 5541,
  "revisionId": 10660,
  "wikitext": "[[File:TrilonMiningBarge.jpg|400px|thumb|right]]\n\n'''Trilon Mining Barge'''<br />'''Craft''': Trilon Inc. Mobile Mining Vehicle<br />'''Affiliation''': General<br />'''Era''': Rise of the Empire<br />'''Source''': Galaxy Guide 8 – Scouts (page 43)<br />'''Type''': Work ship<br />'''Scale''': Starfighter<br />'''Length''': 80 meters<br />'''Skill''': Space transports<br />'''Crew''': 3<br />'''Passengers''': 6<br />'''Cargo Capacity''': 3,000 metric tons; 1,000 cubic meters<br />'''Consumables''': 4 months<br />'''Hyperdrive Multiplier''': x4<br />'''Hyperdrive Backup''': x9<br />'''Nav Computer''': Yes<br />'''Space''': 2<br />'''Atmosphere''': 100; 400 kmh<br />'''Hull''': 3D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 100/1D\n*Scan: 200/2D\n*Search: 400/3D\n*Focus: 50/4D\n'''Weapons''':\n*Turbolaser\n: Fire Arc: Front<br />Crew: 1 (pilot or gunner)<br />Skill: Starship gunnery<br />Fire Control: 1D<br />Space Range: 3-15/35/75<br />Atmosphere Range: 300-1.5/3.5/7.5 km<br />Damage: 2D\n*Heavy Mining Laser*\n: Fire Arc: Bottom<br />Scale: Capital<br />Crew: 1 (gunner)<br />Skill: Capital ship gunnery<br />Fire Control: 0D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700<br />Damage: 3D\n\n'''Note''': While the Heavy Mining Laser was designed for strip mining on planets, it has occasionally been adapted by daring and unscrupulous scouts and pirates as a deadly ship-destroying weapon. If a pilot can “land” it on top of another vessel – or fly right above it – the laser can cut through the hull of most small ships quite easily.\n\n'''Capsule''': Mobile mining vehicles, or mining barques, were 80-meter long work ships manufactured by Trilon Inc. They carried three crew, six passengers, 3,000 metric tons (1,000 cubic meters) of cargo, and 4 months' consumables. They had a class 4 hyperdrive, a class 9 backup, a nav computer, and the ability to achieve 400 kmh in atmosphere. They were equipped with automated mining equipment, a sensor array designed to detect precious metals, shields, a forward turbolaser, and a heavy mining laser. Though the laser was intended for strip mining, it could easily penetrate a small ship's hull.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Trilon%20Mining%20Barge",
  "retrievedAt": "2025-10-10T19:13:58.891Z"
}