{
  "title": "Twin Wing",
  "pageId": 5257,
  "revisionId": 11914,
  "wikitext": "[[File:Twin-Wing.jpg|thumb|500px]]\n\n'''Twin Wing'''<br />'''Craft''': FreiTek/Slayn & Korpil B-15 Twin Wing<br />'''Type''': Assualt Bomber<br />'''Scale''': Starfighter<br />'''Length''': 13.5<br />'''Skill''': Starfighter piloting: Twin Wing Crew: 1, gunner: 1, 2 astromech droids (can coordinate)<br />'''Crew Skill''': Starfighter piloting 4D, starship gunnery 4D, starship shields 3D<br />'''Cargo Capacity''': 230 kilograms<br />'''Cost''': 275,000 (new)<br />'''Hyperdrive Multiplier''': x1<br />'''Nav Computer''': uses astromech programmed with 10 jumps<br />'''Maneuverability''': 2D+2<br />'''Space''': 7<br />'''Atmosphere''': 350; 1,000 kmh<br />'''Hull''': 4D+1<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 30/0D\n*Scan: 50/1D\n*Search: 75/2D\n*Focus: 4/4D\n'''Weapons''':\n*4 Laser Cannons (fire-linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 6D\n*4 Proton Torpedo Launchers\n: Fire Arc: Front<br />Crew: Can be fired by either the pilot or to gunner/bobadier<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700<br />Damage: 9D\n*Weapons Bay\n: Fire Arc: Front/Down<br />Crew: 1 (gunner/bombadier)<br />Skill: Starship gunnery<br />Fire Control: 4D<br />Space Range: See ordinace used<br />Atmosphere Range: See ordinace used<br />Damage: See ordinace used\n'''4 Proton Torpedo Launchers''': Fire Control given is that for the pilot. The gunner/bombadier can also operate the proton torpedo launchers at Fire Control: 4D. Also, the gunner/bombadier can target up to four targets to be hit by proton torpedos. However, he /she suffers a penalty to Fire Control when targetting more than one target. See chart below:\n\n1 target *** Fire Control: 4D *** Fire Control normal<br />2 targets *** Fire Control: 2D x 2 *** Each target requires 2D to hit<br />3 targets *** Fire Control: 2D, 1D x 2 *** Most important target 2D, other two 1D<br />4 targets *** Fire Control: 1D x 4 *** Each target requires 1D to hit\n\nAccording to the penalty chart, the gunner must split his/her Fire Control dice among the number of targets the are attempting to hit. Three targets also requires him/her to choose which target is the most important before they can begin firing proton torpedos\n\n'''Weapons Bay''': While not a unique feature found only on the Twin Wing, the fighter’s weapons bay is unique among bombers in that it can vary it’s angle of attack depending on the ordinace carried. Heavy missile weapons such as rockets and guided concussion missles are foward launced while bomb style weapons such as free fall thermal detonators may fall straight down. Space Range, Atmosphere Range, and Damage depend on the ordinace being dropped or fired. For instance, a missile weapon will have a Space Range and Atmosphere Range in addition to Damage done while a bomb style weapon merely requires Damage. See the individual data on the ordinace being fired to determine the information needed.\n\n'''Capsule''': Shortly before Grand Admiral Thrawn’s campaign against the New Republic, the New Republic’s Starfighter Command began searching for a dedicated bomber to add to their fighter fleet. A competition was opened to all ship building companies to find that bomber. But it was the joint entry by FreiTek Inc. and Slayn & Korpil, the XB-15 Twin Wing, that would win the competition.\n\nFreiTek Inc. had been founded by the Incom design team of the X-wing some time after defecting to the Alliance with the X-wing. For sometime after the introduction of the B-wing, they had been discussing with the B-wing design team at Slayn & Korpil the idea of a joint venture similar to the Incom/Subpro venture that had resulted in the Z-95 Headhunter. Yet until the NRSC competition, nothing became of these discussions.\n\nThe B-15 resembles a pair of X-wing fuselages mated to a B-wing engine pod as that’s what the design team choose for it’s appearance. However, it is what one does not easily see that really makes the B-15 what it is. The center engine pod features the powerplant for the ship, freeing up room in the two fuselages that can be used to carry cargo and weapons. The command section, located in the port fuselage, of the B-15 houses the pilot of the fighter along with the cargo carried (mostly survival gear) and all the flight controls for the fighter. Control of the lasers is routed strictly to the command section. The weapons section, the starboard fuselage, houses the gunner/bombadier and the weapons bay. The Twin Wing’s four proton torpedo launchers can be operated by either the the pilot or the gunner/bombadier, though the gunner/bombadier is able to target and fire on up to four different targets using the torpedo launchers.\n\nIn addition to pilot and gunner/bombadier, a pair of astromechs fills out the crew. Both fill the tradition role of helping to maintain the fighter while in flight, yet at the same time they each have an individual role to fill. The astromech in the port section takes care of all navigation tasks and acts as a communications officer, helping the crew to open comm channels and keep them secure. The starboard astromech assists both pilot and gunner/bombadier with all gunnery needs and assists in operating the ship’s sensors.\n\nThe B-15 program was put on hold temoparily during the events surrounding Palpatine’s return. After Palpatine’s final defeat, the program was revived and testing took place during the Sun Crusher Crisis. As soon as testing was complete, the Twin Wing began production with the first wing of B-15s arriving in time to see action during the Eye of Palpatine Crisis. During the Koornatch Crisis, Twin Wings saw action against Imperial Forces and pirates, preventing it from being used against the Yyvetha.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Twin%20Wing",
  "retrievedAt": "2025-10-08T13:07:57.364Z"
}