{
  "title": "V-Wing",
  "pageId": 1830,
  "revisionId": 11048,
  "wikitext": "[[File:V-Wing1.jpg|500px|thumb|right]]\n\n'''V-Wing'''<br />'''Craft''': Kuat Systems Engineering Alpha-3 Nimbus-class “Vwing” Starfighter<br />'''Affiliation''': Old Republic / Empire<br />'''Era''': Rise of the Empire<br />'''Source''': Wizards Website, Starships of the Galaxy - Saga Ed. (pg 150)<br />'''Type''': Starfighter<br />'''Scale''': Starfighter<br />'''Length''': 7.9 meters<br />'''Skill''': Starfighter piloting: V-wing<br />'''Crew''': 1 and astromech droid (can coordinate)<br />'''Cargo Capacity''': 60 kilograms<br />'''Consumables''': 15 hours<br />'''Cost''': 102,500 (new), 45,000 (used)<br />'''Maneuverability''': 4D+1<br />'''Space''': 8<br />'''Atmosphere''': 500; 1,450 kmh<br />'''Hull''': 2D+2<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 20/0D\n*Scan: 30/1D\n*Search: 50/2D\n*Focus: 3/3D\n'''Weapons''':[[File:V-Wing2.jpg|500px|thumb|right]]\n*2 Twin Laser Cannons\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 3D\n\n'''Capsule''': The Alpha-3 Nimbus-class V-wing starfighter, often simply known as the V-wing starfighter or Nimbus fighter, was a short-ranged starfighter deployed late in the Clone Wars by the Galactic Republic.\n\nAspects of the V-wing were later incorporated into the Imperial TIE Fighter and its variants, as well as the Rebel RZ-1 A-wing interceptor.\n\n'''Characteristics''': The Alpha-3 Nimbus-class starfighter was a sturdy, wedge-shaped starfighter similar to the Delta-7 Aethersprite-class interceptors employed by the Jedi Order. It was manufactured by Kuat Systems Engineering, the same company responsible for both the Delta-7 fighter and its successor, the Eta-2 Actis-class light interceptor.\n\nBoth the Delta-7 and the Alpha-3 models were designed by the engineer Walex Blissex, who would later co-design the Rebel Alliance's A-wing fighter with Jan Dodonna. The V-wing had wing mounted laser cannons and had a wedge shape. The V-wings also featured folding wing radiators similar to those fitted on the later Eta-2 interceptors. But when landing, the wings fold downward to form as landing gear. Nestled between each wing and the hull were two twin laser cannons, which could swivel on the vessel's wing hubs to provide a wide range of fire.\n\nAft of the starfighter's main hull were two deflector shield heat sinks, located above the two vertically stacked ion drive thrusters. These flaps also provided some protection for the V-wing's clone pilot.\n\nIn keeping with the design of the Delta-7, the Alpha-3 featured an astromech droid socket aft of the oval cockpit. V-wing pilots were often assisted by spherical Q7-series astromech droids which provided in-flight navigation and maintenance skills that would otherwise require a copilot—which the compact V-wing could not accommodate.\n\nAs the V-wing starfighter was too small to feature an integrated hyperdrive, it required a transportation into combat zones by carriers such as the Venator-class Star Destroyer. Each carried 192 V-wing fighters. V-wing fighters were also capable of using a Syluire-45 hyperspace transport ring to go long distance without a carrier vessel.\n\nThe clone troopers who flew the fighter had specially adapted helmets. These helmets, along with their flight suits, were fully sealed due to the lack of a life support system.\n\n'''History''': V-wing fighters were often unleashed from warship hangars in large swarms, and were one of the most numerous starfighters in the Republic Navy late in the Clone Wars. While they lacked the power of the ARC-170 starfighter, they made up for it in raw speed and agility. There were produced in limited numbers until 19 BBY.\n\nV-wings were speedy and evasive targets, even for the advanced droid tri-fighters used by the Confederacy of Independent Systems in the last days of the Clone Wars. Mass-produced for Loyalist forces, V-wings participated in large-scale fleet operations and assisted in the defense of Republic worlds during the Clone Wars.\n\nV-wing starfighters flew into battle alongside ARC-170s and Eta-2 interceptors during the Battle of Coruscant, fighting off droid tri-fighters, Vulture droids, and deadly buzz droids, with some even getting as far as the Separatist flagship, Invisible Hand, although many were lost to enemy flak.\n\nFollowing the end of the Clone Wars, V-wing squadrons flew under the banner of the Galactic Empire. Three V-wings, flown by elite pilots, escorted the self-appointed Emperor Palpatine's shuttle during his voyage from Coruscant to Mustafar and again on the return trip, culminating at the Emperor Palpatine Surgical Reconstruction Center. These elite V-wings were modified for hyperspace travel without booster rings and were equipped with upgraded shields.\n\nAt least two V-wings were obtained by members of the Bellassan resistance that sprang up months after Palpatine became Emperor. These V-wings harassed an Imperial ship which Darth Vader himself was on. However, the V-wings were utterly destroyed.\n\nEventually, pirate organizations, such as Black Sun and the Hutt Cartel, used V-wings after salvaging them. They were also used by the Mandalorians around the Battle of Yavin during a skirmish with the Zann Consortium.",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/V-Wing",
  "retrievedAt": "2025-10-08T13:07:58.940Z"
}