{
  "title": "VCX-350 Freighter",
  "pageId": 5421,
  "revisionId": 10512,
  "wikitext": "[[File:VCX-350Freighter.jpg|500px|thumb|right]]\n\n'''VCX-350 Freighter'''<br />'''Craft''': Corellian Engineering Corporation VCX-350 Light Freighter<br />'''Affiliation''': General<br />'''Era''': New Republic<br />'''Source''': Star Wars Gamer Issue 2<br />'''Type''': Light freighter<br />'''Scale''': Starfighter<br />'''Length''': 31 meters<br />'''Skill''': Space transports: VCX-350<br />'''Crew''': 2, '''gunners''': 1<br />'''Crew Skill''': Varies<br />'''Passengers''': 8<br />'''Cargo Capacity''': 250 metric tons<br />'''Consumables''': 6 months<br />'''Cost''': 300,000 (new), 175,000 (used)<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': x11<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D+1<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 kmh<br />'''Hull''': 5D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':\n*2 Laser Cannons (fire-linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 5D+1\n\n'''Capsule''':<br />\nThe VCX-350 light freighter was a Corellian Engineering Corporation starship in the VCX series introduced to the starship market during the transition of power from the Galactic Empire to the New Republic. Benefiting from the New Republic's less-intrusive policies toward independent companies, CEC was able to create a more powerful freighter; the end result combined lavish staterooms, a large cargo hold, and heightened performance. Despite the higher prices, the ship garnered much popularity among trading companies and smuggler convoys; Talon Karrde used the VCX-350 in his own fleet. Pirates would also exclusively target the ship due to its demand. This popularity put the ship into direct competition with the older YT series as the best known CEC design. \n\nThe VCX-350 light freighter was the first of Corellian Engineering Corporation's VCX line, designed exclusively after the fall of the Galactic Empire. Because of the relaxed atmosphere business-wise under the New Republic, the ships of the VCX line, including the VCX-350, were designed and built with heavier, almost military-grade shield generators, weapons, and engines.\n\nThe freighter's 31-meter long double-decked frame contained a sizable cargo bay capable of holding up to 250 metric tons, which occupied the lower of the two levels, and amenities for the crew and any passengers, located on the upper deck. The crew and passenger accommodations were designed with comfort in mind, as each room was a small stateroom, instead of the usual bunks. Three large engines sat in the rearmost portion of the craft. These provided a high top speed. A class 1.0 hyperdrive allowed the ship to move from system to system quickly, and a class 11 backed the other up in case of malfunction.. The stock ship was armed with only a single set of laser cannons mounted above the ship. However, due to the relaxed environment, these cannons were far more powerful than the standard armament for a freighter, offering additional protection. VCX-350 freighters were also extremely modular, continuing CEC's typical designs. Dozens of standardized variations were already in place within a few years of the VCX-350's introduction.\n\nAll of this came at a price; a new ship cost around 300,000 credits. As such, independent traders typically were unable to purchase the starship. However, trading corporations and small companies were purchasing the freighters at such a rate that the demand outstripped the supply. Pirate groups also began exclusively targeting convoys of the freighters, to hijack them, dump their cargoes, and escape into hyperspace, all due to the ship's popularity.\n\n'''History'''<br />\nThe VCX series was created around 5 ABY, after the fall of the Galactic Empire and the rise of the New Republic. Because of this power shift and the New Republic's tendencies for a less strict control over independent companies, Corellian Engineering Corporation was able to create the VCX line into a more powerful and better equipped freighter than was allowed under Imperial control.\n\nThe VCX-350 design itself was created to fulfill the role of a workhorse in any freighting role. While most individual freighter captains could not afford the 300,000 credits to buy a new one, or even the 175,000 credit price tag of a used model, trading companies, both large and small, could—and did—pick up many of the VCX-350 freighters. In fact, the supply often paled in comparison for the demand for the ship. The amount of cargo space, as well as the advanced specifications the ship held, were not the only draws the ship had. The staterooms made standard on the stock ship made for a comfortable journey to and from a location, and the ship often became a personal shuttle.\n\nThese ships would even challenge the YT series, and the YT-1300 in particular, on being the best known CEC design. This was due to just how popular and common they had become only a while after their inception.[1] Most every smuggler fleet contained at least one of these ships in their fleet. Talon Karrde's own fleet also contained the VCX-350 freighter.[2] This popularity had a price. Bands of pirates would often exclusively target convoys of VCX-350 freighters, not for the cargo they may have contained, but instead for the ship itself. Even with this added complication, the ship continued to sell.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/VCX-350%20Freighter",
  "retrievedAt": "2025-10-10T19:14:01.379Z"
}