{
  "title": "VT-49 Decimator",
  "pageId": 5666,
  "revisionId": 11195,
  "wikitext": "[[File:VT49Decimator.jpg|500px|thumb|right]]\n\n[[File:VT49Decimator2.jpg|500px|thumb|right]]\n\n'''VT-49 Decimator'''<br />'''Craft''': Sienar Fleet Systems VT-49 Decimator Assault Ship<br />'''Affiliation''': Empire<br />'''Era''': Rebellion<br />'''Type''': Assault ship<br />'''Scale''': Starfighter<br />'''Length''': 40 meters<br />'''Skill''': Space transports: VT-49 Decimator<br />'''Crew''': 3, '''gunners''': 5, '''skeleton''': 2/+10<br />'''Crew Skill''': Varies<br />'''Passengers''': 20 (troops)<br />'''Cargo Capacity''': 2 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': 1,610,000 (including modification costs)<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x12<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D+1<br />'''Space''': 5<br />'''Atmosphere''': 295; 850 kmh<br />'''Hull''': 5D+1<br />'''Shields''': 3D<br />'''Sensors''':\n*Passive: 15/+2\n*Scan: 35/1D\n*Search: 60/3D\n*Focus: 5/4D\n'''Weapons''':\n*2 Quad Laser Cannons\n: Fire Arc: Turret<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 1D+2<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 5D\n*3 Concussion Missile Launchers\n: Fire Arc: Turret<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 50-100/300/700<br />Damage: 8D\n\n'''Capsule''': The VT49 Decimator is most correctly classified as an Assault ship. It is heavily armed and armored, and built to carry light to medium loads into dangerous places. Its form follows its function, and its shape offers a relatively small target with no large fins or wings as seen in some of the less combat-oriented craft of the Empire, such as the Lambda-class shuttle. Armor and deflector shielding is particularly heavy, and the weapons load-out is fearsome and includes turrets capable of engaging any target fast enough to out-maneuver the VT49.\n\nAs a ship built to out-fight anything it can outrun, and outrun anything it can't outfight, the Empire uses the Decimator as a multi-role craft and will outfit it to suit the current need. Decimators make simple supply runs to listening outposts in dangerous areas like asteroid belts, perform long-range reconnaissance, serve as temporary listening posts themselves, or act as picket ships at the perimeter of an Imperial fleet. They are also called upon to use their weaponry to carve a path through enemy defenses and insert shock troops and raiding parties, or destroy their targets outright. A more recent duty that has fallen into favor sees Decimators being used more and more as long-duration medium patrol vessels. Also, being easier to hide than a frigate or Star Destroyer, Decimators have been used to set up ambushes in areas believed frequented by Rebel shipping; their cargo space being used to store food for the crew and ammunition ranging from missiles to torpedoes to mines.\n\nCommand of a VT49 is a coveted position and point of pride among the middle ranks of the Imperial Navy. It is a lightly-crewed combat vessel for their Captains to command without a higher ranking officer standing behind them constantly. Also, earning a reputation as a skilled VT49 Captain is seen as a jumping-off point to service on the larger ships of the Imperial Navy. The line officers of the Imperial Navy generally look down on the rank and file troops not stationed on capitol ships, but that hasn't stopped the rumor from propagating.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/VT-49%20Decimator",
  "retrievedAt": "2025-10-10T19:14:04.374Z"
}