{
  "title": "Wayfarer Medium Transport",
  "pageId": 5424,
  "revisionId": 10523,
  "wikitext": "[[File:WayfarerMediumTransport.jpg|500px|thumb|right]]\n\n'''Wayfarer Medium Transport'''<br />'''Craft''': Kuat Systems Engineering Wayfarer-class Medium Transport<br />'''Affiliation''': General<br />'''Era''': Old Republic<br />'''Source''': Polyhedron Issue 157<br />'''Type''': Space transports<br />'''Scale''': Starfighter<br />'''Length''': 82 meters<br />'''Skill''': Space transports: Wayfarer<br />'''Crew''': 8, '''gunners''': 2, '''skeleton''': 2/+5<br />'''Crew Skill''': All appropriate skills at 4D<br />'''Passengers''': 6<br />'''Cargo Capacity''': 220 metric tons<br />'''Consumables''': 3 months<br />'''Cost''': 202,500 (new), 130,000 (used)<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x14<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 5<br />'''Atmosphere''': 295; 850 kmh<br />'''Hull''': 5D+1<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 20/0D\n*Scan: 40/1D\n*Search: 50/2D\n*Focus: 3/3D\n'''Weapons''':[[File:WayfarerMediumTransport2.jpg|500px|thumb|right]]\n*Laser Cannon\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 1D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 4D\n*Quad Laser Cannon\n: Fire Arc: Left<br />Skill: Starship gunnery<br />Fire Control: 1D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 6D\n\n'''Capsule''': The Wayfarer-class was designed with a detachable portside section originally intended for modular reconfiguration, allowing it to load a passenger section, a hangar bay, or cargo module into an armature extending from the starboard section. Production costs forced Kuat Systems Engineering to scale back their plans and create only the hangar bay module, which served as cargo space for most owners, who generally did not carry or store starfighters. A few prototypes and custom builds of other modules existed, but were hard to find, limited primarily to bulk commerce corporate shipping operations centered on well-developed metropolitan planets like Coruscant. \n\nThe versatility offered by the detachable module was initially exciting, until it was revealed that the armature could not accept standard cargo containers. This, combined with a high price tag, ensured the demise of the Wayfarer-class’s production. Despite the flaws that kept the Wayfarer from becoming a huge commercial success, the ship’s versatility made it a well-rounded vessel. It was popular with smugglers who could dump the cargo pod if they needed to avoid customs inspectors. It was also used by Rebel forces as an assault shuttle.\n\nA modified version of this ship was owned by Trandoshan Bounty Hunter Trossk.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Wayfarer%20Medium%20Transport",
  "retrievedAt": "2025-10-10T19:14:13.195Z"
}