{
  "title": "X-Wing Starfighters",
  "pageId": 1831,
  "revisionId": 47750,
  "wikitext": "='''X-Wing'''=\n\nIn war, there inevitably comes a weapon backed by doctrine that changes the very nature of how war is waged. During the bitter days of the Rebellion and through to its most desperate yet hope-filled hour at Endor, the T-65 Incom X-wing starfighter earned its place in history as one such weapon. It was the first Rebel fighter capable of outperforming the lethal TIE/In starfighter. It proved to be too fast and maneuverable to be brought down by turbolasers, and it preyed on the massive capital ships of the Imperial Navy. The X-wing was able to engage escort ships and was equipped with a hyperdrive for a sudden attack and quick withdrawal from the battlefield. The pilot of an X-wing destroyed both of the Emperors fearsome Death Stars.\n\n==T-65A X-Wing==\n[[File:xwingstarfighter.jpg|500px|thumb|right]]\n\n'''Name''': X-Wing<br />'''Craft''': Incom T-65A X-Wing<br />'''Affiliation''': Rebel Alliance<br />'''Type''': Space Superiority Fighter<br />'''Scale''': Starfighter<br />'''Length''': 12.5 meters<br />'''Skill''': Starfighter Pilot: X-Wing<br />'''Crew''': 1 and Astromech Droid (can coordinate)<br />'''Crew Skill''': Starfighter Pilot: 5D; Starship Gunnery: 4D+2; Starship Shields: 3D<br />'''Cargo Capacity''': 110 kg<br />'''Consumables''': 1 week<br />'''Cost''': 180,000 (new as prototype), 1,000,000 (used - due to collector value)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': No (uses Astromech Droid programmed with up to 10 jumps)<br />'''Maneuverability''': 3D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 km/h<br />'''Hull''': 4D<br />'''Shields''': 1D<br />'''Sensors'''\n*Passive: 25 / 0D\n*Scan: 50 / 1D\n*Search: 75 / 2D\n*Focus: 3 / 4D\n'''Weapons'''\n*'''4 Laser Cannons''' (sets of 2 fire linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1,200/2,500m<br />Damage: 5D\n*'''Proton Torpedo Launcher'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 1D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700m<br />Ammo: 3 torpedoes<br />Damage: 9D\n\n'''Description''': The Incom T-65 X-wing starfighter was the primary all-purpose starfighter of the Rebel Alliance and its successor governments. Known for its versatility and exceptional combat performance, it was a favorite with Rebel and New Republic pilots. Possessing deflector shields, a hyperdrive, an R2 astromech for repairs and navigation, and a complement of proton torpedoes, the X-wing allowed the Rebellion to launch raids in Imperial space with improved odds of a successful mission.\n\nThe X-wing played a major role in the Galactic Civil War following its capture on Fresia and the defection of its designers to the Alliance. It was most heralded as the fighter that destroyed the Death Star at the hands of Luke Skywalker. Later in the war, it would form the backbone of the Alliance Starfighter Corps, defending Alliance ships and leading attacks on Imperial vessels and installations. Most importantly, it could perform on near equal terms with the Empire's high-performance TIE fighters when handled by an experienced pilot.\n\nPilots of Rogue Squadron favored using the multi-role X-wing fighter, flying it as often as they could on most missions; they only employed other craft for highly specialized missions, such as missions that required ion cannons. The X-wing was so predominantly flown by Rebel and New Republic forces that it became a symbol of their faction, much like the TIE fighter and Star Destroyer were symbols of the Galactic Empire.\n\nThanks to continued upgrades to the basic design and improved tactics, the X-wing series remained one of the galaxy's predominant multi-role starfighters for over 40 years.\n\n'''Source''':\n*Netguide to the T-65 X-Wing (page 1)\n*[http://starwars.wikia.com/wiki/T-65_X-wing_starfighter Wookieepedia: T-65 X-wing starfighter]\n\n==T-65B X-Wing==\n[[File:X-Wing-Starfighters3.jpg|thumb|500px|right]]\n\n'''Name''': X-Wing<br />'''Craft''': Incom T-65B X-Wing Starfighter<br />'''Affiliation''': Rebel Alliance<br />'''Type''': Space Superiority Fighter<br />'''Scale''': Starfighter<br />'''Length''': 12.5 meters<br />'''Skill''': Starfighter Pilot<br />'''Crew''': 1 and Astromech Droid (can coordinate)<br />'''Crew Skill''': Starfighter Pilot: 5D; Starship Gunnery: 4D+2; Starship Shields: 3D<br />'''Cargo Capacity''': 110 kg<br />'''Consumables''': 1 week<br />'''Cost''': 150,000 (new)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': No (uses Astromech Droid programmed with up to 10 jumps)<br />'''Maneuverability''': 3D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 km/h<br />'''Hull''': 4D<br />'''Shields''': 1D<br />'''Sensors'''\n*Passive: 25 / 0D\n*Scan: 50 / 1D\n*Search: 75 / 2D\n*Focus: 3 / 4D\n'''Weapons'''\n*'''4 Laser Cannons''' (fire-linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1,200/2,500m<br />Damage: 6D\n*'''2 Proton Torpedo Launchers'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700m<br />Ammo: 3 per launcher<br />Damage: 9D\n\n'''Description''': The T-65B was the workhorse of the Rebel Alliance X-wing fleet. A substantial improvement over the A model led to the T-65B’s dominance of the space arena. Luke Skywalker and Wedge Antilles both flew T-65Bs into combat against the first Death Star. The T-65B achieved a kill ratio of 3.27 to 1 against TIE/Ins up to the Battle of Hoth. Commander Wedge Antilles noted this was a reflection both on the skill of the pilots that flew it in combat and the ships were tough and agile enough to bring the pilot safely back to base even when outnumbered.\n\nIn its later days, upgraded T-65C-A models were swiftly replacing the T-65B. With a waning defense budget, Starfighter Command was reluctant to mothball T-65Bs, but its performance parameters made it undesirable as a training ship. Instead, the remaining T-65Bs were slated for conversion over to reconnaissance to replace the obsolete Y-wings fulfilling that crucial military task. The T-65BR rose to the challenge during the Black Fleet Crisis.\n\n'''Source''':\n*Core Rulebook (page 249)\n*Rebel Alliance Sourcebook (pages 86-87)\n*Star Wars Trilogy Sourcebook SE (pages 120-122)\n*The Star Wars Sourcebook (pages 19-25)\n*Galaxy Guide 1 – A New Hope (page 68)\n*Heir to the Empire Sourcebook (pages 137-138)\n*Dark Empire Sourcebook (page 106)\n*The Thrawn Trilogy Sourcebook (pages 227, 229)\n*The Essential Guide to Vehicles and Vessels (pages 196-197)\n*[http://starwars.wikia.com/wiki/T-65B_X-wing_starfighter/Legends Wookieepedia: T-65B X-wing starfighter (Legends)]\n\n==T-65BR X-Wing \"Recon\"==\n[[File:T-65BR.jpg|500px|thumb|right]]\n\n'''Name''': X-Wing<br />'''Craft''': Incom T-65BR X-Wing Reconnaissance Starfighter<br />'''Affiliation''': New Republic<br />'''Type''': Reconnaissance Fighter<br />'''Scale''': Starfighter<br />'''Length''': 12.5 meters<br />'''Skill''': Starfighter Pilot<br />'''Crew''': 1 and astromech droid (can coordinate)<br />'''Crew Skill''': Starfighter Piloting 4D+2, Starship Gunnery 4D+2, Starship Shields 3D, Sensors 4D+2<br />'''Cargo Capacity''': 110 kg<br />'''Consumables''': 1 week<br />'''Cost''': 150,000 (new), 95,000 (used)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': No (uses Astromech Droid programmed with up to 10 jumps)<br />'''Maneuverability''': 3D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 km/h<br />'''Hull''': 4D<br />'''Shields''': 1D<br />'''Sensors'''\n*Passive: 50 / 1D\n*Scan: 75 / 2D\n*Search: 100 / 3D\n*Focus: 5 / 4D\n'''Weapons'''\n*'''4 Laser Cannons''' (fire-linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1,200/2,500m<br />Damage: 6D\n*'''Self Destruct'''\n: Scale: starfighter<br />Space Range: 1<br />Atmosphere Range: 100m<br />Damage: 10D\n\n'''Description''': The T-65BR X-wing reconnaissance starfighter, commonly called the Recon-X or Snoopscoot, was a variant of the Incom T-65 X-wing starfighter modified for reconnaissance missions. \n\nA vast improvement over the aged and slow Longprobe Y-wings, the T-65BR featured an advanced, high-gain, long-range sensor package with high-speed hypertransceivers in place of the standard X-wing's proton torpedo launchers. Sensor packages were mounted on probes that were launched from the craft and tethered to it by cables. Six additional reconnaissance imaging systems were contained within the starfighter's nose. The sensor suites were coordinated by the on-board R2-R-series astromech droid to provide maximum efficiency, a requirement when jumping into potentially dangerous zones. The astromech droid was of eminent importance in guiding the Recon-X through its scouting runs and collecting data, and some New Republic pilots facetiously noted that the pilot was only there to provide company to the astromech. During reconnaissance runs, when enemy ships were detected, the astromech would begin automatically updating the pilot on their various classifications.\n\nThe Recon-X was also equipped with a HoloNet communicator, or alternatively, a hypercomm data relay that enabled it to relay its findings instantaneously to allied command centers. The hypercomm transmitters were intimately linked with the Recon-X's hyperdrive system — they were programmed to immediately begin transmitting the fighter's collected reconnaissance data immediately upon realspace reversion in the target area.\n\nThe Recon-X used updated engines and etheric rudder prototypes to eliminate the need for thrusters. In the event that a Recon-X was captured, the fighter was equipped with several distinct countermeasures. The pilot carried a purge stick that, if inserted into the cockpit's control panel, triggered a purge charge that would erase the fighter's onboard data and also destroy the R2-R astromech unit with an explosion. Once the purge charge was initiated, a second fail-safe was now accessible within the purge stick: a suicide needle, that once jabbed into the pilot's palm would swiftly kill the pilot. There was also a pressure-loaded \"dead man's\" spring plate mechanism that would self-destruct the Recon-X fighter with baradium charge once the pilot was killed. The self-destruct explosion was of considerable force, capable of crippling a Yevethan corvette.\n\nA Recon-X lacked weaponry other than its laser cannons, as the space and energy was used for its sensor package. Some even had the laser cannons removed as the energy output of the cannons interfered with the advanced sensors. Nonetheless, the Recon-X had the smallest rear blind spot of any New Republic fighter.\n\n'''Source''':\n*Cracken’s Threat Dossier (page 82)\n*[http://starwars.wikia.com/wiki/T-65BR_X-wing_reconnaissance_starfighter Wookieepedia: T-65BR X-wing reconnaissance starfighter]\n\n==T-65C-A2 X-Wing==\n[[File:X-Wing-Starfighters1.jpg|thumb|500px|right]]\n\n'''Name''': X-Wing<br />'''Craft''': Incom T-65C-A2 X-Wing<br />'''Affiliation''': Rebel Alliance<br />'''Type''': Space Superiority Fighter<br />'''Scale''': Starfighter<br />'''Length''': 12.5 meters<br />'''Skill''': Starfighter Pilot: X-Wing<br />'''Crew''': 1 and Astromech Droid (can coordinate)<br />'''Crew Skill''': Starfighter Pilot: 5D; Starship Gunnery: 4D+2; Starship Shields: 3D<br />'''Cargo Capacity''': 110 kg<br />'''Consumables''': 1 week<br />'''Cost''': 180,000 (new), 70,000 (used)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': No (uses Astromech Droid programmed with up to 10 jumps)<br />'''Maneuverability''': 3D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 km/h<br />'''Hull''': 4D<br />'''Shields''': 1D+1<br />'''Sensors'''\n*Passive: 25 / 0D\n*Scan: 50 / 1D\n*Search: 75 / 2D\n*Focus: 3 / 4D\n'''Weapons'''\n*'''4 Laser Cannons''' (fire linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1,200/2,500m<br />Damage: 6D\n*'''2 Proton Torpedo Launchers'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700m<br />Ammo: 3 torpedoes per launcher<br />Damage: 9D\n\n'''Description''': The T-65C-A2 X-wing starfighter was a starfighter used by the Alliance to Restore the Republic during the Galactic Civil War. It was a variant of the T-65 X-wing starfighter. Both this model and the T-65B were the primary X-wings of the Rebellion. However, the C-A2 model was rare due to the T-65's difficult construction. New X-wings were always a rare sight during the Galactic Civil War. It is seen in use after the Battle of Hoth, although it may have seen combat earlier.\n\n'''Source''':\n*Netguide to the T-65 X-Wing (page 3)\n*[http://starwars.wikia.com/wiki/T-65C-A2_X-wing_starfighter Wookieepedia: T-65C-A2 X-wing starfighter]\n\n==T-65C-A3 X-Wing==\n[[File:X-Wing-Starfighters2.jpg|thumb|500px|right]]\n\n'''Name''': X-Wing<br />'''Craft''': Incom T-65C-A3 X-Wing<br />'''Affiliation''': New Republic<br />'''Type''': Space Superiority Fighter<br />'''Scale''': Starfighter<br />'''Length''': 12.5 meters<br />'''Skill''': Starfighter Pilot: X-Wing<br />'''Crew''': 1 and Astromech Droid (can coordinate)<br />'''Crew Skill''': Starfighter Pilot: 5D; Starship Gunnery: 4D+2; Starship Shields: 3D<br />'''Cargo Capacity''': 110 kg<br />'''Consumables''': 1 week<br />'''Cost''': 180,000 (new), 100,000 *used)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': No (uses Astromech Droid programmed with up to 10 jumps)<br />'''Maneuverability''': 3D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 km/h<br />'''Hull''': 4D+2<br />'''Shields''': 1D+1<br />'''Sensors'''\n*Passive: 25 / 0D\n*Scan: 50 / 1D\n*Search: 75 / 2D\n*Focus: 3 / 4D\n'''Weapons'''\n*'''4 Laser Cannons''' (fire linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1,200/2,500m<br />Damage: 6D\n*'''2 Proton Torpedo Launchers'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: tarship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700m<br />Ammo: 3 torpedoes per launcher<br />Damage: 9D\n\n'''Description''': The T-65C-A3 served the Republic during the bitter days of Grand Admiral Thrawn’s lightning offensive that nearly brought down the fledgling New Republic. Like its predecessors, the C-A3 proved itself in combat. The most significant design change from the C-A2 model was a reinforced hull and a new armor plate derived from alloying durasteel with ceramics. Production on the T-65C-A3 was stopped just after the Black Fleet Crisis.\n\n'''Source''':\n*Netguide to the T-65 X-Wing (pages 3-4)\n\n==T-65D-A1 X-Wing==\n\n'''Name''': X-Wing<br />'''Craft''': Incom T-65D-A1 X-Wing<br />'''Affiliation''': New Republic<br />'''Type''': Space Superiority Fighter<br />'''Scale''': Starfighter<br />'''Length''': 12.5 meters<br />'''Skill''': Starfighter Pilot: X-Wing<br />'''Crew''': 1<br />'''Crew Skill''': Starfighter Pilot: 5D; Starship Gunnery: 4D+2; Starship Shields: 3D<br />'''Cargo Capacity''': 110 kg<br />'''Consumables''': 1 week<br />'''Cost''': 200,000 (new)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': Yes; programmed with up to 10 jumps<br />'''Maneuverability''': 3D+2<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 km/h<br />'''Hull''': 4D+2<br />'''Shields''': 1D+1<br />'''Sensors'''\n*Passive: 30 / 0D\n*Scan: 60 / 1D\n*Search: 90 / 2D\n*Focus: 4 / 4D+2\n'''Weapons'''\n*'''4 Laser Cannons''' (fire linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D+2<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1,200/2,500m<br />Damage: 6D\n*'''2 Proton Torpedo Launchers'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: tarship gunnery<br />Fire Control: 4D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700m<br />Ammo: 3 torpedoes per launcher<br />Damage: 9D\n\n'''Description''': This version of the Incom X-wing starfighter was introduced about seventeen years after the Battle of Endor. This X-Wing replaced the astromech R2 unit with additional computer power, providing more maneuverability and increased in-flight options for the pilot. The New Republic began replacing its old, aging T-65As with the T-65D-A1, until Cole Fardreamer discovered that their new shipboard computers were rigged with Imperial detonation devices. The computers had been built under the direction of Dolph, who planned to detonate them from Almania at a specified time. Cole found the detonators while repairing Luke Skywalker's old X-wing, which was being refitted with the new computers. He showed the detonators to Wedge Antilles, who had originally ordered the newer X-wings to replace the old ones. Wedge began recalling the newer ships before they could explode, and new computer systems were ordered to replace the rigged ones.\n\nThe T-65D-A1 was an updated version of the T-65 X-wing starfighter. This new model was equipped with an improved computer system that did not require the use of an astromech droid. As a consequence, the starfighter was not outfitted with a droid socket. The pilot had access to the computer from the cockpit which gave him the possibility to customize the fighter's systems in combat situations and during flights.\n\n'''Source''':\n*Netguide to the T-65 X-Wing (page 4)\n*[http://starwars.wikia.com/wiki/T-65D-A1_X-wing_starfighter Wookieepedia: T-65D-A1 X-wing starfighter]\n\n==T-65T X-Wing \"Tandem\"==\n[[File:T-65T.jpg|500px|thumb|right]]\n\n'''T-65T X-Wing (Tandem)'''<br />'''Craft''': Incom T-65T X-wing (Tandem)<br />'''Type''': Space superiority fighter<br />'''Scale''': Starfighter<br />'''Length''': 12.5 meters<br />'''Skill''': Starfighter piloting: X-wing<br />'''Crew''': 2 (pilot and co-pilot) and astromech droid (can coordinate)<br />'''Crew Skill''': Starfighter piloting 5D, starship gunnery 4D+2, starship shields 3D<br />'''Cargo Capacity''': 110 kilograms<br />'''Consumables''': 1 week<br />'''Cost''': 150,000 (new)<br />'''Hyperdrive Multiplier''': x1<br />'''Nav Computer''': Uses astromech droid programmed with 10 jumps<br />'''Maneuverability''': 3D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1,050 kmh<br />'''Hull''': 4D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 25/0D\n*Scan: 50/1D\n*Search: 75/2D\n*Focus: 3/4D\nWeapons:\n*'''4 Laser Cannons''' (fire-linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 3D<br />Space flange: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 6D\n*'''2 Proton Torpedo Launchers'''\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700<br />Damage: 9D\n\n'''Capsule''': The tandem X-wing starfighter was an enlarged two-seat version of Incom's more common T-65 X-wing.\n\n'''Characteristics''': In addition to its larger hull and expanded cockpit, it mounted seven sublight engines compared to the standard X-wing's four. It mounted the same armament as the standard X-wing, but probably had an expanded proton torpedo capacity.\n\n'''History''': A tandem X-wing was piloted by Tav Kennede when he flew to Xo in 11 ABY to rescue Kir Kanos and Mirith Sinn from the Zanibar.\n\nThe same fighter was flown soon afterward by Kennede and Sinn as part of a New Republic assault against Grappa the Hutt's fortress on Genon.\n\nThe tandem X-wing model does not appear to have seen widespread use.\n\n==T-65AC4 X-Wing==\n\n'''Name''': X-Wing<br />'''Craft''': Incom T-65AC4 X-Wing<br />'''Affiliation''': New Republic<br />'''Type''': Space Superiority Fighter<br />'''Scale''': Starfighter<br />'''Length''': 12.5 meters<br />'''Skill''': Starfighter Pilot: X-Wing<br />'''Crew''': 1<br />'''Crew Skill''': Starfighter Pilot 4D+1, Starship Gunnery 4D+2, Starship Shields 3D<br />'''Cargo Capacity''': 150 kg<br />'''Consumables''': 1 week<br />'''Cost''': 200,000 (new)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': No (uses Astromech Droid programmed with up to 10 jumps)<br />'''Maneuverability''': 3D+2<br />'''Space''': 12<br />'''Atmosphere''': 450; 1,300 km/h<br />'''Hull''': 4D<br />'''Shields''': 1D+2<br />'''Sensors'''\n*Passive: 30 / 0D\n*Scan: 60 / 1D\n*Search: 85 / 2D\n*Focus: 4 / 4D\n'''Weapons'''\n*'''4 Laser Cannons''' (fire linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D+2<br />Space Range: 1-4/15/27<br />Atmosphere Range: 100-400/1,500/2,700m<br />Damage: 6D+2\n*'''2 Proton Torpedo Launchers'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 2D+1<br />Space Range: 1/4/8<br />Atmosphere Range: 30-100/400/800m<br />Ammo: 4 torpedoes per laucnher<br />Damage: 9D\n\n'''Description''': The T-65AC4 X-wing boasted many improvements over earlier models. It was much faster than the older T-65, with a sublight speed comparable to that of the RZ-1 A-wing interceptor. It was also capable of withstanding and causing significant damage, much more so than previous designs. It was equipped with heavy laser cannons and more advanced proton torpedoes as well as an increased torpedo complement of eight compared to the six carried by older models. The T-65AC4 was also easier to fly thanks to a new cockpit layout and improved flight capabilities.\n\n'''Source''':\n*The Jedi Academy Sourcebook (page 125)\n*Starships of the Galaxy (page 74)\n*[http://starwars.wikia.com/wiki/T-65AC4_X-wing_starfighter Wookieepedia: T-65AC4 X-wing starfighter]\n\n==T-65A3 X-Wing==\n\n'''Name''': X-Wing<br />'''Craft''': Incom T-65A3 X-Wing<br />'''Affiliation''': New Republic<br />'''Type''': Space Superiority Fighter<br />'''Scale''': Starfighter<br />'''Length''': 12.5 meters<br />'''Skill''': Starfighter Pilot: X-Wing<br />'''Crew''': 1 and Astromech Droid (can coordinate)<br />'''Crew Skill''': Starfighter Pilot: 5D; Starship Gunnery: 4D+2; Starship Shields: 3D<br />'''Cargo Capacity''': 110 kg<br />'''Consumables''': 1 week<br />'''Cost''': 220,000 (new), 180,000 (used)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': No (uses Astromech Droid programmed with up to 10 jumps)<br />'''Maneuverability''': 3D+2<br />'''Space''': 11<br />'''Atmosphere''': 435; 1,250 km/h<br />'''Hull''': 4D+2<br />'''Shields''': 2D<br />'''Sensors'''\n*Passive: 30 / 0D\n*Scan: 60 / 1D\n*Search: 90 / 2D\n*Focus: 4 / 4D+2\n'''Weapons'''\n*'''4 Laser Cannons''' (fire linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D+2<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1,200/2,500m<br />Damage: 7D\n*'''2 Proton Torpedo Launchers'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700m<br />Ammo: 4 heavy proton torpedoes per launcher<br />Damage: 10D\n\n'''Description''': The T-65A3 served the Republic even as it was being replaced by the XJ-Class X-wing. The starfighter made a name for itself among pirate crews that flew against it before the Yuuzhan Vong invasion demanded the full-scale production of the XJ-class. The A3 was noted for its improved shields and lasers over earlier models of the T-65.\n\n'''Source''':\n*Netguide to the T-65 X-Wing (pages 5-6)\n*[http://starwars.wikia.com/wiki/T-65A3_X-wing_starfighter Wookieepedia: T-65A3 X-wing starfighter]\n\n==T-65XJ X-Wing==\n[[File:T-65XJ.jpg|500px|thumb|right]]\n\n'''Name''': X-Wing<br />'''Craft''': Incom T65XJ X-Wing<br />'''Affiliation''': New Republic<br />'''Type''': Space Superiority Fighter<br />'''Scale''': Starfighter<br />'''Length''': 12.5 meters<br />'''Skill''': Starfighter Pilot: X-Wing<br />'''Crew''': 1 and Astromech Droid (can coordinate)<br />'''Crew Skill''': Starfighter Pilot: 5D; Starship Gunnery: 4D+2; Starship Shields: 3D<br />'''Cargo Capacity''': 25 kg<br />'''Consumables''': 3 days<br />'''Cost''': 140,000 (new), 125,000 (used)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': No (uses Astromech Droid programmed with up to 10 jumps)<br />'''Maneuverability''': 3D<br />'''Space''': 13\n<br />'''Atmosphere''': 470; 1,350 km/h <br />'''Hull''': 4D+2<br />'''Shields''': 1D+2<br />'''Sensors'''\n*Passive: 30 / 0D\n*Scan: 60 / 1D\n*Search: 90 / 2D\n*Focus: 4 / 4D\n'''Weapons'''\n*'''4 Heavy Laser Cannons''' (fire-linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1,200/2,500m<br />Damage: 7D\n*'''3 Proton Torpedo Launchers'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 100/300/700m<br />Ammo: 3 torpedoes per launcher<br />Damage: 9D\n\n'''Description''': The XJ series boasted increased shield capacity, better maneuverability, and a higher sublight acceleration. The starfighter's weapons carried an increased charge and better targeting computers, making the craft a formidable enemy of the foes of the New Republic. Additionally, a third proton torpedo launcher was added to up the fighter's payload to 9 torpedoes total.\n\n'''Source''':\n*Power of the Jedi Sourcebook (page 59)\n*[http://starwars.wikia.com/wiki/T-65XJ_X-wing_starfighter Wookieepedia: T-65XJ X-wing starfighter]\n*thedemonapostle (D20 to D6 conversion)\n\n==T-65XJ3 X-Wing==\n[[File:T-65XJ3 X-Wing.jpg|500px|thumb|right]]\n\n'''Name''': X-Wing<br />'''Craft''': Incom T65XJ3 X-Wing<br />'''Affiliation''': New Republic / Jedi Order<br />'''Type''': Space Superiority Fighter<br />'''Scale''': Starfighter<br />'''Length''': 12.6 meters<br />'''Skill''': Starfighter Pilot<br />'''Crew''': 1 and Astromech Droid (can coordinate)<br />'''Crew Skill''': Starfighter Pilot: 7D+1; Starship Gunnery: 6D+1; Starship Shields: 4D+1<br />'''Cargo Capacity''': 35 kg<br />'''Consumables''': 3 days<br />'''Cost''': 315,000 (new), 220,000 (used)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': No (uses Astromech Droid programmed with up to 10 jumps)<br />'''Maneuverability''': 3D+2<br />'''Space''': 9<br />'''Atmosphere''': 400; 1,150 km/h<br />'''Hull''': 5D<br />'''Shields''': 2D (plus back-up generators)<br />'''Sensors'''\n*Passive: 30 / 0D\n*Scan: 60 / 1D\n*Search: 90 / 2D\n*Focus: 4 / 4D\n'''Weapons'''\n*'''4 Heavy Laser Cannons''' (fire-linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1,200/2,500m<br />Damage: 7D\n*'''3 Proton Torpedo Launchers'''\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 100/300/700m<br />Ammo: 4 heavy proton torpedoes per launcher<br />Damage: 10D (14D if loaded with “shadow bombs”)\n\n'''Description''': This version of the venerable starfighter retains the third proton torpedo launcher from that standard XJ X-wing while increasing the number of torpedoes carried to twelve. It also incorporated backup shield generators that proved useful against the Yuuzhan Vong \"shield grab\" attack. Additionally it boasts improved targeting systems, maneuverability, avionics, and laser cannons, which fired blue rather than red lasers. It could also use the R7-series astromech droid. Compared to the earlier series of X-wing starfighters, the XJ was a great improvement.\n\n'''Source''':\n*New Jedi Order Sourcebook (page 140)\n*[http://starwars.wikia.com/wiki/T-65XJ3_X-wing_starfighter Wookieepedia: T-65XJ3 X-wing starfighter]\n*thedemonapostle (D20 to D6 conversion)\n\n==T-65XJ4 X-Wing StealthX==\n[[File:XJ4 X-WING \"STEALTHX\".jpg|thumb|500px|right]]\n\n'''Name''': StealthX<br />'''Craft''': Incom T-65XJ4 StealthX<br />'''Affiliation''': New Jedi Order<br />'''Type''': Space Superiority Fighter<br />'''Scale''': Starfighter<br />'''Length''': 11.8 meters<br />'''Skill''': Starfighter Pilot: X-Wing<br />'''Crew''': 1 and Astromech Droid (can coordinate)<br />'''Crew Skill''': Varies<br />'''Cargo Capacity''': 20 kg<br />'''Consumables''': 3 days<br />'''Cost''': 365,000 (new), 280,000 (used)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': No (uses Astromech Droid programmed with up to 10 jumps)<br />'''Maneuverability''': 4D+1<br />'''Space''': 14<br />'''Atmosphere''': 485; 1,400 km/h<br />'''Hull''': 4D<br />'''Shields''': 2D<br />'''Sensors'''\n*Passive: 30 / 0D\n*Scan: 60 / 1D\n*Search: 85 / 2D\n*Focus: 4 / 4D\n'''Weapons'''\n*'''4 Heavy Laser Cannons''' (fire linked)\n: Fire Arc: front<br />Scale: starfighter<br />Skill: starship gunnery<br />Fire Control: 4D+2<br />Space Range: 1-4/15/30<br />Atmosphere Range: 100-400/1,500/3,000m<br />Damage: 7D+2\n*'''2 Torpedo Launchers''' (fire linked)\n: Fire Arc: front<br />Skill: starship gunnery<br />Fire Control: 3D+1<br />Munition Type:\n:*'''Proton Torpedoes'''\n::Scale: starfighter<br />Space Range: 1/3/7<br />Atmosphere Range: 30-100/300/700m<br />Ammo: 3 torpedoes per launcher<br />Damage: 10D (fire linked, 9D if not)\n:*'''Shadow Bombs'''\n::Scale: starfighter<br />Space Range: 1/2/4<br />Atmosphere Range: 50-100/200/400m<br />Ammo: 3 torpedoes per launcher<br />Damage: 14D (not fire linked)\n:*'''Glop Bombs'''\n::Scale: starfighter<br />Space Range: 1/3/7<br />Atmosphere Range: 50-100/300/700m<br />Ammo: 3 torpedoes per launcher<br />Damage: 7D (fire linked, 6D if not)\n:*'''Bunker-Buster Bombs'''\n::Scale: capital<br />Space Range: 1/3/7<br />Atmosphere Range: 50-100/300/700m<br />Ammo: 3 torpedoes per launcher<br />Damage: 6D (not fire-linked, Blast Radius: 6D/5D/4D)\n\n'''Game Notes:'''\n*'''Stealth Hull''': The hull, engines and canopy of the StealthX have all been modified to be hard to see against the backdrop of space. This grants a +4D to a pilot's skill rolls to visually hide the starfighter from visual vew. This works in space, as the hull is star-flecked, and it can hide while floating in plain site. Any being trying to see the fighter must make a visual Perception or Search roll against the pilot's Starfighter Piloting roll with the bonus given here. Further, regardless of wether the pilot is actively trying to hide or not, anyone trying to notice the fighter against the backdrop of space must succeed their roll at Difficult Level to notice anything at all out of place. This does not work in textures and backgrounds that would give the fighter away, such as having it land on a planet with bright grassy fields against its matte black hull.\n*'''Gravitiv Modulator''': The StealthX has this device installed to replace its third proton torpedo launcher. It grants the fighter either a +4D to its skill rolls or a +2 levels to the Difficulty (whichever suits the GM) to avoid being detected by mass-detectors in hyperspace (which require Sensor rolls to detect vessels in hyperspace travel).\n*'''Sensor Negators''': The StealthX gets +4D to its Sensors to roll against any Sensors trying to detect it in normal space. This is in addition to the bonus granted by it Sensors, depending upon relevant range.\n*'''Shadow Bombs''': After the forces of the galaxy began developing tactics to use against the Yuuzhan Vong's unique biotechnology, the Jedi began using a tactic called the \"Shadow Bomb\", where proton torpedoes would be emptied of their propellant fuel and filled with even more explosive yield, as well as modifying the launchers and hull to deploy the torpedoes into space without any bright propellant trails for the Yuuzhan Vong to notice. They would then launch the torpedo and move it with their Jedi powers (Telekinesis) towards a target and would have greater impact. this was because the Yuuzhan Vong could only spot the torpedoes by their brightly burning propellant trail when they were launched, and therefor these would usually not be caught by the black hole shields of the dovin basals. Note that Jedi Telekinesis is needed to move the torpedoes, but the shadow bomb tactic could still be used by normal pilots to lay mines in the path of Yuuzhan Vong ships. The ranges given above for shadow bombs are for the modified launching system. The speed of the torpedoes after launch is equal to the relative speed of the ship that launched them. Jedi and other Force users using shadow bombs while in combat must make a Heroic Difficulty on their Alter Force skill roll to deploy and move the bombs while flying their starfighter and dodging incoming attacks. This is also modified by range, easily becoming a +5 to +10 Difficulty roll as the bomb moves further out of site in the combat zone. Shadow bombs have +3D to their damage dice from the extra explosive yield they possess.\n*'''Glop Bombs''': These are missile weapons that explode and deliver a glob of foam that begins to harden upon delivery and contact with a target. The damage is rolled against the target's hull. If the strength of the glop bomb beats the target's Hull Dice, check the Starship Damage Chart. Whatever damage code is reached, check for the possible loss of Speed and Maneuverability, anything having to do with the target's mobility: all of these are applied together. The substance of the glop bomb hardens over time, and continues to roll against the target's Hull Dice for 3 rounds, each round after contact having +1D to its Strength Dice (for +2D at the third and final round). The effects each round from this stack, as well as results from further glop bomb strikes, until the target is completely immobile and cannot move. Also, as the glop hardens, it grants the target a further +1 pip per round of hardening (+2 pips on the third and final round) to the target's Hull Dice to resist other damage effects from weapon attacks against it. If glop bombs are used extensively against the target, this could make it difficult to destroy without a called shot to an exposed area not covered by the glop, but the target may not be able to dodge anyway.\n*'''Two-Stage Bunker Buster Bombs''': These are meant to assault reinforced armored installations or capital ships, and therefor are capital scale. They also have a blast radius to represent how destructive they are.\n\n'''Description''': The StealthX was smaller than the XJ-series X-wing. It featured equipment that hid the craft both visually and from sensors, though the craft's position was given away if proton torpedoes were used or if the pilot broadcasted over the comlink. The StealthX was used exclusively by Jedi, as the restrictions on comm usage made it nearly impossible for anyone other than a Jedi to coordinate with other forces. The only known use of StealthXs by non-Jedi occurred in 44 ABY, when Wedge Antilles and Tycho Celchu flew a pair on a mission to retrieve Wraith Squadron from Vandor-3. However, they deliberately made no use of the fighter's stealth features.\n\nA modification of the already formidable T-65XJ3 X-wing starfighter, the StealthX had a star-flecked body of irregular, matte-black fiberplast that rendered it almost invisible against a background of stars. The third torpedo launcher had been replaced by a gravitic modulator designed to defeat mass-detectors, and its shields had been downgraded to make room for a suite of sensor negators. Even its fusial engines had been retooled to burn a special tibanna isotope, designated TibannaX, whose efflux turned dark a millisecond after fusion. The viewports utilized blast-tinting technology.\n\nThe standard proton torpedoes were often replaced with the custom-made Jedi shadow bombs, if they were available. The StealthX could also carry glop bombs, which released a quick-hardening foam upon detonation, and two-stage armor-piercing bunker-buster bombs. The advanced R9-series astromech droids were assigned to assist the pilots with the special requirements of this unique craft.\n\n'''Source''':\n*[http://www.rpggamer.org/page.php?page=3115&name=Incom%20T-65XJ4%20X-Wing RPGGamer.org: XJ4 X-WING \"STEALTHX\"]\n*[http://starwars.wikia.com/wiki/StealthX Wookieepedia: StealthX]\n\n==T-65XJ5 X-Wing \"ChaseX\"==\n[[File:T-65XJ5 X-Wing.jpg|thumb|500px|right]]\n\n'''Craft''': Incom T-65XJ5 X-Wing<br />'''Type''': Space superiority starfighter<br />'''Scale''': Starfighter<br />'''Length''': 12m<br />'''Skill''': Starfighter piloting: X-Wing<br />'''Crew''': 1 and astromech droid (can coordinate)<br />'''Crew Skill''': Varies by pilot<br />'''Passengers''': N/A<br />'''Cargo Capacity''': 35 kilograms<br />'''Consumables''': 3 days<br />'''Cost''': 315,000 (new, as of 27ABY), 220,000 (used)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': Uses astromech droid programmed with 10 jumps<br />'''Maneuverability''': 4D+1<br />'''Space''': 14<br />'''Atmosphere''': 500; 1,450kmh<br />'''Hull''': 4D<br />'''Shields''': 3D<br />'''Sensors''':\n*Passive: 30/0D\n*Scan: 60/1D\n*Search: 85/2D\n*Focus: 4/4D\n'''WEAPONS''':\n*'''4 Heavy Laser Cannons''' (fire-linked)\n: Location: Mounted on wingtips<br />Fire Arc: Front<br />Crew: 1 (pilot)<br />Skill: Starship gunnery<br />Scale: Starfighter<br />Fire Control: 4D+2<br />Space Range: 1-4/15/30<br />Atmosphere Range: 50-400/1.5/3km<br />Damage: 7D+2\n*'''3 Proton Torpedo Launchers''' (fire-linked)\n: Location: Deployed from forward hull<br />Fire Arc: Front<br />Crew: 1 (pilot)<br />Skill: Starship gunnery<br />Scale: Starfighter<br />Fire Control: 3D+1<br />Space Range: 1/3/7<br />Atmospheric Range: 50-100/300/700km<br />Damage: 11D<br />Ammo: 9 torpedoes (3 per launcher)\n\n'''DESCRIPTION''': The Incom T-65XJ5 X-wing starfighter, more commonly known as the ChaseX, was a starfighter used during the Chiss-Killik Conflict by the Jedi and the Galactic Police. It featured improvements to the weapons and shielding over the XJ3 X-Wing starfighter. XJ5 X-wings were later used by the Galactic Alliance Guard in 40 ABY and were stationed onboard the Anakin Solo.\n\nThe XJ5 (or \"ChaseX\") was also in use during the Dark Nest Crisis. XJ5 fighters were used by the Galactic Reconstruction Police. The XJ5 was a half a meter shorter than the T-65C.\n\n'''Source''': http://www.RPGGamer.org\n\n==T-65XJ6 X-Wing==\n\n'''Craft''': Incom T-65XJ6 X-Wing<br />'''Type''': Space superiority starfighter<br />'''Scale''': Starfighter<br />'''Length''': 12m<br />'''Skill''': Starfighter piloting: X-Wing<br />'''Crew''': 1 and astromech droid (can coordinate)<br />'''Crew Skill''': Varies by pilot<br />'''Passengers''': N/A<br />'''Cargo Capacity''': 35 kilograms<br />'''Consumables''': 3 days<br />'''Cost''': 325,000 (new, as of 40ABY), 250,000 (used)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': Uses astromech droid programmed with 10 jumps<br />'''Maneuverability''': 4D+2<br />'''Space''': 14<br />'''Atmosphere''': 500; 1,450kmh<br />'''Hull''': 4D+1<br />'''Shields''': 3D+1<br />'''Sensors''':\n*Passive: 30/1D\n*Scan: 60/2D\n*Search: 90/3D\n*Focus: 4/4D\n'''WEAPONS''':\n*'''4 Heavy Laser Cannons''' (fire-linked)\n: Location: Mounted on wingtips<br />Fire Arc: Front<br />Crew: 1 (pilot)<br />Skill: Starship gunnery<br />Scale: Starfighter<br />Fire Control: 4D+2<br />Space Range: 1-4/16/32<br />Atmosphere Range: 50-400/1.6/3.2km<br />Damage: 7D+2\n*'''3 Proton Torpedo Launchers '''(fire-linked)\n: Location: Deployed from forward hull<br />Fire Arc: Front<br />Crew: 1 (pilot)<br />Skill: Starship gunnery<br />Scale: Starfighter<br />Fire Control: 3D+2<br />Space Range: 1/3/7<br />Atmospheric Range: 50-100/300/700km<br />Damage: 11D<br />Ammo: 9 torpedoes (3 per launcher)<br />Rate of Fire: 1\n\n'''DESCRIPTION''': The XJ6 X-wing starfighter was a variant of the classic X-wing starfighter produced by Incom Corporation. In service with the Galactic Alliance Navy as of 40 ABY, it saw action in the Second Galactic Civil War. Luke Skywalker's Hardpoint Squadron of Jedi pilots used these models exclusively.\n\n'''Source''': http://www.RPGGamer.org\n\n==T-65XJ7 X-Wing==\n[[File:T-65XJ7 X-Wing.jpg|thumb|500px|right]]\n\n'''Craft''': Incom T-65XJ7 X-Wing<br />'''Type''': Space superiority starfighter<br />'''Scale''': Starfighter<br />'''Length''': 12.7m<br />'''Skill''': Starfighter piloting: X-Wing<br />'''Crew''': 1 and astromech droid (can coordinate)<br />'''Crew Skill''': Varies by pilot<br />'''Passengers''': N/A<br />'''Cargo Capacity''': 80 kilograms<br />'''Consumables''': 1 week<br />'''Cost''': 330,000 (new, as of 40ABY), 250,000 (used)<br />'''Hyperdrive''': x1<br />'''Nav Computer''': Uses astromech droid programmed with 10 jumps<br />'''Maneuverability''': 5D<br />'''Space''': 15<br />'''Atmosphere''': 550; 1,500kmh<br />'''Hull''': 4D+2<br />'''Shields''': 4D<br />'''Sensors''':\n*Passive: 35/1D\n*Scan: 65/2D\n*Search: 100/3D\n*Focus: 5/4D\n'''WEAPONS''':\n*'''4 Heavy Laser Cannons''' (fire-linked)\n: Location: Mounted on wingtips<br />Fire Arc: Front<br />Crew: 1 (pilot)<br />Skill: Starship gunnery<br />Scale: Starfighter<br />Fire Control: 4D+2<br />Space Range: 1-4/17/35<br />Atmosphere Range: 50-400/1.7/3.5km<br />Damage: 8D\n*'''3 Proton Torpedo Launchers''' (fire-linked)\n: Location: Deployed from forward hull<br />Fire Arc: Front<br />Crew: 1 (pilot)<br />Skill: Starship gunnery<br />Scale: Starfighter<br />Fire Control: 3D+2<br />Space Range: 1-2/4/8<br />Atmospheric Range: 50-200/400/800km<br />Damage: 11D<br />Ammo: 9 torpedoes (3 per launcher)<br />Rate of Fire: 1\n\n'''DESCRIPTION''': The Incom XJ7 X-wing starfighter was in the service of the Galactic Alliance during the Second Galactic Civil War.\n\nSporting laser cannons and proton torpedoes for armament, the XJ7 featured improvements to the weapons and shielding over the XJ6 X-wing starfighter. It was the Galactic Alliance primary space superiority fighter. Rogue Squadron was known to be equipped with XJ7 X-wings.\n\n'''Source''': http://www.RPGGamer.org\n\n=='''T-70 X-Wing'''==\n'''Homebrewed'''\n*[[T-70 X-wing fighter by Agenttherock‎]] \n*[[T-70 X-wing fighter by +Oliver Queen]]",
  "category": "starfighter",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/X-Wing%20Starfighters",
  "retrievedAt": "2025-10-08T13:08:05.203Z"
}