{
  "title": "Xiytiar Transport",
  "pageId": 5553,
  "revisionId": 10981,
  "wikitext": "[[File:XiytiarTransport.jpg|400px|thumb|right]]\n\n\n[[File:Xiytiar.jpg|400px|thumb|right]]\n\n'''Xiytiar Transport'''<br />'''Craft''': TransGalMeg Xiytiar-class Transport<br />'''Affiliation''': General<br />'''Era''': Rise of the Empire<br />'''Source''': Pirates & Privateers (page 68), The Essential Guide to Vehicles and Vessels (pages 72-73)<br />'''Type''': Large transport<br />'''Scale''': Starfighter<br />'''Length''': 164.8 meters<br />'''Skill''': Space transports: Xiytiar transport<br />'''Crew''': 10<br />'''Crew Skill''': Varies widely<br />'''Passengers''': 2<br />'''Cargo Capacity''': 5,000 metric tons<br />'''Consumables''': 3 months<br />'''Cost''': (new) 1.500.000 Credits, 800,000 (used)<br />'''Hyperdrive Multiplier''': x3<br />'''Hyperdrive Backup''': x16<br />'''Nav Computer''': Yes<br />'''Space''': 3<br />'''Atmosphere''': 280; 800 kmh<br />'''Hull''': 4D+2<br />'''Shields''': 4D<br />'''Sensors''':\n*Passive: 20/0D\n*Scan: 35/1D+1\n*Search: 40/3D\n*Focus: 2/3D\n\n'''Capsule''': It was shaped like a thin, cylinder highlighted by a bulbous front cargo section and a small, rear engine pod. Although marginally faster than the comparable Mobquet Medium Transport, it was less durable in combat.\n\nShips of this class measured 164.8 meters in length, could carry 5,000 metric tons of cargo and up to 12 passengers. The cargo space was versatile, and at least one Xiytiar-class transport, the Sungrass, was used as a pocket carrier during a covert New Republic operation. Despite this versatility, and their ability to be manned by as few as two people, they were considered amongst the least elegant of all starships by many pilots.\n\nLo Khan's freighter, the Hyperspace Marauder, was probably the most famous ship of this class. Upgraded with a multi-band computer interface, the ship's co-pilot, Luwingo, made up for the ship's lack of combat ability by slicing into the control systems of attacking craft.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Xiytiar%20Transport",
  "retrievedAt": "2025-10-10T19:14:18.727Z"
}