{
  "title": "Y-4 “Raptor” Transport",
  "pageId": 5668,
  "revisionId": 10907,
  "wikitext": "[[File:Y-4RaptorTransport.png|500px|thumb|right]]\n\n'''Y-4 “Raptor” Transport'''<br />'''Craft''': Incom Corporation Y-4 Military Transport<br />'''Affiliation''': Empire / Rebel Alliance / General<br />'''Era''': Rise of the Empire<br />'''Source''': Cracken’s Threat Dossier (page 48), The Essential Guide to Vehicles and Vessels (pages 84-85)<br />'''Type''': Military troop transport<br />'''Scale''': Starfighter<br />'''Length''': 28 meters<br />'''Skill''': Space transports: Y-4 transport<br />'''Crew''': 1, '''gunners''': 2<br />'''Crew Skill''': Astrogation 4D, sensors 3D+1, space transports: Y-4 Transport 5D+1, starship gunnery 4D and starship shields 3D.<br />'''Passengers''': 40 (troops)<br />'''Cargo Capacity''': 300 metric tons<br />'''Consumables''': 1 month<br />'''Cost''': 250,000 (black market) 160,000 (civilian model - carries no weapons)<br />'''Hyperdrive Multiplier''': x1.5 or x2<br />'''Hyperdrive Backup''': x8<br />'''Nav Computer''': Yes, astromech droid adds +1D to astrogation roll<br />'''Maneuverability''': 1D+1<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 kmh<br />'''Hull''': 5D+2<br />'''Shields''': 3D'''Sensors''':\n*Passive: 40/1D\n*Scan: 80/2D\n*Search: 100/3D\n*Focus: 5/4D\n'''Weapons''':[[File:Y-4RaptorTransport2.jpg|500px|thumb|right]]\n*2 Double Laser Cannons\n: Fire Arc: 1 front, 1 turret<br />Crew: 1<br />Scale: Starfighter<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-5/12/20<br />Atmosphere Range: 100-300/1.2 /2.5 km<br />Damage: 3D\n\n'''Capsule''': Designed to move fast and deploy its cargo quickly, the Y-4 had a meter-thick heat shield and used a spray-on ablative coating for rapid planetary landings. They used a set of S-foil-actuated wings to assist in braking and maneuvering. Y-4s also had light armament for self-defense and infantry support.\n\nThe Y-4 was capable of transporting 40 troops and 300 metric tons of equipment, which was rapidly unloaded by three separate folding assault ramps on the port side. \n\nIntroduced to the Galactic Empire shortly before Incom's nationalization, the Y-4 never saw widespread use due to Imperial prejudice against the alleged Rebel sympathies of its creators. A few Y-4s were used at outposts like Fest.\n\nWhen Zsinj commissioned the Raptors, he chose the Y-4 as their primary landing craft. Their widespread use in enforcing Zsinj's will caused the transport to be linked with the \"Raptor\" name, and New Republic military personnel took to calling the ships \"Raptor Incubators\".\n\nThe New Republic captured several Y-4 transports in their campaign against Zsinj, and Han Solo even appropriated one of their transponder codes for use on the Millennium Falcon. Incom also produced a civilian version of the Y-4, which was unarmed, less heavily armored, and slower.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Y-4%20%E2%80%9CRaptor%E2%80%9D%20Transport",
  "retrievedAt": "2025-10-10T19:14:19.731Z"
}