{
  "title": "YKL-37r Nova Courier",
  "pageId": 5478,
  "revisionId": 10540,
  "wikitext": "[[File:YKL-37rNovaCourier.jpg|500px|thumb|right]]\n\n'''YKL-37r Nova Courier'''<br />'''Craft''': Gallofree Yards YKL-37R Nova Courier<br />'''Affiliation''': General / Rebel Alliance<br />'''Era''': Rebellion<br />'''Type''': Light transport<br />'''Scale''': Starfighter<br />'''Length''': 30 meters<br />'''Skill''': Space transports: Nova Courier<br />'''Crew''': 2, '''gunners''': 2, '''skeleton''': 1/+10<br />'''Crew Skill''': Varies widely<br />'''Passengers''': 4<br />'''Cargo Capacity''': 50 metric tons<br />'''Consumables''': 3 months<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x15<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 8<br />'''Atmosphere''': 360; 1,000 kmh<br />'''Hull''': 5D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 10/1D\n*Scan: 25/2D\n*Search: 40/3D\n*Focus: 3/4D\n'''Sensor Suit''': Grants a +1D bonus to sensors to detect other starships.<br />\n'''Weapons''':\n*'''2 Laser Cannons'''(fire-linked)\n: Fire Arc: Turret<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 1D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 6D\n*'''2 Concussion Missile Launchers''' (fire-linked)\n: Fire Arc: Front<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1/3/7<br />Atmosphere Range: 50-100/300/700<br />Damage: 8D\n\n'''Capsule''': Smaller and more maneuverable than Gallofree's GR-45 or GR-75 transport models, the YKL-37R courier was equipped with enough weaponry to defend its cargo while undertaking dangerous missions.\n\nHaving a small crew, the YKL-37R was built with easy-to-access systems to help maintenance chores go by with only light tools necessary. \n\nWith their medium transport line rapidly developing a poor reputation because of its problems with reliability and maintenance, Gallofree's financial situation spiralled downwards. Gallofree improved the initial medium transport, but it was too little, too late - they had already alienated too many potential buyers.\n\nDesperate for revenue, Gallofree noted the success of several light freighter lines - most notably, CEC's YT-series. Designed and produced in short order, the Nova Courier was the ship that Gallofree hoped to use to save itself. With much lower production costs the YKL-37Rs could be produced on manufacturing lines, instead of requiring expensive drydocks and orbital shipyards-Gallofree hoped to reverse its declining state.\n\nFor two reasons, the project failed. First, the cost of transiting from the heavier production lines needed for the medium transports to the lighter gear needed for light freighters was staggering. This compounded the second problem-the rumors floating around the market that Gallofree was already a dead company. Most \"respectable\" clients were unwilling to invest in the Nova Courier when popular gossip indicated that the company wouldn't be around much longer to support it. \n\nDesperate for revenue, Gallofree approached the Rebel Alliance on a last-ditch deal. The Alliance purchased a large number of the medium transports at a discount, along with a number of the Nova Couriers on the side. Though Rebel technicians generally expressed low opinions of the medium transports, the Nova Couriers became popular among freighter pilots in the Rebellion.\n\nWhen Gallofree folded, its remaining assets were sold off-including all the remaining YKL-37Rs. A number of them have since found their way into the hands of smugglers, thieves and pirates, who found the light freighter more than adequate for dodging Imperial patrols. It wasn't uncommon for one of the little freighters to duck into an edge of an asteroid field to shake off TIE fighters and Customs patrol ships.\n\nAs it was, the YKL-37Rs that made it off the production line and into space were well-liked by their owners, although a lack of factory support made maintenance difficult. Nonetheless, the freighters were easily modified, making them ideal for their role in smuggling goods for the Alliance.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YKL-37r%20Nova%20Courier",
  "retrievedAt": "2025-10-10T19:14:23.685Z"
}