{
  "title": "YQ-400 Monitor Droid",
  "pageId": 553,
  "revisionId": 10910,
  "wikitext": "[[File:YQ-400MonitorDroid.jpg|500px|thumb|right]]\n\n'''Craft''': CEC/Loronar YQ-400 Monitor Droid Patrol Ship<br />'''Type''': Space Transport<br />'''Scale''': Starfighter<br />'''Length''': 36 meters<br />'''Skill''': Space Transports: YQ-400<br />'''Crew''': 0<br />'''Crew Skill''': Sensors 4D, Space Transports 4D, Starship Gunnery 4D, Starship Shields 4D<br />'''Passengers''': 0<br />'''Cargo Capacity''': None<br />'''Consumables''': 20 years<br />'''Cost''': 175,000 (new), 100,000 (used)<br />'''Maneuverability''': 2D<br />'''Space''': 8<br />'''Atmosphere''': 336; 960 km/h<br />'''Hull''': 4D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 50/1D\n*Scan: 50/2D\n*Search: 75/2D+2\n*Focus: 4/3D+1\n'''Weapons''':\n*'''2 Dual Heavy Ion Cannons''' (fire separately)\n: Fire Arc: Partial Turret (front, left, right)<br />Skill: Starship Gunnery<br />Fire Control: 1D<br />Space Range: 1-3/7/36<br />Atmosphere Range: 100-300/700/3.6 km<br />Damage: 8D\n*'''2 Laser Cannons''' (fire-linked)\n: Fire Arc: Front<br />Skill: Starship Gunnery<br />Fire Control: 1D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 5D\n\n'''Capsule''': A product of the jointly funded design team of the Loronar Corporation and Corellian Engineering Corporation known as The Nerfworks, the YQ-400 Monitor Droid Patrol Ship was a small (36 meters long) ship designed to work in areas where high docking fees and trade tariffs provided most of a system's profits. Its primary job was to detect, locate and follow ships entering the system, although the lack of hyperdrive limited the ship to local areas only.\n\nDesigned for light patrol duty in well-traveled peaceful systems, the YQ-400 Monitor did not carry enough armaments to stop serious smugglers or pirates, nor was it smart enough to serve in a military capacity. It did however, work as a watch ship, most commonly in systems with heavy commerce and shipping, where crewing enough ships to cover all possible approach vectors was financially prohibitive.\n\nStandard programming stationed the YQ-400 in a predefined vector in the outer reaches of a system, where its use of only passive sensors made it difficult for other ships' sensors to spot. Upon detection of another starship within its vicinity, the patrol ship would report the contact to spaceport control and hail the approaching craft. The YQ-400 would then 'monitor' the ship in question by following it and reporting periodically on its location until directed otherwise by spaceport control.\n\nThe droid patrol ship was programmed never to fire on a ship unless attacked first. While this gave an unfair advantage to hostile ships, it kept the Monitors from accidentally attacking friendly ships.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YQ-400%20Monitor%20Droid",
  "retrievedAt": "2025-10-10T19:14:25.196Z"
}