{
  "title": "YT-1760 Small Transport",
  "pageId": 488,
  "revisionId": 10563,
  "wikitext": "[[File:YT1760.jpg|thumb|264px]]\n\n'''Craft''': Modified YT-1760<br />'''Type''': Light Freighter<br />'''Scale''': Starfighter<br />'''Length''': 20 meters<br />'''Skill''': Space Transports: YT-1760<br />'''Crew''': 1 or 2<br />'''Crew Skill''': Varies<br />'''Passengers''': 8<br />'''Cargo Capacity''': 10 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': 80,000 (new), 20,000 (used)<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Back-Up''': x15<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 8<br />'''Atmosphere''': 365; 1050 km/h<br />'''Hull''': 3D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':\n*'''2 Laser Cannons (fire-linked)'''\n: Fire Arc: Turret<br />Skill: Starship Gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5km<br />Damage: 4D+1\n\n'''Capsule''': The YT-1760 was a light transport built by Corellian Engineering Corporation.\n\nReleased around the time of the Battle of Naboo, the YT-1760 was part of the popular YT series, intended to correct some of the shortcomings of its predecessors. Though it succeeded in improving on the slower sublight and hyperdrive speeds of older models, it did so at the cost of cargo capacity and defense capability.\n\nThe YT-1760 was released with no weapons and no combat shields, and its hull was less sturdy than many of its predecessors. The larger drive systems had already reduced the cargo capacity to a tenth of the YT-1300's, but most YT-1760 owners decided to trade a little of their remaining cargo room for commercial-grade shield generators. Fortunately, the YT-1760 shared the easy upgradeability of other YT series ships, and it was also common for owners to add a pair of quad laser cannons. Some YT-1760 captains chose to replace the spartan passenger accommodations with more comfortable staterooms, though this reduced the passenger capacity from eight beings to four.\n\nAlthough few large commercial concerns purchased YT-1760s, they were fairly popular with independent traders. Their high maintenance requirements caused most YT-1760s to be scrapped by the time of the Galactic Civil War, but some operators still preferred them to newer ships.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YT-1760%20Small%20Transport",
  "retrievedAt": "2025-10-10T19:14:32.299Z"
}