{
  "title": "YT-1300 Transport",
  "pageId": 5486,
  "revisionId": 51343,
  "wikitext": "[[File:YT-1300Transport.jpg|500px|thumb|right]]\n\n'''YT-1300 Transport'''<br />'''Craft:''' Corellian Engineering Corp. YT-1300 Transport<br />'''Affiliation:''' General<br />'''Era:''' Rise of the Empire<br />'''Source:''' Core Rulebook (page 254), Platt’s Smugglers Guide (pages 30-32), The Star Wars Sourcebook (pages 39-40), Dark Force Rising Sourcebook (pages 130-131), Heir to the Empire Sourcebook (page 129), The Thrawn Trilogy Sourcebook (page 231), Polyhedron Issue 162<br />'''Scale:''' Starfighter<br />'''Length:''' 26.7 meters<br />'''Skill:''' Space transports: YT-1300<br />'''Crew:''' 1 (1 can coordinate), gunners: 1<br />'''Crew Skill:''' Varies widely<br />'''Passengers:''' 6; 9 (YT-1300p); None (YT-1300f)<br />'''Cargo Capacity:''' 100 metric tons; 50 (YT-1300p); 150 (YT-1300f)<br />'''Consumables:''' 2 months<br />'''Cost:''' 100,000 (new), 25,000 (used)<br />'''Hyperdrive Multiplier:''' x2<br />'''Hyperdrive Backup:''' x12<br />'''Nav Computer:''' Yes<br />'''Space:''' 4<br />'''Atmosphere:''' 280; 800 kmh<br />'''Hull:''' 4D<br />'''Sensors:'''\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons:'''\n*Laser Cannon\n: Fire Arc: Turret<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 4D\n\n'''Characteristics'''<br />\nConceived by a panel of CEC shipbuilding experts with help from Narro Sienar, the YT series went on to become one of the most popular space transport hulls ever produced, revolutionizing the interstellar shipping industry with its unparalleled application of modular design. Whole sections could be mass-produced and arranged into new configurations as needed without extensive retooling. This saved CEC enormous amounts of credits by allowing the starships to be brought to market at extremely competitive prices.\n\nThe YT-1300 model exemplified this concept with a circular main corridor and modular compartments that could be mounted around it, all radiating outwards from a central core inside a saucer-shaped hull making for both a convenient and economic design.\n\nIt was considered an equivalent of its time to the Old Republic Barloz cargo freighter.\n\nAppeal: The appeal of the YT-1300 transport was not its basic equipment, however, but its ability to take an extraordinary amount of modifications and alterations. In short, the YT-1300 was reliable, durable, and easy to modify, hence its popularity amongst freighter captains throughout the galaxy.\n\nLike the rest of the YT series, it featured a saucer-shaped hull with external cockpit. The YT-1300 came in three different configurations: a port-mounted cockpit, a starboard-mounted cockpit, and a centrally mounted cockpit (the latter of which became standard in the YT-1930 design). YT-1300s used fuel cells powered by liquid metal fuel.\n\nAlmost every YT-1300 that was sold was later customized with a handful of extra components, from simple underfloor storage space to a new hyperdrive and added firepower. The features the YT-1300 was given on the production line were necessary but basic: the off-center cockpit; two escape pods, located on the port and starboard side of the freighter; a laser cannon mounted atop the craft; and about 100 tons of cargo space.\n\nHundreds of thousands of YT-1300s were still in service as of 40 ABY.\n\n'''Ship Configuration'''<br />\nWhile all YT-1300s looked similar from the outside, the interior of the ship could be configured in a number of ways thanks to the modular design. Two of the most popular designs, and which saw the greatest levels of production, were the freight (YT-1300f) and passenger (YT-1300p) configurations. It was not uncommon to find ships with a mixture of both passenger and cargo configurations belonging to more entrepreneurial captains however, and later in the life-cycle of the YT-1300 product line the CEC execs grew wise to this fact.\n\nRealizing that many customers were looking for a balance between cargo and passengers, Corellian Engineering began to deliver ships with a blend of both freight and passenger modules. This configuration, initially called \"YT-1300fp\", quickly became the most popular arrangement, over time coming to be recognized as the \"stock\" version of the ship. The separate designations for freight and passenger configurations disappeared from common usage soon after Emperor Palpatine's rise to power.\n\n'''YT-1300p'''<br />\nThe passenger configuration made full use of the saucer shaped hull to fit as much living space as possible, sacrificing room that would be typically reserved for cargo or machinery in favor of multiple passenger cabin modules. Greater escape pod capacity was also a requirement and two 6-person escape pods were built into the sides of the YT-1300p to accommodate the larger passenger complement. As a result truncated boarding ladders replaced the ramps used for standard access and egress.\n\n'''YT-1300f'''<br />\nThe freight configuration left the interior of the ship as an empty shell, leaving the crew with minimal comforts as more room was given to the cargo holds. Of significant note were the twin boarding ramps, port and starboard, for the access of treaded cargo loaders and droids. These ramps and the overhead clearance they required took up much of the space that housed the escape pods in the YT-1300p. Matching port and starboard docking rings were instead placed in the protrusions on either side of the external hull, again showing the versatility of the CEC designers in that this interior change barely altered the outward appearance of the YT-1300. This led to a common misunderstanding between casual starship watchers.\n\nMany a debate ranged over whether it was docking rings or lifepods that were located behind the cylindrical protrusions on the ship's hull. Thanks to the highly customizable nature of the YT-1300, either option, or a combination of the two was possible.\n\n'''External modifications'''<br />\nMany individuals also modified the exterior of the YT-1300, often modifying and expanding the forward mandibles for extra crew and cargo space. It was highly unlikely to find two ships that had exactly the same layout and systems.\n\nThe ship could also be fitted with optional external cargo pods. Mounted to the outside dorsal hull of the ship, around the central saucer section, the pods could add up to an additional 100 metric tons of cargo space. This configuration was popular with the Alliance to Restore the Republic's Support Services. Such modified freighters were used to resupply Rebel bases and starships located behind enemy lines.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YT-1300%20Transport",
  "retrievedAt": "2025-10-10T19:14:29.733Z"
}