{
  "title": "YT-2000 Transport",
  "pageId": 5491,
  "revisionId": 10737,
  "wikitext": "[[File:YT-2000Transport.jpg|500px|thumb|right]]\n\n[[File:YT-2000.jpg|thumb|right]]\n\n'''YT-2000 Transport'''<br />'''Craft''': Corellian Engineering Corp. YT-2000 Transport<br />'''Affiliation''': General<br />'''Era''': Rebellion<br />'''Source''': Starfighters of the Galaxy - Saga Ed. (pg 154)<br />'''Type''': Light Freighter<br />'''Scale''': Starfighter<br />'''Length''': 29 meters<br />'''Skill''': Space transports: YT-2000<br />'''Crew''': 1 or 2 (can co-ordinate), gunners: 2<br />'''Passengers''': 7<br />'''Cargo Capacity''': 115 metric tons<br />'''Consumables''': 3 months<br />'''Cost''': 150,000 (new), 45,000 (used)<br />'''Hyderdrive Multiplier''': x2<br />'''Hyderdrive Backup''': x12<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D+2<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 kmh<br />'''Hull''': 6D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 15/0D\n*Scan: 35/1D\n*Search: 60/2D\n*Focus: 3/3D\n'''Weapons''':\n*Quad Laser Cannon\n: Fire Arc: Dorsal turret (Turret may be fixed to forward to be fired by the Pilot at only 1D Fire Control)<br />Crew: 1 or pilot<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-500/1.2/2.5 km<br />Damage: 5D\n\n'''Capsule''': The YT-2000 transport was designed to be a direct improvement over the YT-1300, but it only saw a limited production run. Its basic design was similar to the YT-1930 with its centrally-placed cockpit and symmetrical design, while the rest of the ship returned to the saucer-like design of the YT-1300. \n\nThe YT-2000 combined the YT-1300's successful saucer-like design with the YT-1930's symmetrical theme, including the centralized cockpit placement. The standard cockpit design of the YT-2000 deviated from the pilot and co-pilot sitting side by side, as in previous models. Instead, the pilot sat in front while the co-pilot was situated behind and raised above the pilot, with no room for any other people in the cockpit.\n\nDue to the turbulent times in which the ship was designed and produced, the YT-2000 boasted heavier standard shields and weapons (two dual laser turrets) than most civilian freighters, certainly than any of its predecessors. The heavy armament and shields, coupled with its speed and maneuverability, caused many Imperial officials to view the YT-2000 being marketed as a \"civilian\" ship with suspicion. \n\nRumors abounded that the YT-2000 was originally intended to be the \"next generation\" model of transports for Corellian Engineering Corporation; however, extensive industrial espionage leaked the early design specifications to competing shipyards. This forced CEC to put the YT-2000 into production before all of its potential drawbacks had been worked out. This resulted in this ship being touchier than previous models. However, its extensive cargo capacity, good defenses, and amazing maneuverability for a ship its size, coupled with plenty of space and power to make custom modifications, earned a place as one of the more popular YT models among its owners.\n\nThe YT-2000 had a limited production run, though not due to low sales. The line was discontinued early so CEC could push their new YT-2400 line, which had not been compromised by industrial espionage.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YT-2000%20Transport",
  "retrievedAt": "2025-10-10T19:14:35.312Z"
}