{
  "title": "YT-2400 Transport",
  "pageId": 5492,
  "revisionId": 36412,
  "wikitext": "[[File:YT-2400Transport.jpg|500px|thumb|right]]\n\n'''YT-2400 Transport'''<br />'''Craft''': Corellian YT-2400 Transport<br />'''Affiliation''': General<br />'''Era''': Rebellion<br />'''Source''': Stock Ships (pages 17-19), Pirates & Privateers (page 61), Starships of the Galaxy (page 88), The Essential Guide to Vehicles and Vessels (pages 32-33)<br />'''Type''': Stock light freighter<br />'''Scale''': Starfighter<br />'''Length''': 21 meters<br />'''Skill''': Space transports: YT-2400<br />'''Crew''': 2, '''gunners''': 1, '''skeleton''': 1/+10<br />'''Crew Skill''': Varies widely<br />'''Passengers''': 6<br />'''Cargo Capacity''': 150 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': 130,000 (new), 32,000 (used)<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x12<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D+2<br/>'''Space''': 4<br />'''Atmosphere''': 480; 800 kmh<br />'''Hull''': 5D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':[[File:YT-2400Transport2.png|500px|thumb|right]]\n*Laser Cannon\n: Fire Arc: Turret<br />Crew: 1<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 4D\n\n'''Capsule''': The YT-2400 light freighter was a YT series light freighter produced by Corellian Engineering Corporation similar to the YT-1300.\n\nDash Rendar's Outrider was a heavily modified YT-2400 freighter, and perhaps the most famous example of the ship amongst fringers. \n\nFavored by smugglers, the ship featured the YT series trademark saucer-shaped hull and starboard-mounted command pod. Like most Corellian designs, the YT-2400 was fast, tough, and endlessly modifiable. Stock YT-2400s were 21 meters in length, required two pilots, and were armed with a single laser cannon turret, although the ship was easily customized for modifications to the stock frame. Thus, the design was favored by mercenaries and smugglers, or any other being in need of a well-armed \"transport\".\n\nWith thick armor plating and bulky engines, the YT-2400 could easily handle the strain of deep-space combat. The vessel had power to spare and an oversized hull begging for hot-rodded engines and powerful weapons.\n\nThe YT-2400 was configured with a pair of starboard bracing arms that connected to the cockpit compartment, essentially a long tube. The aft section of the cockpit tube contained the primary escape pod, which seated six. The bracing arm's interior space generally was used for crew quarters and living space.\n\nThe rounded hull area was devoted to cargo holds and ship's systems. In practice, much of the interior hull space was taken up by modified engines, power generators, weapons systems, and all the other illegal goodies any self-respecting smuggling ship needed. A second escape pod, as well as the airlock, was located on the far side of the cargo compartment, directly opposite the bracing arms.\n\nBy 137 ABY, the YT-2400 freighter was apparently still in use, as the Galactic Alliance Remnant utilized the Scarlet Star.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YT-2400%20Transport",
  "retrievedAt": "2025-10-10T19:14:36.299Z"
}