{
  "title": "YT-3500 Transport",
  "pageId": 5503,
  "revisionId": 10576,
  "wikitext": "[[File:YT-3500Transport.jpg|500px|thumb|right]]\n\n'''YT-3500 Transport'''<br />'''Type''': Corellian Engineering Corporation YT-3500 Space Transport<br />'''Source''': RPGGamer.org<br />'''Scale''': Starfighter<br />'''Length''': 26.7m<br />'''Skill''': Space Transports - YT-3500<br />'''Crew''': 1 (Gunners:1)<br />'''Crew Skill''': varies<br />'''Passengers''': 6<br />'''Consumables''': 2 Months<br />'''Cargo Capacity''': 150 Tonnes<br />'''Cost''': 105,000 (new); 26,000 (used)<br />'''Hyperdrive Multiplier''': X2<br />'''Hyperdrive Backup''': X12<br />'''Nav Computer''': Yes<br />'''Space''': 4<br />'''Atmosphere''': 480;800kmh<br />'''Maneuverability''': 0D<br />'''Hull''': 4D<br />'''Shields''': 2D<br />'''Sensors''':\n*Passive: 30/0D\n*Scan: 60/1D\n*Search: 75/2D\n*Focus: 4/3D\n'''Weapons''':\n*Laser Cannon\n: Fire Arc: Turret<br />Skill: Starship Gunnery<br />Fire Control: 2D<br />Space Range: 1-3/15/25<br />Atmosphere Range: 100-300/1.5/2.5km<br />Damage: 4D\n\n'''Description''': The YT-3500 is a late series Corellian Freighter which contains some small refinements over the earlier Corellian transports such as the YT-1300, but wasn't distinguished enough to make any huge impact on the market. The vessel has a smaller drive unit which accounts for the larger cargo capacity even though it uses only a very slightly modified YT-1300 hull, the central cockpit is also considered to be an improvement giving the pilot a better forward view from the vessel, however some have criticised the fact that it is difficult to see below the ship from the cockpits high placement, making landings sometimes difficult. The cockpits placement also blocks the space many owners use in YT-1300's for an upper gun turret, however the lower gun socket is pre-installed with a laser cannon. In reality the ship is only slightly different from other YT series transports, and has no real great advantage or disadvantage over them, really just coming down to personal preference over which ship a pilot prefers.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YT-3500%20Transport",
  "retrievedAt": "2025-10-10T19:14:38.265Z"
}