{
  "title": "YT 450a Light Freighter",
  "pageId": 5482,
  "revisionId": 10542,
  "wikitext": "[[File:YT450aLightFreighter.gif|500px|thumb|right]]\n\n'''YT-450a Transport'''<br />'''Craft''': Corellian Engineering Corporation YT-450a Transport<br />'''Type''': Light freighter<br />'''Scale''': Starfighter<br />'''Length''': 25 meters<br />'''Skill''': Space Transports<br />'''Crew''': 1 to 2 (can coordinate)<br />'''Crew Skill''': Varies widely<br />'''Passengers''': 4<br />'''Cargo Capacity''': 95 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': 24,500 credits (used only)<br />'''Hyperdrive Multiplier''': x3<br />'''Hyperdrive Backup''': x15<br />'''Nav Computer''': Yes<br />'''Maneuverability''': +1<br />'''Space''': 3<br />'''Atmosphere''': 260; 750 kmh<br />'''Hull''': 4D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':\n*Laser Cannon\n: Fire Arc: Turret<br />Crew: 1 (co-pilot)<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere: 100-300/1.2/2.5 km<br />Damage: 4D\n\n\n'''Capsule''': The YT-450a was one of the very first designs of the Corellian Engineering Corporation (CEC) for the light freighter market. It sold quite well in the days of the Old Republic where it was released, but as CEC quickly developed and released newer and improved freighters, the YT-450a slowly lost its attractiveness. Free traders now preferred freighters like the YT-1200, YT-1210 and of course the famous YT-1300 transport. There were some models between these and the YT-450a, such as the YT-700 and the YT-1000, but they didn't have high production numbers. However the freighters following the YT-1000 were quite popular and still are! Especially the YT-1300. They all featured better hyperspace and sublight speed, larger cargo bays and could easily be modified, things that the YT-450a could not compete with. The transport itself is somewhat clunky looking, and some of the models which survived until today, look like they could fall apart each second. The original YT-450 never was released due to having been equipped with defect power generators that caused far too much malfunctions during test flights. For this reason, CEC released the model \"a\", coming fully operational and equipped with a better hyperdrive backup. Many models of the YT-450a are still in service today and popular, especially when well maintained.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YT%20450a%20Light%20Freighter",
  "retrievedAt": "2025-10-10T19:14:41.235Z"
}