{
  "title": "YU-410 Light Freighter",
  "pageId": 489,
  "revisionId": 10967,
  "wikitext": "[[File:YU-410LightFreighter.jpg|500px|thumb|right]]\n\n[[File:YU-410.jpg|300px|thumb|500px|thumb|right]]\n\n'''Craft''': Corellian Engineering Corporation YU-410 Light Freighter<br />'''Type''': Light Freighter<br />'''Scale''': Starfighter<br />'''Length''': 44 meters<br />'''Skill''': Space Transports: YU-410<br />'''Crew''': 4+4 gunners<br />'''Crew Skill''': Varies<br />'''Passengers''': 12<br />'''Cargo Capacity''': 250 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': 200,000 (new), 80,000 (used)<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Back-Up''': x12<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 0D<br />'''Space''': 4<br />'''Atmosphere''': 280; 800 km/h<br />'''Hull''': 4D+2<br />'''Shields''': None<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':\n*'''4 Double Laser Cannons (fire separately)'''\n: Fire Arc: 2 in turrets, 2 in partial turrets (front right, and front left)<br />Skill: Starship Gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5km<br />Damage: 5D\n\n'''Capsule''': At 44 meters long, the YU-410 was relatively large for a light freighter, and could carry a fairly impressive 250 metric tons of cargo.\n\nIt was also well armed, with four double laser cannon turrets, mounted on the upper and lower hull and at the front corners of its two cargo bays. However, these advantages came at a price, as the YU-410 was relatively slow and had very poor maneuverability. As part of cost-cutting, it was equipped with smaller than normal engines that led to a low maximum speed and reduced maneuverability. Like most CEC designs, it was easily repaired and modified.\n\nDue to its large cargo capacity and low profile, it was a popular model with merchants and mercenaries. The large cargo space was often converted in opulent living quarters, making the YU-410 into a mobile base of operations. The large cargo bays also helped smugglers hide objects from customs inspectors.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YU-410%20Light%20Freighter",
  "retrievedAt": "2025-10-10T19:14:42.269Z"
}