{
  "title": "YV-100 Light Freighter",
  "pageId": 5494,
  "revisionId": 10582,
  "wikitext": "[[File:YV-100LightFreighter.jpg|500px|thumb|right]]\n\n'''YV-100 Light Freighter'''<br />'''Craft''': Corellian Engineering Corporation YV-100<br />'''Affiliation''': General<br />'''Era''': Rise of the Empire<br />'''Source''': Star Wars Gamer Issue 2<br />'''Type''': Light freighter<br />'''Scale''': Starfighter<br />'''Length''': 46.5 meters<br />'''Skill''': Space transports: YV-100<br />'''Crew''': 2<br />'''Crew Skill''': Varies<br />'''Passengers''': 10<br />'''Cargo '''Capacity: 150 metric tons<br />'''Consumables''': 6 months<br />'''Cost''': 150,000 (new), 50,000 (used)<br />'''Hyperdrive Multiplier''': x3<br />'''Hyperdrive Backup''': x12<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 kmh<br />'''Hull''': 5D<br />'''Shields''': 1D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':\n*2 Blaster Cannons (fire-linked)\n: Fire Arc: Partial Turret (front, right, left)<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 4D+1\n*2 Laser Cannons (fire-linked)\n: Fire Arc: Front<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5 km<br />Damage: 5D+1\n\n'''Capsule''':<br />The YV-100 light freighter was the first of the Corellian Engineering Corporation's YV series starships released in the era surrounding the rise of the Galactic Empire. Its 46.5-meter-long frame housed enough room to hold 150 cubic meters of cargo, as well as other vital starship systems, including the hyperdrive, weaponry, and living arrangements. On the exterior, the ship resembled CEC's YT series line in the rear portion—this design feature was due to the influence of the popular YT series already on the market which the designers brought along. The body also featured a long, slender forward portion—a feature that would become trademark to the future ships of the YV series.\n\nThe ship was considered to be well-built and hardy by pilots of its era, and, while considered an unremarkable ship design, was well-received by those who bought it. Even so, the YV-100 was not as easily modifiable as other CEC ships still on the market and as a result never gained the popularity its YT series cousins had. Still, even with the slightly lowered demand, the YV-100 light freighter lasted from its original release well into the climax of the Yuuzhan Vong War. \n\n'''Characteristics'''<br />Because the ship was the first in the Corellian Engineering Corporation's YV series line, the YV-100 light freighter closely resembled the YT series line already on the market, a trend that became less and less noticeable as the ship designs in the series progressed. This was shown in the distinctly familiar saucer-shaped hull toward the rear of the vessel. However, beyond this design influence, the YV-100 differed greatly from its YT series cousins, most noticeably in the design of the cockpit and connecting structure; it was this feature that gave the freighter its 46.5-meter length. Due to the extended rear portion of the vessel, cargo space was plentiful for a ship of its size and capabilities; approximately 150 cubic meters of freight could be placed in the cargo hold.\n\nTwo large engines, positioned on the port and starboard sides of the rear of the vessel, provided the ship with much of its thrust; two smaller engines, located just in between the larger ones, assisted. A class 3 hyperdrive was fed into these engines, providing the ship with a shorter hyperspace traveling time; a backup class 12 hyperdrive existed to rescue the ship in case the class 3 failed.\n\nFor weaponry, the stock YV-100 utilized two fire-linked laser cannons, located in the nose of the ship, and two fire-linked blaster cannons, located in a turret atop the freighter. The laser cannons had a very limited fire-arc, as they could only fire forward. However, the turret-mounted blaster cannons made up for whatever area not covered by the forward lasers, and could fire in any direction except aft.\n\nThe freighter lacked the modularity common in CEC lines; as such the YV-100, and the entire YV line, never garnered as much popularity as had the YT series and thus never established a firm foothold in the galaxy's starship markets. Consequently, the cost of a used ship was fairly low when compared with other ships of its caliber. Still, those who owned it often claimed their YV-100 freighter was a solid, well-built ship, and actually outperformed the older YT-1300 light freighter. Spacefarers with extra money would often convert the freighter to a luxury craft, even though it was more costly and harder to accomplish, due to the lack of modularity.\n\nThe YV-100 light freighter remained competitive up to and into the Yuuzhan Vong War, which began in 25 ABY. While not fast enough to evade the Yuuzhan Vong coralskippers, the ship could enter and exit a system quietly and undetected, and remain competitive to last long enough to escape a battle, if one arose.\n\n'''Role'''<br />The YV-100's main mission role was that of freight transfer. One such craft under the cargo configuration crash-landed on Endregaad sometime during the waning years of the Galactic Republic and the rise of the Galactic Empire. The ship was carrying a shipment of tempest, a drug akin, though more powerful and addictive, to glitterstim spice. The Hutt Mika Anjiliac Chiera set up a salvage tent to try and recover anything he could from the downed ship—as well as any of the tempest, as the Hutt had himself initially ordered the shipment.\n\nHowever, the YV-100 light freighter also served the purpose of a shuttle. To this extent, Jedi Master Luke Skywalker offered a modified freighter, the Lady Starstorm, to a group of spacers during the Yuuzhan Vong War. These spacers were tasked with infiltrating the planet Myrkr in order to ascertain the extent of the Yuuzhan Vong's supply of vornskyr canines and their hold on the planet. The ship would allow them enough cover to safely land on the planet as well as evade any complications that arose.\n\nFollowing in the vein of shuttle transportation, the ship was often converted to a dedicated luxury craft by individuals with extra credits.\n\n'''History'''<br />Corellian Engineering Corporation, not content with their huge successes with the YT series line, began the YV series during the time of the rise of the Empire. The company redesigned and refitted everything from the ground up, and every system in the ship was reworked to fit these new specifications; this essentially provided CEC with a more modern ship. The YV-100 was the first of this new line. Because of this, certain design elements were borrowed from the YT series, such as the trademark saucer-shaped hull, as well as other Corellian starship designs. This practice would eventually fade out with time and later incarnations of the YV series; the extended cockpit portion, however, would go on to be a staple of the line.\n\nReleased sometime before the Empire's rise to power in 19 BBY, the YV-100 never latched onto the galactic starship market, mainly due to the lack of modular components so common to Corellian Engineering Corporation products. Thus, this freighter, along with most other YV-series freighters, was harder to adapt to various roles. Even so, the designs proved to be adequate for the intended purpose of hauling cargo, and those who did purchase them were not disappointed.\n\nThe freighter would continue to be utilized long after its initial release, into the later stages of the Galactic Civil War and beyond. Because of its lower cost, the YV-100 was heavily favored on worlds in the Fringe, as well as poorer or less-trodden planets in other sections of the galaxy. Some of its design features would become trademark to the YV line; one of these was the longer \"neck\" portion of the ship—most notably seen in the YV-666 light freighter.\n\nThe ship remained prominent throughout the New Republic's reign and into the Yuuzhan Vong War, where one was used in order to infiltrate the planet Myrkr. The ship was noted as being a good fit for the role by Luke Skywalker based on its capabilities plus its ability to blend into everyday traffic.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YV-100%20Light%20Freighter",
  "retrievedAt": "2025-10-10T19:14:43.295Z"
}