{
  "title": "YV-545 Transport",
  "pageId": 5497,
  "revisionId": 10584,
  "wikitext": "[[File:YV-545Transport.jpg|500px|thumb|right]]\n\n'''YV-545 Transport'''<br />'''Craft''': Corellian Engineering Corporation YV-545 Transport<br />'''Affiliation''': General<br />'''Era''': Rebellion<br />'''Source''': Rebellion Era Sourcebook (pages 14-15)<br />'''Type''': Space transport<br />'''Scale''': Starfighter<br />'''Length''': 32 meters<br />'''Skill''': Space transports: YV-545<br />'''Crew''': 2<br />'''Crew Skill''': Varies<br />'''Passengers''': 8<br />'''Cargo Capacity''': 100 metric tons<br />'''Consumables''': 2 months<br />'''Cost''': 45,000 (used)<br />'''Hyperdrive Multiplier''': x2<br />'''Hyperdrive Backup''': x12<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 8<br />'''Atmosphere''': 360; 1,000 kmh<br />'''Hull''': 5D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':\n*2 Heavy Ion Cannons (fire-linked)\n: Fire Arc: Turret<br />Skill: Starship gunnery<br />Fire Control: 2D<br />Space Range: 1-3/7/36<br />Atmosphere Range:100-300/700/3.6 km<br />Damage: 5D\n\n'''Capsule''':<br />The YV-545 light freighter was a light freighter produced by the Corellian Engineering Corporation in an attempt to replace the aging YT series freighters. \n\nThe YV-545 had a cylindrical hull, with the cockpit mounted to the side like most CEC designs. The YV-545 was considered to be sturdier and more maneuverable than the YT-series vessels, though lacked the visual appeal of the YT-1300 light freighter. In flight the cockpit rotated 90 degrees to be on top of the starship, while the body remained beneath. Though the ship could land in this configuration as well, most buyers saw this design as too complex.\n\nIts body was ringed by sensors and maneuvering thrusters, which gave it exceptional maneuverability. It could rival most starfighters in performance and was a popular ship with smugglers and pirates, who liked to modify the YV-545 into an attack ship.\n\n'''History'''<br />Although designed as the next generation of Corellian Engineering Corporation freighters, the YV-545 never quite gained the popularity of its predecessor. The Midnight Star was a YV-545 light freighter.",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YV-545%20Transport",
  "retrievedAt": "2025-10-10T19:14:45.774Z"
}