{
  "title": "YZ-775 Transport",
  "pageId": 492,
  "revisionId": 44231,
  "wikitext": "[[File:YZ-775Transport.jpg|500px|thumb|right]]\n\n'''Craft''': Corellian Engineering Corporation YZ-775 Transport<br />'''Affiliation''': General<br />'''Era''': Rise of the Empire, Rebellion<br />'''Type''': Light Freighter<br />'''Scale''': Starfighter<br />'''Length''': 52 meters<br />'''Skill''': Space Transports: YZ-775<br />'''Crew''': 8 (Captain, Pilot, Co-pilot, 2 Engineers, Cargo master, 2 Gunners)<br />'''Crew Skill''': Varies<br />'''Passengers''': 14<br />'''Cargo Capacity''': 400 metric tons<br />'''Consumables''': 6 months<br />'''Cost''': 500,000 (new), 350,000 (used)<br />'''Hyperdrive Multiplier''': x1<br />'''Hyperdrive Backup''': x12<br />'''Nav Computer''': Yes<br />'''Maneuverability''': 1D<br />'''Space''': 6<br />'''Atmosphere''': 330; 950 km/h<br />'''Hull''': 7D<br />'''Shields''': 6D<br />'''Sensors''':\n*Passive: 10/0D\n*Scan: 25/1D\n*Search: 40/2D\n*Focus: 2/3D\n'''Weapons''':\n*'''2 Turbolaser Cannons''' (fire-linked)\n: Fire Arc: Partial Turret (front, right, left)<br />Skill: Capital Ship Gunnery<br />Scale: Capital<br />Fire Control: 3D<br />Space Range: 1-5/15/20<br />Atmosphere Range: 100-500/1.5/2km<br />Damage: 4D+1\n*'''2 Twin Laser Cannons''' (fire separately)\n: Fire Arc: Turret<br />Skill: Starship Gunnery<br />Fire Control: 3D<br />Space Range: 1-3/12/25<br />Atmosphere Range: 100-300/1.2/2.5km<br />Damage: 5D\n*'''2 Proton Torpedo Launchers''' (fire separately)\n: Fire Arc: Front<br />Skill: Projectile Weapons: Proton Torpedoes<br />Fire Control: 1D<br />Space Range: 1/3/7<br />Atmosphere Range: 50-100/300/700m<br />Ammo: 12 torpedoes each<br />Damage: 9D\n\n'''Notes''':\n*Escape Pods: 2\n*This ship is right on the edge of being capital scale.\n\n'''Description''': The YZ-775 medium transport was a transport in the YZ series of ships produced by the Corellian Engineering Corporation.\n\n'''Characteristics''': The cockpit was an over-sized variant of the standard conical CEC cockpit, capable of seating all 8 crew members. Aft of the cockpit the ship had a two-deck layout, split between the cargo hold and crew quarters.\n\nThe YZ-775 was armed with a double turbolaser turret, two double laser cannon turrets, and two proton torpedo tubes. This layout was deemed excessive for a non-combatant transport by Imperial agencies, a claim CEC denied as it had properly gained authorization for such a layout from the Imperial Bureau of Shipyards and Construction.\n\n'''History''': It was first produced shortly after the end of the Clone Wars. The 52-meter-long vessel was one of the largest to be classified as a \"light freighter\", and could carry 400 metric tons of cargo. Its design bore some resemblance to the CR90 corvette and Corellian gunship series.\n\nThe series was popular with smugglers and was favored by high-ranking Imperial Security Bureau agents. Many also found their way into the forces of the Rebellion, and later served in the New Republic.\n\n'''Source''':\n\n*Converted Star Wars Gamer 2\n*[http://starwars.wikia.com/wiki/YZ-775_medium_transport Wookieepedia: YZ-775 medium transport]",
  "category": "transport",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/YZ-775%20Transport",
  "retrievedAt": "2025-10-10T19:14:49.234Z"
}