{
  "title": "Aar'aa",
  "pageId": 232,
  "revisionId": 20080,
  "wikitext": "[[File:Aaraa.jpg|thumb|An example of an Aar'aa.]]\n\n'''Species:''' Aar'aa <br />\n'''Home Planet:''' [[Aar]] <br />\n<br />\n='''Aar'aa'''= \nAar'aa were a reptilian sentient species native to [[Aar]]. The Aar'aa are a species of color-changing aliens from the planet [[Aar]] who have come to be known as \"skin-changers.\" They are made famous around the galaxy due to the nature of their color-changin skin; given enough time, an Aar'aa can change his skin tone to exactly match the backdrop against which he is set. The Aar'aa are reptiles who often become sluggish in extremely cold temperatures; however, their unique ability to avoid detection makes them highly prized in fields where stealth is called for. The Aar'aa are many times employed as assasins, bounty hunters, bodyguards, thieves, and more. <br />\n<br />\n='''Biology & Appearance:'''=\nAar'aa are tall, reptilian humanoids with pebbly, scaly skin covering most of their bodies. From their head all the way down their backs is a crest of skin, which bends and folds slightly as their moods shift. Aar'aa have clawed hands and feet, and thick brows that hang over their small, glowing eyes. Their skin has a natural pigment which alters itself over time to blend them into the background, which was used in the creation of Mimetic Armor.\n<br />\n<br />\n='''Personality:'''=\nAar'aa, like most reptilian species, have a somewhat different mindset than that of their warm-blooded companions. They are sometimes aloof and other times threatening, moving between moods quickly especially when there is a drastic change in temperature. Many are very confident to the point of arrogance, as over the years they have realized the extent of their usefulness in the galaxy and have, in turn, made themselves think that they are more highly prized than they are. In addition to their arrogance and quick tempers, the Aar'aa are a very secretive lot, perhaps a throwback to the evolutionary changes that caused them to be such notorious hiders in the first place. <br />\n<br />\n='''Language:'''= \nAar'aa speak their native tongue or Aarese. Basic is difficult for them, but they can manage a highly-accented version of it similar in sound to the accented Basic spoken by Trandoshans. <br />\n<br />\n='''Names:'''= \nAar'aa names are very similar to those taken by Trandoshans.<br />\n<br />\n='''Aar'aa in the Galaxy:'''=\nAar'aa are found offworld in a variety of pursuits involving stealth and infiltration. Many worked on [[Ylesia]] for the Hutts, and they can also be found as thieves and assasins for many major crime rings. \n\nAar'aa were often associated with Hutt syndicates. Several Aar'aa served as guards for the t'landa Til \"religious retreat\" on [[Ylesia]] run by the [[Besadii kajidic]]. [[Pohtarza]] was assassinated by an Aar'aa employed by Jabba.\n\nApparently, they considered [[MSE-6 mouse droids]] somewhat appetizing. <br />\n<br />\n='''''Attributes & Abilities'''''=\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 2D+2/4D+1<br />KNOWLEDGE 2D/4D<br />MECHANICAL 1D+2/3D+1<br />PERCEPTION 2D+2/4D+1<br />STRENGTH 2D/4D<br />TECHNICAL 1D+2/3D+1<br />\n<br />\n\n== '''Special Abilities:''' ==\n\n''Claws:'' STR+1D damage\n\n''Skin-Changing:'' By spending 1 full round standing against a solid surface, a skin-changer gains a +4D bonus to all Sneak checks. For particularly complex patterns to mimic, as much as 3 rounds may be required, depending on the Gamemaster's decision. <br />\n<br />\n\n== '''Story Factors:''' ==\n\n''Sluggishness in Cold Weather:'' Aar'aa become sluggish in particularly cold weather. At the GM's option, Aar'aa characters may suffer a -1D penalty to all Dexterity and Strength skills in cold weather environments.<br />\n<br />\n'''Size:''' 1.4-2.0 meters <br />\n'''Move:''' 10/12 <br />\n\n='''Source:'''= \nWookieepedia (For the Aar'aa description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Aar'aa",
  "retrievedAt": "2025-10-07T21:04:13.021Z"
}