{
  "title": "Abyssin",
  "pageId": 7227,
  "revisionId": 20074,
  "wikitext": "[[File:Abyssin.jpg|thumb|right|500px|An Abyssin]]\n\n='''Abyssin'''=\n'''Species:''' Abyssin <br />\n'''Home Planet:''' [[Byss]] <br />\n<br />\n'''Abyssin''' <br />\nAbyssin were a people who were often described as \"primitive and violent\", and were often hired as petty thugs. They inhabited the arid desert planet [[Byss]], where they lived as nomadic herders. At about two meters tall, the hulking, humanoid Abyssin had long limbs and a single large eye that dominated their greenish-tan foreheads. <br />\n<br />\n='''Society & Culture:'''=\nAbyssin could heal quickly and regenerate any body part, which some believe contributed to an especially violent racial culture. Their fast regeneration is believed to have been an adaptation to prevent fluid loss from bleeding. Because of their regenerative abilities, Abyssin could live up to 300 standard years. Elderly Abyssin lost these regenerative abilities, and either voluntarily exiled themselves to die in the desert or were ritually killed by their tribe. \n\nWhen two Abyssin tribes met, they would interact peacefully through trading only if both groups had plentiful water and food supplies. Otherwise, they began a \"Blooding\", a brawl which ended only when one tribe's warriors were all killed, captured, or incapacitated. Warriors who survived a Blooding were usually allowed to join the winning tribe once they finished regeneration. This tradition led to some violent incidents when spacers tried to trade with Abyssin tribes with scarce water resources, especially since the Abyssins assumed the alien traders could regenerate as quickly as they did. \n\nExamples of Abyssin names included [[Anami]], [[Easym]], [[Mador]], and [[Polcyc]]. <br />\n<br />\n='''Abyssin in the Galaxy:'''= \nAbyssin were uncommon in the greater galaxy. Those who were found off [[Byss]] were often slaves, bodyguards, or mercenaries. Abyssin were sometimes referred to as \"monocs\", \"cyclops\", or \"One-Eye\". The Abyssin generally found these terms insulting, and would often react violently to them. \n\nA number of Abyssin lived on [[Phaeda]] and [[Dubrava]].<br />\n<br />\n='''Notable Abyssin:'''=\nSome Abyssin found in the Galaxy were: \n\n*[[Myo]] \n*[[Qawohl]] \n*[[Quarmall]] \n*[[Sadie]] \n*[[Seh-Run]] \n*[[Vomak]] <br />\n<br />\n='''Attributes'''=\n'''Attribute Dice''' 12D<br />'''DEXTERITY''' 1D+2/4D<br />'''KNOWLEDGE''' 1D/3D+2<br />'''MECHANICAL''' 1D/3D<br />'''PERCEPTION''' 1D/3D<br />'''STRENGTH''' 2D/4D<br />'''TECHNICAL''' 1D/2D+2<br />\n<br />\n'''Special Skills:'''<br />\n*'''Survival:''' Desert: During character creation, Abyssin receive 2D for every 1D placed in this skill specialization, and, until the skill reaches 6D, advancement is half the normal Character Point cost.<br />\n<br />\n'''Special Abilities:''' <br />\n*'''Regeneration''': Abyssin have this special ability at 2D. They may spend beginning skill dice to improve this ability as if it were a normal skill. Abyssin roll to regenerate after being wounded using these skill dice instead of their Strength attribute - but turn “days” into “hours”. So, an Abyssin who has been wounded rolls after three standard hours instead of three standard days to see if he or she heals. In addition, the character’s condition cannot worsen (and mortally wounded characters cannot die by rolling low).<br />\n<br />\n'''Story Factors:'''<br />\n*'''Violent Culture:''' The Abyssin are a primitive people much like the Tusken Raiders: violent and difficult for others to understand. Abyssin approach physical violence with a childlike glee and are always eager to ﬁght. However, they are slightly less happy to be involved in blaster ﬁghts and are of the opinion that starship combat is incredibly foolish, since you cannot regenerate once you have been explosively decompressed (this attitude has become generalized into a dislike of any type of space travel). It should be noted that the Abyssin do not think of themselves as violent or vicious. Even during a ferocious blooding, most of those involved will be injured, not killed - their regenerative factor means that they can resort to violence ﬁrst and worry about consequences later.<br />\n<br />\n'''Move:''' 8/12 <br />\n'''Size:''' 1.7-2.1 meters tall <br />\n\n=='''Sources'''==\n\n*Galaxy Guide 4: Alien Races (P. 5-7) & Wookieepedia (For the Abyssin description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Abyssin",
  "retrievedAt": "2025-10-07T21:04:13.847Z"
}