{
  "title": "Adarian",
  "pageId": 7228,
  "revisionId": 20068,
  "wikitext": "[[File:Adarianer.jpg|thumb|right|500px|An Adarian]]\n\n'''Species:''' Adarian <br />\n'''Home Planet:''' [[Adari]]<br />\n'''Adarian''' <br />\nAdarians were humanoids from the planet [[Adari]] in the [[Inner Rim]], although [[Adari]] was not believed to be their original homeworld. They had a strict social tier system. <br />\n<br />\n'''Biology & Appearance:''' <br />\nAdarians had elongated skulls penetrated by a large hole. They lacked ears and noses, but their skulls were covered in fine hairs which were very sensitive to sound waves, and their skin underlaid by glands that allowed them to smell. They had sharp, bony ridges around their mouths instead of lips. The Adarians had distendable throat pouches, elongating them to emit a loud call which helped in communication over long distances. <br />\n<br />\n'''Culture & History:''' <br />\nAdarian society was based around a rigid caste system known as screel'sara. Their governmental headquarters was the Hall of Decisions. They had unique, advanced carbon-ice drive technology. Their native language was Adarese. \n\nOne Adarian served as a junior officer in the Republic Military at the Battle of [[Sebaddon]] during the Cold War. \n\nThe Adarians signed a non-aggression treaty with the Galactic Empire gaining neutrality in the Galactic Civil War in return for unlimited raw materials. They were represented in the Imperial Senate. Individuals of the race included [[Ador Beldune]], [[Yeeru Chivkyrie]], [[Denka Melru]], [[Luur Tenefor]], and [[Yeeru Meekel]]. <br />\n<br />\n'''Common Adarian Names:''' <br />\n*[[Ador Beldune]] \n*[[Denka Melru]] \n*[[Luur Tenefor]] \n*[[Yeeru Meekel]] <br />\n<br />\n'''Attribute Dice''': 12D<br />'''DEXTERITY''' 1D+1/3D+1<br />'''KNOWLEDGE''' 2D/4D<br />'''MECHANICAL''' 2D/4D<br />'''PERCEPTION''' 1D/3D+2<br />'''STRENGTH''' 1D+2/3D+2<br />'''TECHNICAL''' 2D/4D+1<br />\n<br />\n'''Special Skills:''' <br />\n*'''(A) Carbon-Ice Drive Programming / Repair''': Time to use: Several minutes to several days. This advanced skill is used to program and repair the unique starship interfaces for the Carbon-Ice-Drive, a form of macro-scale computer. The character must have a computer programming/ repairskill of at least 5D before taking Carbon-Ice Drive programming/ repair, which costs 5 Character Points to purchase at 1D. Advancing the skill costs double the normal Character Point cost; for example, going from 1D to 1D+1 costs 2 Character Points.\n*'''(A) Carbon-Ice Drive Engineering''': Time to use: Several days to several months. This is the advanced skill necessary to engineer and design Carbon-Ice Drive computers. The character must have a Carbon-Ice Drive programming/ repair skill of at least 5D before purchasing this skill, which costs 10 Character Points to purchase at 1D. Advancing the skill costs three times the normal Character Point cost. Designing a new type of Carbon-Ice Drive can take teams of engineers several years of work.\n\n'''Special Abilities:'''<br />\n*'''Search''': When conducting a search that relies upon sound to locate an object or person, an Adarian receives a +2D bonus, due to his or her extended range of hearing. Adarians can hear in the ultrasonic and subsonic ranges, so thus will be able to hear machinery or people at extremely long distances (up to several kilometers away).\n*'''Languages''': When speaking languages that require precise pronunciation (Basic, for example), an Adarian suffers a -1D penalty to this skill. When speaking languages that rely more upon tonal variation (Wookiee, for example), the Adarian suffers no penalty.\n*'''Adarian Long Call''': Time to use: Two rounds. By pufﬁng up the throat pouch (which takes one round), an Adarian can emit the subsonic vocalization known as the long call. This ultra-low-frequency emission of sound waves has a debilitating effect on a number of species (particularly humans), causing disorientation, stomach upset, and possible unconsciousness. Any character standing within ﬁve meters of an Adarian who emits a long call suffers 3D stun damage. Strength may be used to resist this damage, but plugging the ears does not help, since it is the vibration of the brain and internal organs that does the damage. The long call may only be used safely three times per standard day; on the fourth and successive uses of the long call in any 24-hour period, an Adarian suffers stun damage himself or herself (but can use Strength to resist this damage). The long call has no debilitating effects on other Adarians. It can however, be heard by them up to a distance of 20 kilometers in quiet, outdoor settings.\n\n'''Story Factors:'''<br />\n*'''Caste System''': Adarians are bound by a rigid sceel’saracaste system and must obey the dictates of all Adarians in higher castes. Likewise, their society is run by a planetary corporation, so all Adarians must obey the requests of this corporation, often to the detriment of their own desires and objectives.\n\n'''Move''': 10/12<br />\n'''Size''': 1.5-2 meters tall<br />\n'''Source''': Galaxy Guide 12 – Aliens: Enemies and Allies (pages 7-9), Ultimate Alien Anthology (pages 8-9) & Wookieepedia (For the Adarian description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Adarian",
  "retrievedAt": "2025-10-07T21:04:14.272Z"
}