{
  "title": "Advozse",
  "pageId": 7230,
  "revisionId": 20065,
  "wikitext": "[[File:Advosze.jpg|thumb|500px|right|An Advosze]]\n\n'''Species:''' Advozse <br />\n'''Home Planet:''' [[Riﬂor]] <br />\n'''Advozse''' <br />\nAdvozsec (singular: Advozse) were a humanoid species, easily distinguished by the single horn on top of their hairless heads. Their home planet of [[Riflor]] was geologically unstable, with frequent volcanic eruptions: a condition which shaped their culture and their place in the galaxy. <br />\n<br />\n'''Biology & Appearance:''' <br />\nAlthough they were classified as mammals, Advozsec were nearly hairless. They had a single black horn at the crown of their heads, four digits on each hand and foot, pointed ears, and large black eyes. Their skin varied from yellow to dark brown.\n\nThe Advozsec home planet of Riflor was geologically unstable, with frequent volcanic eruptions. The large, black eyes of the Advozsec were adaptations to the clouds of volcanic ash which darkened Riflor's skies. Though they were most comfortable in the naturally dim light of their homeworld, Advozsec could adjust to Human-standard levels of light with minimal discomfort. \n\nAdvozsec were strictly vegetarian, being unable to properly digest meat. Nevertheless, at least some members of the species had sharp teeth. <br />\n<br />\n'''Society & Culture:''' <br />\nSince so much of the sunlight on Riflor was blocked by volcanic eruptions, Advozsec tended to settle near geothermal springs for heat. Unfortunately, these springs also tended to be in geologically unstable regions, and anything built near them was often destroyed or abandoned due to eruptions or groundquakes. As a result, the Advozse people ended up having little attachment to material goods or long-term plans, and developed a pessimistic, selfish, and even paranoid outlook on life. This facet of their culture remained long after contact with the Galactic Republic gave them access to modern construction techniques allowing for more permanent buildings. \n\nAdvozsec generally used a first name and a second name. Typical names included [[Kol Nurn]], [[Roda Lem]], and [[Vel Ramdro]]. Other Advozsec, such as the warlord [[Tulak]] and his son [[Kalut]], were only known by a single name. <br />\n<br />\n'''Advozse in the Galaxy:''' <br />\nAs part of galactic society, the skeptical and control-oriented Advozse temperament led many of them into bureaucratic careers with large corporations or the Republic. Other Advozsec were enemies of the Republic, however. These included an Advozse Sith Lord who joined the [[Brotherhood of Darkness]], the warlord [[Tulak]] who ravaged the planet [[Koba]] in circa 300 BBY, and Tulak's son [[Kalut]], who attacked [[Koba]] a century later. \n\nUnder the Galactic Empire, Advozsec were cut off from planetary decision making when the Imperials took control of Riflor's rich mining operations. While most Advozsec supported the Empire, with many serving in its bureaucracy, the Imperial forces on [[Riflor]] had to put down several protests demanding a greater Advozse voice. Some Advozsec turned to smugglers or became smugglers themselves to get around high Imperial tariffs. [[Bom Vimdin]], a smuggler who was often seen at the [[Mos Eisley Cantina]], was one of the most prominent Advozsec during the Galactic Civil War. Another Advozse involved with illicit trade, [[Gjeel Dhantra]], served as majordomo for [[Pok Nar-Ten]], the [[Klatooinian Trade Guild]] representative on [[Boztrok]]. \n\nOne famous Advozse was [[Grelk Micabra]], who was a swoop racing champion of the [[Corellian sector]]. \n\n[[Riflor]] was devastated by the [[Yuuzhan Vong]] during their attack on the galaxy, presumably killing many Advoszec. <br />\n<br />\n'''Attribute Dice:''' 11D<br />'''DEXTERITY '''1D/3D+1<br />'''KNOWLEDGE '''1D/4D<br />'''MECHANICAL '''1D/4D<br />'''PERCEPTION '''1D/4D<br />'''STRENGTH '''1D/3D+2<br />'''TECHNICAL '''1D/3D+2<br />\n<br />\n'''Move:''' 9/11<br />\n'''Size:''' 1.3-1.9 meters tall<br />\n'''Source:''' Galaxy Guide 12 – Aliens: Enemies and Allies (pages 10-12), Ultimate Alien Anthology (page 9) & Wookieepedia (For the Advozse description).",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Advozse",
  "retrievedAt": "2025-10-07T21:04:15.070Z"
}