{
  "title": "Aganof",
  "pageId": 7494,
  "revisionId": 20062,
  "wikitext": "[[File:aganof.jpg|right|thumb|Aganof]]\n\n'''Species:''' Aganof <br />\n'''Home Planet:''' [[Kuras III]]<br />\n<br />\n'''Aganof''' <br />\nAganof were non-humanoid sentients native to the underground caves of [[Kuras III]] in [[Elrood sector]]. They had long bodies that moved low to the ground on rows of small \"legs\". Their dorsal side was lined with heat-dissipating flaps and olfactory stalks. Beneath each flap was a small mouth that caught tiny creatures attracted to the flap's heat. Each end of the Aganof body ended in a jointed limb tipped with a sharp claw. Blind and deaf, Aganof relied on vibrations and scents for communication. \n\nAganof were hermaphroditic: all Agonof could lay fertilized eggs in the spawning caves. While highly intellectual and philosophical, they knew little of the galaxy beyond their caves, and had little in the way of contact with the surface-dwelling Pulras and Hairy Savages. \n\nThey considered infectious moss a delicacy, and there was the possibility that an infected humanoid could persuade the Aganof to eat the moss off their bodies. <br />\n<br />\n'''Attribute Dice:''' 11D <br />DEXTERITY 1D/2D<br />KNOWLEDGE 1D/4D<br />MECHANICAL 1D/2D<br />PERCEPTION 1D/4D+2<br />STRENGTH 1D/3D<br />TECHNICAL 1D/3D<br />\n<br />\n'''Special Skills:''' <br />\n''Vibration Detection:'' Aganof use this skill to detect ground vibrations and determine the proximity of creatures and beings around them. The difﬁculty depends on the distance and type of vibration: They can also detect air vibrations, such as temperature change and movement, and thus can sometimes detect approaching ﬂying creatures, or even sense incoming projectiles and dodge them. Aganof also use their hard shells and this skill for “speech” through ground vibrations, as naturally as humans use their mouths and sense of hearing for speech.<br />\n<br />\n'''Special Abilities:''' <br />\n''Blind and Deaf:'' Aganof cannot see in the way that humans can; they also cannot hear in the traditional sense, but they can detect intense air vibrations. Their prime extrenal sense is touch and a sensitivity to ground vibrations. By judging the intensity and frequency of vibrations, in combination with the type of surface they are standing on, they can detect creatures near them.\n\n''Claws:'' Aganof can use their claws to inﬂict STR+1D+2 damage. <br />\n<br />\n'''Move:''' 4/6 <br />\n'''Size:''' 1.3-2.5 meters tall, 1.5-3.5 meters long <br />\n'''Notes:''' <br />\n*Distance from Vibration Modiﬁer 0-2 meters 0 3-10 meters +5 to difﬁculty 11-30 meters +10 to difﬁculty 31+ meters +15 or more to difﬁculty Strength of Vibration Difﬁculty\n\n*Light vibration (as made by a small creature)\n\n*Difﬁcult Moderate vibration (as made by a creature 20-100 kilograms) Easy\n\n*Heavy vibration (such as made by a much larger creature) Very Easy\n\n*Soil Type Modiﬁer Loose soil, easily carriers vibration -5 or more Packed soil, material that absorbs vibration 0 Soils or materials absorbing virtually all vibration +5 or more\n\n'''Source:''' Alien Encounters (pages 20-21), Planets Collection (pages 180-181) & Wookieepedia for the Aganof description",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Aganof",
  "retrievedAt": "2025-10-07T21:04:16.202Z"
}