{
  "title": "Akwin",
  "pageId": 7495,
  "revisionId": 33219,
  "wikitext": "[[File:akwin.jpg|right|thumb|500px|Akwin]]\n\n'''Species:''' Akwin <br />'''Home Planet:''' [[Lazerian IV]] <br />'''Akwin:''' <br />Akwin were a species of sentient oceanic mammals that were indigenous to the Father Ocean of [[Lazerian IV]]. A carnivorous species, they possessed blue-green fur and six limbs; two arms ending in tridactyl hands, two arms ending in flippers, and two legs ending in webbed feet. Their tails, flat and with a marked fluke, were used for forward propulsion while in the water. Akwin heads were long, flat, and covered in cilia ranging in color from white to blue to black. Akwin had two blowholes atop their heads, as well as gills. The Akwin were pacifistic, dwelling in sprawling underwater cities and keeping underwater ranches. The Akwin believed themselves superior to the Humans who walked the surface of [[Lazerian IV]], whom they knew a great deal about due to special scouts, but whom were deluded into thinking of the Akwin simply as legendary. \n\n\n'''Attribute Dice:''' 12D<br />'''DEXTERITY''' 2D/6D<br />'''KNOWLEDGE''' 2D/5D<br />'''MECHANICAL''' 2D/4D<br />'''PERCEPTION''' 2D/7D<br />'''STRENGTH''' 2D/3D<br />'''TECHNICAL''' 2D/3D\n\n'''Special Skills:'''\n*'''Swimming:''' Akwin get +1D to their swimming skill.\n*'''Akwin Net Guns:''' Akwin use metal mesh nets that deliver a shock to the victim (stun damage 5D). The mesh nets are shot from a riﬂe-like device. Each riﬂe carries two nets. In order for a victim to free himself from the net, he must make a Difﬁcult Dexterity roll.\n\n'''Special Abilities:'''\n*'''Hearing:''' Akwin have very sensitive hearing, giving them +1D to search uses involving noise.\n*'''Sight:''' Akwin eyes are attuned to ocean depths. They receive +1D to search underwater, but suffer -2D on land.\n\n'''Move:''' 10/15 (swimming), 5/7 (walking)<br />'''Size:''' 1.5-1.8 meters long\n\n'''Source'''\n*Alien Encounters (page 22), Twin Star of Kira (pages 15-17) & Wookieepedia (For the Akwin Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Akwin",
  "retrievedAt": "2025-10-07T21:04:17.024Z"
}