{
  "title": "Alarian",
  "pageId": 233,
  "revisionId": 14141,
  "wikitext": "'''HOMEWORLD:''' Unrecorded\n\n'''ATTRIBUTE DICE:''' 11D<br />\n\n'''DEXTERITY:''' 1D+1/3D<br />\n'''KNOWLEDGE:''' 2D/4D<br />\n'''MECHANICAL:''' 1D+2/3D+1<br />\n'''PERCEPTION:''' 1D+1/3D+2<br />\n'''STRENGTH:''' 2D/4D+2<br />\n'''TECHNICAL:''' 1D/2D+2<br />\n\n'''Move''': 7/9<br />\n'''Average Height''': 1.2 - 1.7 meters<br />\n\n'''Special Abilities:'''\n\n*'''Claw:''' Str+1D+2 damage\n*'''Resilient:''' All Alarians get +2D when rolling Str vs. intoxication, poison, sickness, etc.\n*'''Primitive:''' Native-born Alarians cannot start out with any space level skills (i.e. any starship, computer, blaster, or droid skills).\n\n'''Story Factors:'''\n*'''Oppression:''' The Empire enslaved this race and almost wiped it out.&nbsp; This species was on the verge of discovering electricity when discovered by the Empire.&nbsp; They were enslaved an almost driven extinct. The Rebellion never found this system, and the natives are still under human control.&nbsp; The Empire may be gone, but Imperial humans remain a strong factor on the planet.\n*'''Personality:'''Alarians are surprisingly peaceful for a carnivorous species.&nbsp; They have had no major wars, and they only use their primitive firearms to hunt. Alarian homes are usually one level, and their villages are small, with no agriculture.&nbsp; They only used their planet's vast fertile areas for raising livestock.&nbsp;\n\n'''Physical Appearance:''' \n\nAlarians are mammal-like reptiles, an evolutionary crossroads between the two kinds of animals.&nbsp; They have an ursine appearance, but below their fur is a layer of pebbly scales.&nbsp; They have a rough, hairless ridge running up the top of their heads.&nbsp; Their hands and feet are hairless, as are the tough elbow and kneecaps.&nbsp; Their hands have opposable thumbs, two main fingers and a smaller end digit, while their saurian feet are three toed.&nbsp; All digits have large claws.&nbsp; They are also relatively thin, but short.&nbsp; Their fur ranges from black to light brown, and their eyes are yellow and slitted like a reptile's.&nbsp; They subsist completely on meat, preferably eaten cooked.&nbsp; They wear little clothing, for their planet is warm and comfortable all year round.&nbsp; Alarians fear the cold, but they can survive in it.&nbsp; Alarians are born in eggs, but these eggs are incubated and hatched inside the female, so the young are \"born\" fully able to survive.\n\n'''Language:''' They have a complicated writing system, and their language is unpronounceable by humans (though Alarians can speak Basic perfectly well).\n\n== '''Source:''' ==\nUnofficial",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Alarian",
  "retrievedAt": "2025-10-07T21:04:17.414Z"
}