{
  "title": "Aleena",
  "pageId": 7496,
  "revisionId": 33220,
  "wikitext": "[[File:aleena.jpg|right|thumb|Aleena]]\n\n'''Species:''' Aleena <br />'''Home Planet:''' [[Aleen]] \n\n'''Aleena''' <br />The Aleena were a species of small, sentient aliens from the planet [[Aleen]]. \n\n\n'''Biology & Appearance:''' \n\nAleena were short, reptilian bipeds with large eyes and wide mouths full of small, sharp teeth. Aleena's bodies were long compared to their short arms and stubby legs. They possessed exceptional reflexes as well as a fast metabolism which allowed them to convert food into energy very rapidly in order to escape predators on their harsh home planet. \n\n'''Society & Culture:''' \n\nAleena were social and tended to thrive best in with close-knit teams if not with their own kind. They developed strong loyalties to friends and protected those they cared about fiercely. Due to their inborn curiosity, the Aleena were stereotypically galactic travelers, tourists in every sense. This, combined with their strong dedication to their relatives, resulted in Aleena families traveling even to most unusual and dangerous locations just to see its sights. The appearance of Aleena family walking through an intergalactic metropolis was a common sight on many planets. \n\n'''Scouts:''' \n\nDue to their small stature, Aleena were sometimes used as scouts for different militaries. Several squads of Aleenan scouts loyal to the Galactic Republic performed reconnaissance missions during the Clone Wars. They saw service on [[Kashyyyk]], performing reconnaissance on the CIS forces fighting there. They were given domesticated can-cells for rapid transportation, as individual Aleena were small enough to ride on the animal's back. The Master Choi flew with the scouts during this campaign. \n\n'''Aleena in the Galaxy:''' \n\nThe Aleena love of sports and particularly, adventure and thrill sports, drew many into the galactic community. Most who entered professional classes were experts or diplomats. They traveled to feed their love of adventure and new experiences. Many Aleena used their natural high reflexes to become podracers, most notably [[Ratts Tyerell]] and [[Mab Kador]]. Aleena were also known to become Jedi—an example of Aleena Jedi was Master [[Tsui Choi]], who fought in the Clone Wars. An Aleena Dark Jedi was [[Kazdan Paratus]], who managed to survive [[Order 66]] and went into hiding on the toxic environmental planet [[Raxus Prime]], where he fell to the dark side. \n\n'''Attribute Dice:''' 12D<br />'''DEXTERITY''' 2D/5D<br />'''KNOWLEDGE''' 1D/3D<br />'''MECHANICAL''' 1D+2/3D+2<br />'''PERCEPTION''' 3D/4D+2<br />'''STRENGTH''' 1D/2D<br />'''TECHNICAL''' 1D/3D\n\n'''Special Abilities:'''\n*'''Exceptional Reﬂexes:''' Gain a +1D bonus to all Perception rolls made to determine initiative.\n*'''Furtive:''' At character creation only, Aleena characters get 2D for 1D spent on hide, sneak and search.\n*'''Numb Senses:''' Aleena are incapable of sensing smell or taste, therefore they automatically fail Perception tests based on these senses.\n\n'''Move:''' 4/6<br />'''Size:''' 0.6 meters tall on average<br />'''Source:''' Wookieepedia (For the Aleena Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Aleena",
  "retrievedAt": "2025-10-07T21:04:17.797Z"
}