{
  "title": "Anguilla",
  "pageId": 7498,
  "revisionId": 33222,
  "wikitext": "[[File:anguilla.jpg|thumb|right|Anguilla]]\n\n'''Species:''' Anguilla <br />'''Home Planet:''' [[Alluuvia]]\n\n'''Anguilla''' \n\nAnguilla were oceanic sentients indigenous to [[Alluuvia]] in [[Elrood sector]]. \n\n'''Biology & Appearance:''' \n\nThey resembled long, muscular eels with long arms and powerful hands. Primitive, nomadic hunters who followed fish school migrations, they determined leadership in tests of strength known as Rites of Conch-tar. \n\n'''History:''' \n\nThey were discovered not long after the Battle of [[Yavin]]. A bigoted Imperial Private shot the first Anguilla he saw upon arrival on the planet on sight, and his fellow Imperial soldiers followed suit, leading to a massacre. The Anguilla were led by [[Anyar]], in cooperation with the Rebel Alliance, in destroying the [[Imperial Mining, Limited]] base on [[Alluuvia]]. [[Anyar]] negotiated for [[Radell Mining Corporation]] to mine the minerals that filled Alluuvia's oceans (thus toxic to Humans) on the condition the mining was overseen by [[Iych-thae]], an [[Ithorian]]. \n\n'''Attribute Dice:''' 12D<br />'''DEXTERITY''' 2D/4D+2<br />'''KNOWLEDGE''' 2D/4D<br />'''MECHANICAL''' 0D/2D<br />'''PERCEPTION''' 1D/4D+1<br />'''STRENGTH''' 2D/5D<br />'''TECHNICAL''' 0D/2D\n\n'''Special Abilities:'''\n*'''Swimming:''' Anguilla are natural swimmers and receive +3D to all swimming rolls.\n*'''Slippery Skin:''' Because of their slippery skin, all brawling rolls (including grappling attacks) against Anguilla are at a +10 penalty.\n*'''Bite:''' STR+1D damage.\n*'''Vision:''' Anguilla can see in the infrared spectrum, allowing them to see in complete darkness provided there are heat sources. They suffer no penalties in darkness.\n*'''Enhanced Senses:''' Anguilla have an incredible sense of smell when in Alluuvia’s oceans. With an Easy search or Perception total, they can detect predators up to 300 meters away and they can detect Imperials and their vehicles (because of their “alien” scent) up to two kilometers away. They lose this bonus when out of water.\n\n'''Story Factors:'''\n*'''Primitive Culture:''' The Anguilla are technologically primative and do not know skills that rely on advanced technology.\n*'''Languages:''' Anguilla have learned only a few basic words; some Anguilla know the Ithorian language fairly well. They have a natural aptitude for languages and with an Easy languages roll, they can understand the gist of a statement. Those trying to understand an Anguilla need a Moderate languages roll.\n\n'''Move:''' 2/4 (slithering), 14/18 (swimming)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Anguilla",
  "retrievedAt": "2025-10-07T21:04:18.588Z"
}