{
  "title": "Ansionian",
  "pageId": 7501,
  "revisionId": 19791,
  "wikitext": "[[File:Ansionian.jpg|thumb|]] \n\n'''Homeworld:''' [[Ansion]]\n\n'''Attribute Dice:''' 12D\n\n'''DEXTERITY''' 2D/4D<br />\n\n'''KNOWLEDGE''' 2D/4D<br />\n\n'''MECHANICAL''' 2D/4D<br />\n\n'''PERCEPTION''' 3D/4D+2<br />\n\n'''STRENGTH''' 1D+1/3D+1<br />\n\n'''TECHNICAL''' 2D/3D+2<br />\n\n'''Special Abilities:'''\n*'''''Teeth:''''' The ansionian’s sharp, pointed teeth do STR+1 damage\n*'''''Darkvision:''''' Ansionian characters can see up to 20 meters in total darkness.\n\n'''Special Ablities:'''\n*'''''Second Heart:''''' An endurance roll on an moderate difficulty allowes the Ansionian to activate his second heart if the first one doesnt work<br/>''(Example: Mortal and deadly wounds on an Ansonian will not cause death if the endurance roll is successful. He is then only unconscious.)''\n'''Move:''' 10/12<br />\n'''Size:''' 1.5-1.6 meters\n\n'''Story Factors'''\n*The '''Ansionians''', the indigenous species of Ansion, were slender humanoids with pale-yellow skin. Shorter than the average Human, they were hairless save for a single brush of dense fur about fifteen centimeters wide and around seven centimeters tall that ran from their foreheads to the tip of a short tail, which were usually fifteen centimeters long. Although the color varied naturally across the whole spectrum, many Ansonians dyed their manes in a variety of colors and patterns.\n\n*They had one nostril, and their hands ended in three long fingers. Although omnivorous, Ansionians ate proportionately more meat than Humans and as such had a mouth full of very sharp, pointed teeth. Their large eyes, usually in some shade of red but occasionally mauve or light yellow, were particularly well suited for seeing in the dark and had small black pupils. Their eyelids closed from the outside towards their nose. They had multiple hearts.\n\n*Ansionians had naturally loud laughs, and always went by only a single name.",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Ansionian",
  "retrievedAt": "2025-10-07T21:04:20.192Z"
}