{
  "title": "Anx",
  "pageId": 235,
  "revisionId": 19790,
  "wikitext": "[[File:Anx.jpg|thumb|An example of an Anx.]] \n\n[[File:Anx2.jpg|thumb|Anx senators.]] \n\n'''Attribute Dice: '''12D\n\n'''DEX''' 1D+1/4D<br />'''KNO''' 1D/3D+2<br />'''MEC''' 1D+1/4D<br />'''PER''' 1D/3D+2<br />'''STR''' 2D/4D+2<br />'''TEC''' 1D+1/4D\n\n== '''Special Abilities:''' ==\n:'''Blindsight:''' Anx have exceptionally poor eyesight, and instead use sense organs along their crests, knees, and elbows to \"smell\" the world around them.\n:'''Communication at a Distance:''' Anx speak in a booming, low-frequency language that other Anx can hear up to five kilometers away.\n:'''Increased Hand-to-Hand Damage:''' Due to their physiology, Anx characters add +1D to their Strength score when rolling their hand-to-hand damage.\n\n== '''Story Factors:''' ==\n:'''Fin Cloaks:''' The skin and fins of an Anx change colors to reflect their emotions, making an Anx's basic mood easy to decipher. As a result, Anx characters often wear fin cloaks that make it more difficult for others to interpret their emotions. An Anx without a fin cloak suffers a -2D penalty to all Bargain and Con skill checks.\n:'''Size:''' 4 meters tall on average\n:'''Move:''' 12/14\n\n== '''Personality:''' ==\n\n\n\n:Sociable creatures, they possessed an incredible devotion to any group of which they felt a part. To compensate for poor eyesight, Anx had an acute sense of smell. They also tended to possess a formidable knowledge of anatomy, especially nerves, muscles and bone structures, making them dangerous unarmed combatants and skilled warriors, capable of defeating most opponents.\n\n== '''Physical Description:''' ==\n\n:A large, reptilian species.&nbsp; They stand an average 4 meters in height.&nbsp; They have destinctive mood sensitive crests, pointed heads and tails.&nbsp; The species has poor eyesight but makes up for this with an acute sense of smell.&nbsp; Their language is comprised of low-frequency tones produced by the sins cavity found in their large headcrest.\n'''Home Planet:''' [[Gravlex Med]]\n\n'''Language:''' Anx Language\n\n'''Names:''' Famous names [[Ilox Arguun]], [[Horox Ryyder]], [[Madurrin]], [[Theen Fida]], [[J'Mikel]], [[Graxol Kelvyyn]], [[Zo Howler]] & [[Fo Kuna]]\n\n'''Adventurers: '''Unrecorded<br /><br /><br /><br />",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Anx",
  "retrievedAt": "2025-10-07T21:04:20.578Z"
}