{
  "title": "Aqualish",
  "pageId": 7233,
  "revisionId": 19565,
  "wikitext": "[[File:Aqualish.jpg|thumb|right|Aqualish]]\n\n'''Species:''' Aqualish <br />\n'''Home Planet''': [[Ando]] <br />\n'''Aqualish''' <br />\nThe Aqualish were tusked bipeds from the planet [[Ando]] whose appearance combined aspects of arachnids and pinniped aquatic mammals. Aqualish had a reputation for being nasty, crude and aggressive, and generally pursued off-world careers as mercenaries, bounty hunters, and pirates. One of the most infamous such Aqualish was the smuggler [[Ponda Baba]]. <br />\n<br />\n'''Biology & Appearance:''' <br />\nThe three types of Aqualish, the Aquala, the Ualaq (who were the result of genetic mutation), and the Quara, were distinguished by their hands and eyes. Aquala had finned hands, while the Ualaq and Quara had clawed, fingered hands. The fingered Aqualish also varied in the number of eyes—while the Quara, like the Aquala, had two eyes, the less-common Ualaq had four. While most Ualaq and Quara had claw-like hands with five fingers, some Ualaq had three-fingered hands with very thick digits. Though Ualaq and Quara only made up about ten percent of the Aqualish population, their fingered hands made them more comfortable with technology. Thus, they were the subspecies more commonly found off-world. Because the Aquala saw the Quara as responsible for the image the Aqualish had on the galaxy as thugs, the latter subspecies were considered pariahs on [[Ando]], which had a lower population of Aqualish than the galaxy itself. <br />\n<br />\n'''History:''' <br />\nAll three Aqualish subspecies spoke mutually intelligible dialects of the same language. Despite this, the unity between the three groups was shaky, with all three subspecies considering themselves the superior breed. One of the largest and most destructive of the resulting conflicts was the Aqualish Civil War. This war was initially started by the Aquala, who blamed the Quara and Ualaq for the declining harvests of fish.\n\nThe war did not end until explorers, believed to be from either [[Corellia]] or [[Duro]], arrived on [[Ando]]. The races of Ando united to destroy the \"invaders\", and learned the secret of space travel from the exploratory craft that they destroyed. The Aqualish forces set forth, beginning a series of bloody conflicts with a nearby sister world. They continued on a campaign of conquest, sparking the Aqualish-Republic War. After they were defeated—mainly because of the inferior Aqualish weaponry, limited to what they could scavenge from defeated enemies—their armies were carefully dismantled. As [[Ando]] joined the Galactic Republic, the violence became a black mark on the species's reputation, and the Republic initiated several attempts to demilitarize the Aqualish, each ending in conflicts like the Battle of Raquish and the Horos Spine Incident.\n\nBy 95 BBY, the Aqualish had colonized fifteen [[Mid Rim]] worlds that later formed the [[Andoan Free Colonies]]. During the Clone Wars, the Andoan Senator [[Po Nudo]] seceded from the Republic, aligning much of the Aqualish species and their homeworld with Count Dooku's Confederacy of Independent Systems. However, the [[Andoan Free Colonies]], represented by Senator [[Gorothin Vagger]], remained loyal to the Republic. Another Aqualish who remained loyal to the Republic during the Clone Wars was a Jedi Padawan [[Windo Nend]], who died fighting the CIS.\n\nUnder Palpatine's Galactic Empire, the Empire took over [[Ando]] and turned it into a police state to control the violent Aqualish. Several Imperial and corporate interests were also permitted to ravage Ando's natural resources. Though the Aqualish resented the Empire, they showed no interest in joining the Rebel Alliance. Still, by 9 ABY, Ando had joined the New Republic. This made the Aqualish homeworld the target of a feint attack by Grand Admiral Thrawn's Bellicose before his assault on [[Ukio]]. \n\nDuring the [[Yuuzhan Vong]] invasion in 25 ABY, [[Ando]] was offered to be spared by Warmaster [[Tsavong Lah]] if they destroyed all droid units and killed any Jedi on the planet. Thus, the Aqualish killed the Jedi Knight [[Dorsk 82]], only to be invaded and crushed regardless. <br />\n<br />\n'''Aqualish in the Galaxy:''' <br />\nA community of Whiphids and Aqualish lived in the planet [[Gertafuu VI]], trading with exotic foodstuff and furs. \n\nThere were also a number of Aqualish in Bartyn's Landing, the capital town of [[Lamaredd]], c. 29 BBY. <br />\n<br />\n'''Attribute Dice''': 12D<br />'''DEXTERITY '''2D/4D<br />'''KNOWLEDGE '''1D/3D<br />'''MECHANICAL '''1D+2/3D+2<br />'''PERCEPTION '''2D/4D<br />'''STRENGTH '''2D/4D+2<br />'''TECHNICAL '''1D+2/3D <br />\n<br />\n'''Special Abilities:''' <br />\n*'''Fins''': Aqualish are born with the natural ability to swim. They receive a +2D bonus for all movement attempted in liquids. However, the lack of ﬁngers on their hands decreases their Dexterity, and the Aqualish suffer a -2D penalty when using equipment that has not been specially designed for its ﬁns.\n*'''Hands''': The Quara do not receive the swimming bonus, but they are just as “at home” in the water. They also receive no penalties for Dexterity actions. The Quara are most likely to be encountered off-world.\n\n'''Story Factors:''' <br />\n*'''Belligerence''': Aqualish tend to be pushy and obnoxious, always looking for the opportunity to bully weaker beings. More intelligent Aqualish turn this belligerence into cunning and become manipulators.\n\n'''Move''': 9/12 (walking), 5/7 (swimming, Aquala only) <br />\n'''Size''': 1.8-2 meters tall <br />\n'''Source''': Ultimate Alien Anthology (page 14), Alien Anthology (page 55), Galaxy Guide 4: Alien Races (pages 13-14) & Wookieepedia (For the Aqualish Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Aqualish",
  "retrievedAt": "2025-10-07T21:04:21.390Z"
}