{
  "title": "Aramandi",
  "pageId": 7503,
  "revisionId": 19559,
  "wikitext": "[[File:Aramandi.png|thumb|right|Aramandi]] \n\n'''Species:''' Aramandi <br />\n'''Homeworld:''' [[Aram]] ([[Brak sector]] - [[Expansion Region]])<br />\n'''Aramandi''' <br />\nThe Aramandi were sapient mammalian bipeds indigenous to [[Aram]]. <br />\n<br />\n'''Characteristics:''' <br />\nThey had four arms and four eyes. Because of living for generations in Aram's heavy gravity, their bodies were short and stout. Their skin coloration ranged from pink to light brown, and their eyes were a solid black color. <br />\n<br />\n'''History:''' <br />\nAs a people, the Aramandi were governed by the religious beliefs of the Eeronon, and divided themselves into four distinct clans or akia: the Orma, Cirra, Mila, and Lota. The Aramandi jealously controlled the [[Aramand Cluster]], within [[Brak sector]], mainly because it was the the area of their birth. \n\nAs the [[Lant Mining Corporation]] exhausted its worlds, they began making overtures to the Aramandi, hoping to gain access to the Cluster. With the advent of the New Order, the Aramandi were also courted by the Galactic Empire, and given elaborate concessions to allow a simple garrison to be erected on [[Aram]]. In return, the Aramandi were left alone. <br />\n<br />\n'''''Attribute Dice:''''' 11D<br />\n'''DEXTERITY''' 2D/3D+2<br />\n'''KNOWLEDGE''' 2D/4D<br />\n'''MECHANICAL''' 1D/4D<br />\n'''PERCEPTION''' 2D/3D+2<br />\n'''STRENGTH''' 1D/3D<br />\n'''TECHNICAL''' 1D/3D <br />\n<br />\n'''Special Abilities:'''\n*'''''Breath Masks:''''' Whenever Aramandi are off of their homeworld or in non-Aramandi starships, they must wear special breath masks, which add minute traces of vital gases. If the mask is not worn, the Aramandi becomes very ill after six hours and dies in two days.\n*'''''Heavy Gravity:''''' Whenever Aramandi are on a planet with lighter gravity than their homeworld, they receive a +1D to Dexterity and Strength related skills (but not against damage), and add 2 to their Move.\n*'''''Climbing:''''' At the time of character creation only, the character receives 2D for every 1D placed in climbing/jumping.\n\n'''Move:''' 6/10 <br />\n'''Size:''' 1.0-1.5 meters tall <br />\n\n== Source: ==\nAlien Encounters (p. 24), Planets Collection (p. 66-69) & Wookieepedia (For the Aramandi Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Aramandi",
  "retrievedAt": "2025-10-07T21:04:22.588Z"
}