{
  "title": "Arcona",
  "pageId": 7505,
  "revisionId": 26390,
  "wikitext": "[[File:Arcona.jpg|thumb|Arcona]] \n\n'''Species:''' Arcona <br/>\n'''Home Planet:''' [[Cona]] <br/>\n'''Arcona''' <br />\nArcona, sometimes singular Arconan, were scaleless reptiles with humanoid bodies. Hailing from the tropical desert planet of [[Cona]] in the [[Teke Ro system]], they had poor eyesight, despite their large eyes, and had a small organ between their eyes which, often mistaken for their nose, helped them to see. \n\nAn Arcona's lifespan was roughly the same as a Human's. The Arcona lived in a family based community, where the males took care of the young, as the females were generally reckless and thrill-seeking. Despite not being a particularly technological species, by the time the Galactic Empire rose to power Arcona could be seen in every corner of the galaxy. They were also notorious for their easy addiction to common salt. <br />\n<br />\n'''Biology & Appearance:''' <br />\nThe Arcona had flat, anvil-shaped heads, sharp claws, clear, marble-like eyes, and skin tone that ranged from mahogany to ebony. [[Cona]], the native planet of the Arcona, was always hot, and had very little water. The atmosphere was filled with ammonia vapor. The Arcona adapted to this environment by eating the ammonia-converting roots of the complex flora of [[Cona]] as a source of water (the only water planet-wide). The Arcona depended on the ammonia to live and, as a result, Arcona living offworld had to take ammonia supplements or risk death. \n\nDespite their bulbous eyes, the Arcona had very poor eyesight. Their eyes could not detect fine shapes; and so they only saw blurry objects. To aid their poor eyesight, the Arcona had a small diamond shaped sensory organ between their eyes. Often mistaken for their nose, this organ detected heat patterns from living beings. Thus, the Arcona could recognize someone or something by its heat pattern. Like many reptiles, the Arcona had olfactory organs located in their ever moving tongues. This helped them distinguish objects in their environment that they otherwise could not make out and also gave them a keen sense of smell.\n\nArcona females were considered far more reckless and free-spirited than their male counterparts, and so the males usually raised the children. Arconas took much time courting a partner, and the commitment to marry was also a commitment to parent. Arconas were highly susceptible to salt addiction, which served as a hallucinogen. Their eyes shifted from green to gold after prolonged addiction. The Arcona lived in loose, family-based communities called nests, which were ruled by a Grand Nest. <br />\n<br />\n'''Culture:''' <br />\nArcona normally thought of themselves as a whole. Virtually, they had no individuality. They often referred to themselves as \"we\" even when only one was present. Because Arcona were born in nests underground they obtained a close sense of family living in close quarters with brothers and sisters.\n\nThe language of the Arcona was Arconese, which came from their home planet of [[Cona]]. However, on off-world colonies, Arconan young were rarely taught Arconese, as they could learn Basic easily. <br />\n<br />\n'''History:''' <br />\n''Contact:'' <br />\nBefore they made contact with other beings, the Arcona were not technologically advanced. Although they eventually used sentient technology, they never developed any of their own. When scouts from the Old Republic first arrived on [[Cona]], many Arcona were extremely enthusiastic about exploring the galaxy. Oftentimes, whole communities sought to travel off-world. As a consequence, Arconan colonies were quite common throughout the galaxy. After becoming used to other species' technology not present on [[Cona]], the Arconan were commonly seen in every spaceport in the galaxy.\n\nBefore the Great Jedi Purge, many force-sensitive Arcona joined the Jedi Order. <br />\n\n''Salt Addiction:'' <br />\nOffworlders initially traded water for mineral rights, but soon discovered that salt was a highly addictive hallucinogen for the Arcona. Traders then imported large amounts of salt before communities outlawed the dealings. In the long run, it was only the Republic that saved the Arcona from pandemic addiction, passing laws which punished salt sales on [[Cona]]. Salt-addicted Arcona could be easily recognized because their eyes turned from green to gold. Because of the large number of addicts, many people believed that the natural Arconan eye color was gold. Arcona females made up the main bulk of the addicts, due to their free-spirited nature. The effects of Salt on the Arcona resembled that of intoxication; an Arconan was seen in a dive bar consuming a soup in which he had poured an entire salt shaker's worth of salt, then was observed stumbling out of a cantina \"Like it was last call.\"\n\nAt the time of the Galactic Civil War, a camp for salt-addicted Arcona was established on the jungle world [[Kashyyyk]]. <br />\n\n''The New Order:''<br />\nMany Arcona were vocal supporters of the New Order, when they learned of its desire to form a united galaxy. This concept fit their notions of a perfect society. However, Arcona were present in the Galactic Alliance and the New Jedi Order; [[Vaala Razelle]] was an Arcona Jedi Knight. <br />\n<br />\n'''Known Individuals:''' <br/>\n*[[Hem Dazon]] \n*[[Shlith-dan]] \n*[[Unut Poll]]\n*[[Si Treemba]]\n*[[Izal Waz]]\n*[[Illist Mandrep]]\n<br />\n'''Attribute Dice:''' 12D <br/>\n'''DEXTERITY''' 1D+1/3D <br/>\n'''KNOWLEDGE''' 1D/3D<br/>\n'''MECHANCIAL''' 1D+1/3D+1<br/>\n'''PERCEPTION''' 1D+2/3D<br/>\n'''STRENGTH''' 2D/4D<br/>\n'''TECHNICAL''' 1D/3D<br/>\n\n'''Strength Skills:''' <br/>\n*'''''Digging:''''' Time to use: One round or longer. Allows the Arcona to use their talons to dig through soil or other similar substances.\n\n'''Special Abilities:'''<br/>\n*'''''Senses:''''' Arcona have weak long distance vision (add +10 to the difﬁculty level of all tasks involving vision at distances greater than 15 meters), but excellent close range senses (add +1D to all Perception skills involving heat, smell or movement when within 15 meters.\n\n*'''''Thick Hide:''''' Arcona have tough, armored hides that add +1D Strength when resisting physical damage. (This bonus does not apply to damage caused by energy or laser weapons.)\n\n*'''''Talons:''''' Arcona have sharp talons which add +1D to climbing, Strength (when determining damage in combat during brawling attacks), or digging.\n\n*'''''Salt Weakness:'' Arcona''' are easily addicted to salt. If an Arcona consumes salt, it must make a Very Difﬁcult willpower roll not to become addicted. Salt addicts require 25 grams of salt per day, or they will suffer -1D to all actions.<br/>\n<br/>\n'''Move:''' 8/10 <br/>\n'''Size:''' 1.7-2 meters tall <br/>\n\n== Source: ==\nUltimate Alien Anthology (p. 14-15), Alien Anthology (p. 56-57), Galaxy Guide 4: Alien Races (p. 15-16) & Wookieepedia (For the Arcona Description) <br/>",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Arcona",
  "retrievedAt": "2025-10-07T21:04:23.375Z"
}