{
  "title": "Arkanian",
  "pageId": 236,
  "revisionId": 19518,
  "wikitext": "[[File:Arkanian.jpg|right|thumb|Arkanian]]\n\n'''Species:''' Arkanian <br />\n'''Home Planet:'''  [[Arkania]] <br />\n<br />\n'''Arkanian''' <br />\nThe Arkanians were a near-Human species which resided primarily on the planet of [[Arkania]], though they were not indigenous to it. <br />\n<br />\n'''Biology & Appearance:''' <br />\nArkanians considered themselves the pinnacle of evolution, and as such many were distinctly arrogant. Arkanian scientists had been experts in genetic manipulation for millennia, and by the time of the Mandalorian Wars the species had been split into many sub-species, making it hard to determine exactly what was a baseline Arkanian. Most Arkanians could pass for Human, though the majority had pure white eyes and four clawed digits on each hand. \n\nArkanians were capable of seeing in infrared light, and their eyes were sensitive to sources of extreme heat. This was helpful on their dark and frigid homeworld, but when traveling offworld, many were forced to wear blinders on planets with hotter, younger suns. It was also not unusual for an Arkanian to enhance themselves with internal or external cybernetics, or in some cases both. It was also standard practice for many of the Arkanians to undergo further genetic manipulation on their own bodies, enhancing themselves even further and better than lesser species. <br />\n<br />\n'''Culture:''' <br />\nThe most defining trait of their kind was their arrogance which stemmed from their belief that they were the pinnacle of evolution. This led to them often appearing arrogant and aloof to others as they saw themselves as being superior to all other species. Even those with a more moderate viewpoint tended to see themselves as being amongst the most intelligent beings in the galaxy. As such, they were highly confident of their abilities. \n\nVisitors to their homeworld often faced unpleasant and arrogant Arkanians—this was only the case when they even recognized the existence of such beings on their planet. This arrogance was a notable barrier to any visitor that encountered them on their homeworld though cautious beings were able to be prepared in their interactions with them and expect the worst. Impoliteness deeply offended Arkanians and when this occurred, the offending individual needed to make amends quickly or risk being ostracized. When offended, an Arkanian typically spoke badly of the offending party once they were gone and when no apology was given—the Arkanians were known to lock up the person or detain their starship from leaving the planet with overt threats. Even at this point, however, it was possible to redeem themselves in the eyes of an Arkanian though failure meant that they became even more offended and storming away. But, if successful, the individual needed to also offer a gift to the offended Arkanian as a sign of their sincerity. \n\nKnowledge and research were highly prized within their society which meant that many Arkanians were highly skilled scientists as well as academians. Their near boundless arrogance and great wealth as well as dedication was unmatched by others with their scientific community creating research projects that easily matched those of the Galactic Empire. Imperial researchers often struggled to match the dedication of the Arkanians as their projects often took generations to unfold. In addition, they were not above using their intelligence and research to gain profit with their corporations massing great wealth due to medical treatments entering the market at opportune moments. Arkanian scientists were well known explorers and they were also famous for their skills in genetic manipulation which resulted from their fascination in the genetic make-up of other races. This had led to frequent experimentation on alien species, much to the subjects' detriment as a result of Arkanian involvement. \n\nThe Arkanians themselves were not above genetic experimentation with this avenue of research leading to the creation of the Arkanian Offshoots that were engineered to perform specific tasks. Occassionally, a number of racist Pureblood Arkanians were known to conduct purges of the Offshoot population. Reactions on the Offshoots varied as some Arkanians viewed them as little more than tools or even as slaves but many believed that they were an example of the cruel consequences of Arkanian corporate greed. \n\nResults of their scientific work had led to great advances in medical techniques throughout the galaxy whilst others were considered some of the greatest atrocities known. They were known to had made significant contributions in the fields of cybernetic medical technology and microcircuitry. Their actions had, however, led to many races holding a negative view of their kind which resulted from the actions of their scientists. However, many Arkanians were either embarrassed or even horrified at the acts their kind had gone to in the name of science. The more conscientous of their kind tended to be favored as allies of the Jedi Order. <br />\n<br />\n'''History:''' <br />\nThe Arkanians were believed to be natives of the planet [[Arkania]] though it was stated that they were not always residents to that world. In fact, they were not true natives of the planet but the fact that they had been there for countless generations meant that it was considered their homeworld. The rich gem mines on their planet led to its great development and the construction of elaborate trade cities on [[Arkania]]. This was the reason why Arkanian culture largely flourished as a result of off-world contact. They were well known throughout galaxy for their extremely reclusive scientists and for the rumored whispers on many worlds of their actions in genetic experimentation. It was believed for generations that the Arkanians, because of their tampering, had been involved in the creation of new species.\n\nIn fact, their reputation for experiments on other species were largely accurate. One of their earliest known endeavors was the creation of the [[Quermian]] species from the [[Xexto]] around 17,000 BBY. Though they abandoned their clandestine experiments, fearing legal action from the Galactic Republic, the Quermians resurfaced millennia later. Among the most well known Arkanians was the Jedi [[Arca Jeth]] who arose by 4,030 BBY and fought in numerous campaigns ranging from the defeat of the Lorell Raiders, the Freedon Nadd Uprising and finally defending against the rise of the Krath cult. The next involvement of the Arkanians in galactic politics was during the Mandalorian Wars when The [[Adasca BioMechanical Corporation of Arkania]] implemented Project Black Harvest that was launched by Lord [[Arkoh Adasca]] who intended to use it as a means of gaining further power for himself. \n\nThis would not be the last questionable scientific program they conducted. As in 490 BBY, they began experiments on their dim-witted [[Yaka]] neighbors in order to uplift the species, bestowing intelligence upon the previously simple minded race. Much criticism was leveled at the Arkanians for their actions toward the [[Yaka]] and protests were made against their government, the Arkanian Dominion, by their own people. Though they dramatically increased the intelligence of the Yaka species' with cybernetic enhancements, they also removed all traces of emotion from them. The controversy culminated in 50 BBY with the Arkanian Revolution. A group of renegade scientists on Arkania, disapproving of the systematic alteration of the [[Yaka]], built an army of cyborg knights to overthrow the Arkanian Dominion, the dominant government. The rebels were defeated when the Jedi intervened in the war. \n\nFollowing the revolution, the typical Arkanian mindset continued to dominate their culture and they proved to be among the most vocal members of the Galactic Senate. These eras saw at least one investigation conducted by the Senate into the activity of Arkanian scientists. This state of affairs continued into the emergence of the Galactic Empire. During that time, it was known that many Arkanians worked in the secret laboratories of Grand Moff [[Wilhuff Tarkin]] and Grand Admiral [[Zaarin]]. During the Rebellion era, many blamed the Arkanians for unleashing bio-weapons during the Clone Wars. Upon the emergence of the New Republic, the stance of the Arkanian people meant that they refused to join the new government. This further incriminated Arkanian scientists for their complicity with the previous Imperial government as information regarding their role during the New Order came to light. <br />\n<br />\n'''Offshoots:''' <br />\nThis particular sub-species was bred as workers for the famed Arkanian gem mines. These people had hands with five digits, pointed ears in some races, and eyes whose iris contrasted in coloring to the rest of the eyeball. Members of this breed, including [[Zadawi]], [[Gorman Vandrayk]] and [[Jarael]], were viewed as lower species and forced to live as outcasts by other \"pure\" Arkanians. <br />\n<br />\n'''Attribute Dice:''' 13D\n\n'''DEXTERITY''' 1D/3D+2<br/>\n'''KNOWLEDGE''' 1D+2/4D+1<br/>\n'''MECHANICAL''' 1D+1/4D<br/>\n'''PERCEPTION''' 1D+1/4D<br/>\n'''STRENGTH''' 1D+2/4D+1<br/>\n'''TECHNICAL''' 2D/4D+2<br/>\n\n'''Special Abilities:'''\n*'''''Darkvision:''''' Arkanian characters can see up to 20 meters in total darkness but may need to wear blinders on warmer worlds.\n\n'''Story Factors:'''\n*'''Arrogance:''' Arkanians are typically arrogant, believing that they have reached the pinnacle of evolution.\n*'''Infamy:''' [[Arkania]] was once part of the Sith empire, and their dedication to aggressive scientific research has given them a somewhat bad reputation as the galaxy's mad scientists.<br />\n\n'''Move:'''10/12<br />\n'''Size:''' 1.6 to 2.2 meters tall<br />\n'''Source:''' Wookieepedia (For the Arkanian Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Arkanian",
  "retrievedAt": "2025-10-07T21:04:24.181Z"
}