{
  "title": "Aruzans",
  "pageId": 7507,
  "revisionId": 19514,
  "wikitext": "'''Species:''' Aruzan<br />\n'''Home Planet:''' [[Aruza]]<br />\n<br />\n'''Aruzan''' <br />\nAruzans were the native people of Aruza. They were small humanoid or Near-Human beings with faintly blue skin and dark, almost black, hair. Aruzans had the ability to share their memories and emotions with one another through cybernetic implants called ''Attanni''. Aruzans felt the barriers of individual identities slip away when using their Attanni, as though they and whoever they had linked with were the same person. Certain human cyborgs could also share these links.\n<br />\n<br />\n'''History:''' <br />\nAruzans had the ability to share their memories and emotions with one another through cybernetic implants called Attanni. Aruzans felt the barriers of individual identities slip away when using their Attanni, as though they and whoever they had linked with were the same person. Certain Human cyborgs could also share these links. \n\nWhile under Imperial rule, the peaceful Aruzans were subjected to what COMPNOR called \"processional orientation experiments\". General [[Sinick Kritkeen]] directed these experiments in an attempt to turn the pacifist species into feral warriors who would be useful to the New Order. Though the bounty hunter [[Dengar]] was contracted by the Aruzans to assassinate Kritkeen, it is likely that COMPNOR's \"Redesign\" efforts continued under a new COMPNOR officer, probably with severe reprisals carried out against the Aruzan population. \n\nA famous Aruzan was [[Manaroo]], a dancer [[Dengar]] rescued from Aruza before she was scheduled for \"processing\". She later became a slave and dancer for [[Jabba Desilijic Tiure]], and married [[Dengar]] shortly after Jabba's death. <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 2D/4D<br />KNOWLEDGE 3D/5D<br />MECHANICAL 2D/3D+2<br />PERCEPTION 2D/4D+2<br />STRENGTH 1D/3D<br />TECHNICAL 2D/4D<br />\n<br />\n'''Special Abilities:''' <br />\n''Attani implats:'' Allows memory and emotion sharing of all attendant Aruzans. A plug socket for interface use is relocated on the neck of a Aruzan (estimated costs 2000 credits for an Attani implant in childhood). <br />\n<br />\n'''Story Factors:''' <br />\n''Passivist:'' If one of the piece loving Aruzans try to get violent a Aruzan have to succed on a ''easy'' willpower roll or lose all action during this round. <br />\n<br />\n'''Move:''' 7/9 <br />\n'''Size:''' 1.5 meters tall on average<br />\n'''Source:''' Voren Na al´s personal ancient library of Alienspecies folder for letter \"A\" ( a hand-written paper from last century ), more information about the history / storyline of Aruzans on Wookieepedia (For the Aruzan Description).",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Aruzans",
  "retrievedAt": "2025-10-07T21:04:24.981Z"
}