{
  "title": "Asramul",
  "pageId": 10579,
  "revisionId": 20591,
  "wikitext": "'''Attribute Dice:''' 12D<br />\n\n'''DEXTERITY''' 1D+1/4D<br/>\n'''KNOWLEDGE''' 1D/3D+1<br/>\n'''MECHANICAL''' 1D/3D+1<br/>\n'''PERCEPTION''' 2D/4D<br/>\n'''STRENGTH''' 3D/5D+1<br/>\n'''TECHNICAL''' 1D/4D+2<br/>\n\n'''Move:''' 9/13  -  24/28 Swimming\n\n'''Special Abilities:'''\n*'''Environment:''' Asramul abilities are all at +1D+2 when they are submerged, and are conversely at -1D+2 when they are not.&nbsp; This is a physiological, rather than psychological penalty, and the penalty doubles for every day that the Asramul goes without at least 10 min. worth of complete submersion, and they will die if kept out of water for more than a week.\n*'''Senses:''' When underwater, Asramul have incredibly sensitive hearing and smell, allowing them a +4D bonus to Search rolls and Perception checks that can make use of those senses.&nbsp; However, this bonus is not nearly as powerful on land, giving them only a +2 bonus to those rolls.&nbsp; However, they can chose to extend their ears from their sheaths when out of water, and get the full benefit of that sense (+3D), but they must roll a Stamina check each round that they are extending to avoid causing permanent damage to their ears (-1 per failed check.)\n\n'''Story Factors:'''\n*'''Technology:''' While Asramul can use the equipment of other races without penalty, they are quite uncomfortable while doing so, and will try to go back to their most aesthetic but less effective tools whenever possible.\n*'''History and Culture:''' The Asramul are a quite ancient race, having developed interstellar travel over thirty thousand years ago.&nbsp; However, they never formed an empire of any sort, quitecontent to remain alone in their little corner of the sector. They did colonize one planet out of their system, Uiri, due to the fact that it was remarkably similar to their homeworld, and due to overfishing of certain areas of Girgasoom. Since then, Uiri and Girgasoom have remained in close contact, with Asramul moving from one to the other in the face of planetary population increases, which are dealt with both by this method and by voluntary population controls. During this period, Asramul developed a very sophisticated culture. Their art, and subharmonic symphonies are quite sophisticated, and may prove to be quite popular in the general galactic arena. All aspects of their culture are based on their realization that resources are limited, and that natures is to be respected, as well as their own predatory nature.  Due to the fact that their planet is located near the edgeof the Yaeger Sector closest to the slice, they have learned more about the rest of the galaxy than many other races of the sector. Piecing together bits of information and rumor, they developed a surprisingly accurate understanding of the galactic situation, and they welcomed the New Republic's entrance into the Sector, applying for membership to the New Republic almost as soon as the first of their scouts arrived. Since that time, they have developed a quite close relationship with the New Republic, that has proved highly profitable for the Asramul, who have started to learn about the glories of interstellar investment.\n\n'''Personality'''\n*'''Temperament:''' Though they try to live their lives without disturbing their environments, Asramul have predator's instincts, and far prefer meals that they hunt down and kill themselves to pre-caught food. Similarly, though they try to co-exist in peace and harmony with all life, they will not hesitate to slit throats when it seems necessary.\n*'''Leaders:''' The Asramul are a democratic society, with a single executive and a twenty member legislative/judicial branch, each of whom stand for election every ten years\n*'''World view:''' Known for their naturalistic philosophy, Asramul try to live in harmony with their environment, producing goods and dwellings out of natural substances, and without disturbing their environments. Despite all this, the Asramul are not a particularly pacifistic race, and are quite brutal when fighting in self defence, not stopping until their enemy is completely destroyed.\n\n'''Physical Description:'''\n*Appearance: Asramul are an amphibious race, spending most of their time underwater. They quite tall, almost four meters in height, with a mottled orange, yellow, and purple skin that allows them to blend in very well with the shallow water reefs of their homeworld. Due to their primarily aquatic nature and large size, they have very powerful muscles, which are required to push their bulks through water. They are rather angular for all that, with long, thin limbs, a rather slender torso, and a long, thin head. Omnivores, the Asramul prey on fish for much of their food, while relying on corals, kelp, and other sealife for certain essential nutrients. Asramul have four independently focusing eyes, that are set in non-flexible stalks, with one set on either side of the forehead and jaw, giving their heads a somewhat starlike appearance. In addition, they have a pair of very sensitive ears, which are fully retractable, tending to remain behind a layer of skin when the Asramul are on the surface, giving them no better hearing then humans. In addition, their four nose-slits are also very sensitive, giving them detection abilities similar to those of sharks, when they are submerged.\n\n'''Homeworld:''' Girgasoom\n*Other planets inhabited: Ostvego, Uiri \n\n'''Tech Level: Medium'''\n*Asramul tend to work with natural materials, but at quite sophisticated levels.\n\n'''Asramul in the Sector:'''\n*Asramul are viewed as being haughty isolationists, and their immediate adoption of the New Republic Government has raised suspicions among many.\n\n'''Spaceships:'''\n*Asramul's spacecraft are quite unusual, being composed of natural substances, such as glass, ceramics, and small amounts of minerals, but manage to preform near galactic standards. The gorgeous Nautilus cruiser, and the SpineDart fighters are currently the most sophisticated craft that the Asramul produce.",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Asramul",
  "retrievedAt": "2025-10-07T21:04:25.770Z"
}