{
  "title": "Avogwi (Altorian Bird)",
  "pageId": 7506,
  "revisionId": 33225,
  "wikitext": "[[File:Avogwi.jpg|right|thumb|Avogwi]]\n\n'''Species:''' Avogwi <br />'''Home Planet:''' [[Altor 14]] \n\n'''Avogwi''' \n\nAvogwi were a sentient species of predatory birds native to [[Altor 14]], which was also home to the [[Nuiwit]]. Except for their muscular, scale-covered legs, their bodies were covered in orange feathers, which camouflaged them against Altor's orange skies. Adult Avogwi had a wingspan of four to five meters. They had three fingers at the joint of each wing, which served as hands when not in flight. Avogwi viewed the Nuiwit as merely another prey species, though tastier than most. They reacted violently to suggestions that the two species evolved from a common ancestor. \n\nDue to their entirely carnivorous diet and clumsy hands, Avogwi society was relatively primitive, based solely on hunting and water gathering. Avogwi were not very social, living in mated pairs which would claim about fifty square kilometers as their exclusive territory. They also had very little technology, and distrusted that of other species. Despite this, they had developed a complex philosophy based on the teachings of the legendary hero Toro-toral, said to be the first Avogwi to fly. The basic tenets of this philosophy were that all creatures that wanted to live must kill, and that all creatures that would not kill would die so that others could live. The sayings of Toro-toral were repeated by the Avogwi at their only large-scale gatherings: ceremonial duels to the death to determine the Avogwi leader, or Avog. \n\nAvogwi had little to trade to the rest of the galaxy other than mineral rights to the territory surrounding their aeries. This, they refused to do, as they were unable to understand why offworlders would trade them anything useful in exchange for anything the Avogwi owned, unless it was to make the Avogwi weaker. Since their [[Nuiwit]] neighbors were willing to trade, and their cities and farms continued to expand and drive Avogwi out of their hunting grounds, the Avogwi did not prosper when the [[Rego Mineral Company]] contacted [[Altor 14]] in 15 BBY. Some, unable to find aeries of their own, went offworld, where they found work as bounty hunters, assassins, or similar violent occupations. \n\nAn Avogwi worked as the port boss at Mud Station on [[Shador]]. Another well-known Avogwi was [[Nevid d'Hon]], an outfitter on [[Ord Mantell]]. \n\n'''Attribute Dice:''' 10D<br />'''DEXTERITY''' 1D+1/3D+1<br />'''KNOWLEDGE''' 1D/3D<br />'''MECHANICAL''' 0D/1D+2<br />'''PERCEPTION''' 2D+2/5D<br />'''STRENGTH''' 2D/4D<br />'''TECHNICAL''' 0D/1D+2\n\n'''Special Abilities:'''\n*'''Beak''': Does STR+2D.\n*'''Talons''': Does STR+1D.\n*'''Primitive Hands:''' Avogwi suffer a -1D penalty on all Dexterity skills which invlove the manipulation of objects, unless those objects were speciﬁcally designed for Avogwi hand or can be manipulated with their beaks.\n\n'''Story Factors:'''\n*'''Bloodthirsty:''' Every being who encounters Avogwi risks death, whether it is because the Avogwi is hungry and sees that being as food, or because it is simply “time for another to die.” Because of this, most beings will avoid Avogwi, which suits the Avogwi ﬁne, but also forces the Avogwi to search out a specimen when either of these two needs must be met.\n\n'''Move:''' 15/20 (ﬂying); 3/5 (walking)<br />'''Size:''' 1.5-2 meters tall\n\n'''Source''':\n*Galaxy Guide 4: Alien Races (pages 8-10)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Avogwi%20(Altorian%20Bird)",
  "retrievedAt": "2025-10-07T21:04:26.552Z"
}