{
  "title": "Avun",
  "pageId": 7509,
  "revisionId": 33226,
  "wikitext": "'''Homeworld:''' [[Rezil]]\n\n'''Attribute Dice:''' 12D<br />'''Dexterity:''' 3D/6D<br />'''Knowledge:''' 2D/4D<br />'''Mechanical:''' 1D/3D<br />'''Perception:''' 2D/4D<br />'''Strength''' 2D/4D<br />'''Technical:''' 2D/4D\n\n'''Size:''' 1.4-2.3 meters tall<br />'''Move:''' 12/14\n\n'''Special Abilities:'''\n*'''Dexterous:''' Avun move their bodies in a ways that amaze many other beings, because of this, they receive a 1D+2 bonus to all Brawling Parry, Dodge, Melee Combat, Melee Parry, Running, Brawling, Climbing / Jumping and Swimming skill checks.\n\n'''Special Skills:'''\n*'''Melee Parry/Melee Combat:''' Avun may take the melee combat or melee parry skill including specializations for melee parry and melee combat rolls.\n\n'''Story Factors:'''\n*'''Clan:''' Avun are extremely loyal to the Clan they belong to before all others.\n*'''Loyal:''' Avun are bound by their word and they would rather die than break their word. Once they pledge their loyalty to someone, they remain so until that person does something so horrible to the Avun, as to result in losing the Honor-bond.\n*'''Melee Preference:''' Avun believe that the only honorable combat is armed or unarmed melee. The exception is vehicle and starship weapons, which is viewed as an acceptable evil if no other way is possible.\n*'''Primitive:''' Avun are viewed as primitive and the they play up this belief to outworlders or if they are on a non Avun world.\n\nThe Avun are viewed by many as one of the most backward species who claim to have reached the space age tech level due to their preference for hand to hand combat. In fact many tend to look at the Avun, and their melee weapons, when they see them on a planet´s surface and wonder if they aren´t actually a primitive species. Most overlook the fact that the so called primitive weapons are typically on the cutting edge of modern technology. More shocking to most who view the Avun as primitives is just how comfortable Avuns are with modern technology.\n\n'''Source''':\n*Richard Greenleaf, and Voren Na al´s personal ancient library of Alien species folder for letter \"A\"",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Avun",
  "retrievedAt": "2025-10-07T21:04:26.962Z"
}