{
  "title": "B'harnii",
  "pageId": 241,
  "revisionId": 33256,
  "wikitext": "'''B'harnii'''<br />'''Attribute Dice''': 12D<br />'''Dexterity '''2D+2/4D+2<br />'''Knowledge '''2D/4D<br />'''Mechanical '''1D+2/3D+2<br />'''Percetion '''2D+2/4D+2<br />'''Strength '''1D/3D<br />'''Technical '''2D/4D\n\n'''Size''': 1.5-2.0 meters<br />'''Move''': 10/12\n\n'''Special abilities: '''\n*'''Singing/dancing''': B'harnii are notorious for their ability to captivate children through singing and dancing.\n*'''Persuasion/Con''': B'harnii get a +2D to any attempt to get and hold the attention of a child using persuasion skill or to con a child. Adult characters get a +1D to resist such attempts, and are usually annoyed by them.\n*'''Blaster-Bolt Magnet''': If a B'harnii is in or near a group exchanging blaster fire, random blaster fire has a significantly increased chance to hit a B'harnii.\n\n'''Story Factors: '''\n*'''Enslavement by the Empire''': Like Mon Calamari and Wookiees, B'harnii have been enslaved by the Empire; to teach kids that Imperial Authority Is A Good Thing, and Stormtroopers Are Your Special Friends. Of course, the Empire brainwashes the B'harnii before turning them loose to teach children.\n*'''The Jihad''': A few see B'harnii as spawn of evil due to their ability to influence the minds of the young, and to that end have formed a secret organization, the Jihad, to eradicate all B'harnii through genocide.\n*'''Child Loyalty''': B'harnii have +2D to any attempt to Command a child.\n*'''Teaching''': B'harnii make excellent teachers for children. Kids learn twice as fast from B'harnii.\n*Player-characters cannot start with the [[Kid]] template.\n\n'''Description''': B'harnii (singular and plural are the same word) are native to \"The Hole,\" a terrestrial world in the contested Valar Cluster. B'harnii are bipedal, bilaterally-symmetrical reptilian creatures, purple in color, with ample flesh, a large tail and soft, velour-like skin. B'harnii are capable of speaking Basic and of Force-use.\n\n'''Source''':\n*Unknown (possibly a home brew race)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/B'harnii",
  "retrievedAt": "2025-10-07T21:04:27.754Z"
}