{
  "title": "Balosar",
  "pageId": 7815,
  "revisionId": 19486,
  "wikitext": "[[File:BalosarFemale.jpg|thumb|right|Balosar]]\n[[File:BalosarMale.jpg|thumb|right|Balosar]]\n\n'''Species:''' Balosar <br />\n'''Home Planet:''' Balosar <br />\n<br />\n'''Balosar''' <br />\nBalosars were humanoids with retractable antennapalps. They were indigenous to Balosar. <br />\n<br />\n'''Biology & Appearance:''' <br />\nThe Balosar's antennapalps allowed them to listen into the subsonic range. Their antennapalps also gave the species a physical intuition, which the Jedi sometimes mistook for Force sensitivity. Their antennapalps could also sense surges in emotion and could detect danger. They used these abilities to help them survive on their crime-infested world. \n\nBalosars were also resistant to toxin, despite their frail physiques. This immunity can be attributed to their planet's polluted atmosphere, giving them a high resistance. A Balosar reached adulthood at age 16. Average life expectancy for a Balosar was roughly 65 years. <br />\n<br />\n'''Society:''' <br />\nBalosars were commonly stereotyped as spineless, weak-willed, depressed, sarcastic, cynical, and selfish. However, they acquired these traits due to their planet's pollution. The Journal of Personality and Galactic Psychology did not indicate any sort of genetic link to these emotions. \n\nBalosars often left their homeworld to look for a more prosperous place to live. Since many carried criminal records, they were perceived as self-absorbed individuals who had a difficult time determining right from wrong. Young Balosars were commonly sent to worlds with better education. \n\nDeath sticks were a devastating factor in Balosar society, where they addict users, forcing them to purchase more. Pollution is one of the causes of the heavy addiction to death sticks, but the Balosar's immunity to toxin allows them to consume them without much effect other than the life-long addiction. Some Balosars even entered the death stick business, where they would travel in hopes of finding potential customers. <br />\n<br />\n'''History:''' <br />\nDuring the reign of the Galactic Republic, illegal trade in death sticks became the greatest competition to the spice from [[Ryloth]] called ryll. The rivalry resulted in a hatred between the Balosars and [[Twi'leks]]. \n\nBy the time the New Republic was formed, Balosar's pollution seeped into the balo mushroom farms destroying the Balosar's economy. The Balosars had no choice but to join the Twi'lek's spice industry as low-level runners. \n\nWhen the [[Yuuzhan Vong]] War occurred, the Balosars were not bound to treaties with the New Republic and were therefore not protected by its military. However, they escaped the Yuuzhan Vong's conquest and their planet remained as it always was throughout the invasion. <br />\n<br />\n'''Common Balosar Names:''' <br />\n*Nina Dar'Eboros \n*Vaya Bar'jaraka \n*Zirk Mer'darro \n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 2D/4D+2<br />KNOWLEDGE 1D/3D+2<br />MECHANICAL 1D+2/4D+1<br />PERCEPTION 1D+1/4D<br />STRENGTH 1D/3D+2<br />TECHNICAL 1D+1/4D<br />\n<br />\n'''Special Abilities:''' <br />\n''Antennapalps:'' A Balosar’s antennapalps are sensitive to sound and provide a +1D bonus to search by sound.\n\n''Poison Resistance:'' +1D to stamina to resist poisons. <br />\n<br />\n'''Story Factors:''' <br />\n''Moral Ambiguity:'' Con and bargain rolls made against a Balosar gain a +1D+1 bonus, if promising profit or power. <br />\n<br />\n'''Move:''' 10/12 <br />\n'''Size:''' 1.6 meters tall on average<br />\n'''Source:''' Ultimate Alien Anthology (p. 17-18) & Wookieepedia (For the Balosar Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Balosar",
  "retrievedAt": "2025-10-07T21:04:28.521Z"
}