{
  "title": "Barabel",
  "pageId": 11817,
  "revisionId": 33255,
  "wikitext": "[[File:barabel.jpg|300px|thumb|right|A typical Barabel]]\n\n'''Attribute Dice: 12D'''<br />'''DEXTERITY: 2D/4D'''<br />'''KNOWLEDGE: 1D/2D+1'''<br />'''MECHANICAL: 1D/3D'''<br />'''PERCEPTION: 1D+1/4D+2'''<br />'''STRENGTH: 3D/5D'''<br />'''TECHNICAL: 1D/2D+1'''\n\n'''Move: 11/14'''<br />'''Size:''' 1.9-2.2 meters\n\n'''Special Abilities:'''\n*'''Natural Body Armor:''' Gives the Barabel +2D against physical attacks and +1D against energy attacks.\n*'''Radiation Resistance:''' Barabels have natural resistance to most forms of radiation. They receive a +2D when defending against the effects of radiation.\n*'''Vision:''' Barabels can see in the infrared spectrum, allowing them to see in complete darkness provided that there are heat sources.\n\n'''Story Factors:'''\n*'''Jedi Respect:''' Barabels have a deep respect for Jedi Knights, though they have little ability in the Force. They almost always yield to the commands of a Jedi Knight.<br />\n*'''Reputation:''' Barabels have a reputation as fierce warriors and great hunters. They are often feared, and always given a wide berth except by the most fierce individuals.<br />\n\n'''Personality'''\n\nBarabels have a complex and unusual physiology, due to the harsh nature of their homeworld, [[Barab I]]; The planet orbits close to its red-dwarf sun, which bathes it with intense radiation throughout the daylight hours. The heat and radiation cause most of the freestanding water on the planet to evaporate, leaving Barab a humid, hazy world. Physically, Barabels have slit-like pupils which collect energy from the infrared to yellow spectrums, allowing them to see in darkness as well as normal daylight conditions. The black scales which cover their bodies are made of sturdy, protein-based keratin. It provides the hunters with natural body armor which is resistant to punctures and blows. They have even been known to shrug off light blaster bolt hits. The majority of the species remains untamed and uncivilized, living as they have for thousands of years despite the advanced technology that has been brought to their world. Barabels have a deep respect for the Jedi Knights of old, and a few have even tried to emulate the Jedi tradition — despite little aptitude in the Force. Even in the face of Imperial persecution, many Barabels refused to denounce the Jedi or the Force. They point to the legend of the Barabel War. When the vicious hunters split into two warring factions over access to choice hunting grounds, it seemed the entire species was destined to join the coming battle. But Jedi Knights passing through the system intervened. They listened to both sides and passed fair judgment, stopping a war that would have killed many Barabels and restoring peace to the world.\n\n'''Physical Description'''\n\n\nBarabels are vicious, bipedal reptiloids. They stand from 1.75 to 2.5 meters tall. The horny black keratin scales that cover their bodies, as well as the long, needle-like teeth which fill their huge mouths, give them a fierce, frightening countenance; Barabels inhabit the dark, humid world of [[Barab I]], which orbits the red-dwarf star called Barab. The world has long been the refuge of spice smugglers and other criminals, and it occasionally serves as ahunting ground for sport hunters, but otherwise it rarely receives galactic traffic. For this reason, few Barabels have made their way off-planet, and the species is not widely known.\n\n'''Source''':\n*Galaxy Guide 4: Alien Races (pages 17-19)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Barabel",
  "retrievedAt": "2025-10-07T21:04:28.902Z"
}