{
  "title": "Baragwin",
  "pageId": 7816,
  "revisionId": 19223,
  "wikitext": "[[File:Baragwin.jpg|thumb|right|Baragwin]]\n[[File:Baragwin2.jpg|thumb|right|Baragwin]]\n\n'''Species:''' Baragwin <br />\n'''Home Planet:''' Unknown <br />\n<br />\n'''Baragwin''' <br />\nThe Baragwin people were a species of very large reptilian bipeds. <br />\n<br />\n'''Biology & Appearance:''' <br />\nBaragwin were easily recognized by their hunched backs, wrinkled skin, and large heads mounted on thick necks. There were no obvious differences between male and female Baragwin. \n\nPhysically, Baragwin were noted for their thick skin which could resist most physical attacks, and their shuffling gait. This made them powerful, but slow, warriors. Baragwin also had an acute sense of smell, sensitive enough to detect a person's mood. This led some of them into careers as big-game hunters, or even as bounty hunters. Due to their ponderous movement, many non-Baragwin believed the Baragwin to be a dull-witted people. Baragwin were, in fact, quite intelligent, but they frequently kept this hidden, using the misconceptions of others to their own advantage. <br />\n<br />\n'''History:''' <br />\nThough their population numbered only in the millions, they were widespread throughout the galaxy, having been part of galactic society for millennia. Their original homeworld was lost to legend. Instead, like Humans, individuals identified themselves with the planet they were raised on. \n\nBaragwin culture, since it did not derive from a single homeworld, was highly dependent on a Baragwin's planet of origin (with Tatooinian Baragwin behaving quite differently from those from Denuhi-Eight.) Baragwin generally had little prejudice, treating all other beings equally regardless of species, culture, or planetary origins (though criminal Baragwins would exploit all beings equally instead). Baragwin settlements were generally small and anarchic, with short-term leaders selected by informal democratic processes. \n\nBaragwin were famous as skilled weapon-smiths. During the Jedi Civil War, Baragwin-made blasters and vibroblades were among the most powerful personal weapons in the galaxy. This tradition continued into the Galactic Civil War era, where Baragwin were found working for Imperial-backed corporations, criminals, and the Alliance to Restore the Republic. Among the Baragwin armorers at that time was [[Hermi Odle]], a security expert working for [[Jabba Desilijic Tiure]]. \n\nSince the Empire and Imperial-backed corporations prized the contribution of Baragwin weapons engineering, most Baragwin supported the Empire during the Galactic Civil War. When [[Ysanne Isard]] released the Krytos virus in order to decimate the nonhuman population of [[Coruscant]]; however, the planet's Baragwin community was hit hard. The majority of Baragwin reacted by throwing their support behind the fledgling New Republic. In 25 ABY, the numerous Baragwin communities were represented in the New Republic Senate by [[Senator Wynl]]. <br />\n<br />\n'''Baragwin Naming Customs:''' <br />\nMost Baragwin had a first and a second name. Typical names included [[Dagel Igara]], [[Digo Fadani]], and [[Idalli Kodrue]]. [[Senator Wynl]], who apparently had only one name, was one of the few known exceptions.<br />\n<br />\n'''''Attribute Dice:''''' 11D+1<br />DEXTERITY 1D+1/3D+2<br />KNOWLEDGE 1D/2D+1<br />MECHANICAL 1D/3D+2<br />PERCEPTION 2D/3D+1<br />STRENGTH 2D/4D<br />TECHNICAL 2D/3D<br />\n<br />\n'''Special Abilities:''' <br />\n''Smell:'' Baragwin have a remarkable sense of smell and get a +1D to scent-based search and +1D to Perception checks to determine the moods of others within five meters.\n\n''Weapons Knowledge:'' Because of their great technical aptitude, Baragwin get an extra 1D at the time of character creation only which must be placed in blaster repair, capital starship weapon repair, firearms repair, melee weapon repair, starship weapon repair or an equivalent weapon repair skill.\n\n''Armor:'' Baragwins’ dense skin provides +1D protection against physical attacks only. <br />\n<br />\n'''Move:''' 7/9 <br />\n'''Size:''' 1.5-2.2 meters tall <br />\n'''Source:''' Galaxy Guide 12 – Aliens: Enemies and Allies(p. 17-19), Ultimate Alien Anthology (p. 19-20), Alien Anthology (p. 59-60) & Wookieepedia (For the Baragwin Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Baragwin",
  "retrievedAt": "2025-10-07T21:04:29.281Z"
}