{
  "title": "Bartokk",
  "pageId": 7817,
  "revisionId": 19218,
  "wikitext": "[[File:Bartokk.jpg|thumb|right|Bartokk]]\n\n'''Species:''' Bartokk <br />\n'''Home Planet:''' Unknown (Estimated to be in the [[Outer Rim]] / [[Hapes Star Cluster]])<br />\n<br />\n'''Bartokk''' <br />\nThe Bartokks were a clawed, insectoid, hive-mind species of sapients from a nameless planet in the [[Outer Rim]] Territories. \n\nThe Bartokks possessed amazing regenerative abilities, and could recover from almost any injury, so long as their brains were not completely destroyed. However, if their brain was cut in half each half would regenerate into a separate twin. Their bodies also had the ability to have parts that have been cut off in combat to continue functioning as normal. If decapitated, for example, the body would continue to fight as if it were still attached to the head. They also had a grasp on telepathy, where if one were to be in danger, they could simply call on their \"hive\" to save them. [[Tenel Ka]], [[Jaina Solo]], and [[Jacen Solo]] found them to be worthy adversaries. Bartokks travel in hives of fifteen. \n\nTheir homeworld was mildly radioactive, leading to occasional mutations which would seem minor to most beings, but were grounds for exile in Bartokk society. <br />\n<br />\n'''''Attribute Dice:''''' 9D<br />DEXTERITY 1D+1/4D<br />KNOWLEDGE 1D/3D<br />MECHANICAL 1D/3D<br />PERCEPTION 1D/3D<br />STRENGTH 2D/4D+2<br />TECHNICAL 1D/2D+2<br />\n<br />\n'''Special Abilities:''' <br />\n''Natural Armor:'' Grants +1 against energy attacks and +2 against physical attacks.\n\n''Extra Limbs:'' A Bartokk’s four arms grant a +1D bonus to climbing and brawling.\n\n''Claws:'' Do STR+1D damage.\n\n''Hive Mind:'' A Bartokk is linked telepathically to every Bartokk within 500 meters. Bartokk gain a temporary +1 bonus to Knowledge, Perception, Mechanical and Technical for every additional 2 Bartokk within 500 meters (maximum +4D).\n\n''Regeneration:'' A Bartokk heals one wound level every 4 rounds. A Bartokk can regrow lost body parts or grow a completely new body in 1D days. The only way to prevent a Bartokk from regenerating is to completely destroy or disintegrate its brain.\n\n''Compartmentalized Biology:'' Severed Bartokk body parts act as normal. They die 8 hours after dismemberment. <br />\n<br />\n'''Story Factors:''' <br />\n''Hive Mind:'' Individual Bartokk are barely sentient. When they form large groups, their intellect increases exponentially. <br />\n<br />\n'''Move:''' 10/12 <br />\n'''Size:''' 1.9 meters tall on average <br />\n'''Source:''' Ultimate Alien Anthology (p. 20-21) & Wookieepedia (For the Bartokk Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Bartokk",
  "retrievedAt": "2025-10-07T21:04:29.663Z"
}