{
  "title": "Belorian",
  "pageId": 10580,
  "revisionId": 20593,
  "wikitext": "'''Species:''' Belorian <br />\n'''Home Planet:''' [[Beloris Prime]] <br />\n<br />\n'''Belorian''' <br />\nBelorians are a race that is all but extinct in present time. They hail from a planet known as [[Beloris Prime]]. [[Beloris Prime]] was once the proud center of an independent government which sat on the edge of [[Wild Space]]. During the time that the Galactic Republic became the New Order [[Emperor Palapatine]] took notice of this race. The planet held many natural resources, but the one Palapatine was most interested in was the whole race was force sensitive.\n\nWhen the Planetary council refused to join the New Order the planet was seized and taken into the folds of the Imperial Banner. Many Belorians died, but a few escaped and scattered to different parts of the galaxy. [[Beloris Prime]] is now only a shadow of the proud government it once held, serving the empire now as a training facility for its Space Navy.\n\nBelorians are humanoid in appearance, save the races skin tones that range in color from blue to purple. The hair of the individual is usually a darker shade of the skin tone. A few Belorians under went cosmetic surgery in order to hide them better. Belorians are hunted by the Empire.\n<br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 1D/4D<br />KNOWLEDGE 2D/4D<br />MECHANICAL 1D/3D<br />PERCEPTION 3D/5D<br />STRENGTH 1D+2/3D+2<br />TECHNICAL 2D/4D+1<br />\n<br />\n'''Special Abilities:''' <br />\n''Natural Affinity:'' The Belorian race has a special affinity with the force and are all Force Sesitive. For every 1D put in Control, Sense, or Alter they will receive 2D at character creation only. The cost for advancing skills is one half the die code (rounded up). <br />\n<br />\n'''Story Factors:''' <br />\n''Dwindling Race:'' During the Empire's reign the Belorians were all but wiped out.\n\n''Hunted by the Empire:'' Palapatine views these creatures as threats to the New Order, and will be dealt with as such by Imperial authorities.<br />\n<br />\n'''Move:''' 10/12 <br />\n'''Size:''' 1.3-1.5 meters tall <br />\n'''Source:'''",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Belorian",
  "retrievedAt": "2025-10-07T21:04:30.057Z"
}