{
  "title": "Bimm",
  "pageId": 10581,
  "revisionId": 20595,
  "wikitext": "[[File:Bimm.jpg|thumb|right|The floppy-eared, furred humanoid species of Bimm]]\n[[File:Bimm2.jpg|thumb|right|The Near-Human Bimm]]\n\n'''Species:''' Bimm <br />\n'''Home Planet:''' [[Bimmisaari]] <br />\n<br />\n'''Bimm''' <br />\nThe Bimms were diminutive humanoids from the planet [[Bimmisaari]]. The Bimms consisted of two species—one, a Near-Human race, the other a floppy-eared, furred humanoid species. Though the two species were completely unrelated biologically, they shared a language and cultural identity as Bimms. Many descriptions of Bimm culture and society ignored the biological differences between the two species. \n\nThe Bimms had a reputation as a peaceful, hospitable people. Many traveled the galaxy working as merchants and artists. Others remained on their homeworld, or lived in Bimm enclaves on a variety of planets. Some of the best-known Bimms in galactic history went against their people's stereotypical, inoffensive demeanor, however. These included the Sith adept and serial murderer [[Toki Tollivar]], and an unidentified Bimm who impersonated the Prophet of the Dark Side Kadann and later laid claim to the Imperial throne. <br />\n<br />\n'''Biology & Appearance:''' <br />\nOne of the Bimm species was thought to have evolved on Bimmisaari. They were slightly taller than the Near-Human Bimms, with an adult height of 1.0 to 1.6 meters, with the females being slightly taller on average. They were covered in short fur that ranged from black to tan in color. Their faces had floppy ears, long muzzles, and small black eyes. Their hands possessed three long fingers and a thumb each.\n\nThe Near-Human Bimms differed from the Human norm primarily in their short stature, which ranged from 1.0 to 1.5 meters for adults of both sexes. Near-Human Bimms were often said to resemble Human children, though males frequently, and proudly, grew full beards. Xenobiologists believed that the Near-Human Bimms arrived on Bimmisaari from a nearby planet eons before the rise of the Galactic Empire, and adopted the culture of the original Bimm species. No other animal species on [[Bimmisaari]] was genetically related to them. \n\nBoth species called themselves simply \"Bimms\" and lived harmoniously with each other in their shared forest cities. They considered themselves to be a united people, and were considered as such by the rest of the galaxy. Intermarriage between the two Bimm species was not uncommon, though genetic incompatibilities required such couples to adopt if they wanted children. <br />\n<br />\n'''Society & Culture:''' <br />\nThough the Bimm species had lived together for almost all of their recorded history, certain aspects of their culture were more associated with one species than with another. While some sources attributed these cultural tendencies to one species or the other, sources such as Mammon Hoole presented them as aspects of a single, shared culture. \n\nBimms, especially the Near-Human Bimms, were fond of art, music, and storytelling. Their favorite stories involved heroic adventures, though they were usually content to hear the stories rather than inspired to take part in adventures themselves. The language Bimmini, which was used by both species, was sung, rather than spoken. A Bimm conversation had a seemingly mystical quality, sounding to Human ears like songs being sung in five-part harmony. \n\nThe furred Bimms were particularly good merchants, and felt the day was incomplete without a good round of shopping and haggling. The art of bargaining was respected in their culture, and fair dealing was highly honored. However, cheating and theft were tantamount to murder in their society. Furred Bimms were also noted for their yellow clothing. \n\nBoth species were noted for their mild-tempered, peaceful tendencies, which was the reason the two species lived together in harmony. This tendency extended to non-Bimm visitors from offworld, who would be treated as honored guests. The Bimm greeting ritual involved a reception line which each visitor would walk through. In complete silence, each Bimm in line would reach out and gently touch the visitor's head, arm, or back. More important visitors would attract correspondingly large crowds in the procession. This honor did not extend to armed visitors, however, who would be expected to leave their weapons behind. <br />\n<br />\n'''History:''' <br />\nBimms were in contact with the Galactic Republic as early as the Great Sith War. One furred Bimm, [[Toki Tollivar]], defected to the Sith Empire and became a Sith adept. At the war's end, he began a private campaign of revenge and serial murder, before being defeated by the Mandalorian Crusader [[Rohlan Dyre]]. \n\nAs the Galactic Republic's government became too corrupt in its later years, [[Bimmisaari]] quietly withdrew. Luckily for the Bimms, their homeworld was remote enough that few took notice of this, allowing their people to escape most of the chaos of the Republic's fall and the later oppression of the Galactic Empire. \n\nAfter the Battle of [[Endor]], the Bimms remained neutral, but friendly toward the Alliance to Restore the Republic and later, the New Republic. One Bimm who defied the pacifist Bimm norm during the Galactic Civil War was the false [[Kadann]], a Near-Human Bimm and Imperial Intelligence agent who impersonated the Prophet of the Dark Side [[Kadann]], and later declared himself Galactic Emperor. After the fall of the false Kadann, [[Leia Organa Solo]], [[Luke Skywalker]], and [[Han Solo]] were part of a New Republic mission in 9 ABY which was meant to open negotiations for the Bimms to join the Republic. The [[Shi'ido]] anthropologist [[Mammon Hoole]] included an entry on the Bimms in his publication The Essential Guide to Alien Species. \n\nDuring the [[Yuuzhan Vong]] War, the Bimms became one of the species most direly effected by the invasion of extragalactic invaders. <br />\n<br />\n'''Bimm in the Galaxy:''' <br />\nNear-Human Bimms were the most frequently encountered type of Bimms in the galaxy. While Near-Human Bimms who left their homeworld were typically entertainers or scholars, humanoid Bimms who went offworld were usually traders or businesspeople. Some Bimms became adventurers, whether as scoundrels who somehow worked their way into the circles of nobility, or as artists who followed heroes in order to witness great deeds which they could record in ballads. Entire communities of Bimms were also found in enclaves off [[Bimmisaari]], which were noted for their hospitality. \n\nThe Bimms also held great respect for the Jedi. Bimms of both species became Jedi during the days of the Galactic Republic. Even after the Republic's fall, tales of Jedi such as [[Murrtaggh]] were popular among Bimm bards. Even Bimmisaari's laws prohibiting visitors from carrying weapons were relaxed for visiting Jedi carrying lightsabers. \n\nDuring the time of the Clone Wars, a group of five Bimm investors visited the Cularin Trade Show, which was being held in the [[Cularin system]], aboard the starship [[TAV Prosperity]]. During the show, the ship suffered a hyperdrive failure in the region of the Cularin comet cloud, causing a booth to fall on the investors. \n\nBimm artists such as [[Ha'lathin]] or [[Vasnish Kay]], and traders and smugglers such as [[Rycar Ryjerd]]  and [[Rayc Ryjerd]], were typical of Bimms in the galaxy. <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 1D+1/4D<br />KNOWLEDGE 2D/4D<br />MECHANICAL 1D/2D+2<br />PERCEPTION 1D+1/4D+2<br />STRENGTH 1D/2D+2<br />TECHNICAL 1D/2D+1<br />\n<br />\n'''Move:''' 11/14 <br />\n'''Size:''' 1.0-1.5 meters tall <br />\n'''Source:''' Heir to the Empire Sourcebook (p.95-96) & Wookieepedia (For the Bimm Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Bimm",
  "retrievedAt": "2025-10-07T21:04:31.699Z"
}