{
  "title": "Bith",
  "pageId": 7839,
  "revisionId": 19098,
  "wikitext": "[[File:BithNEGAS.jpg|thumb|right|Bith]]\n\n'''Species:''' Bith <br />\n'''Home Planet:''' [[Clak’Dor VII]] <br />\n<br />\n'''Bith''' <br />\nBith were a peaceful, highly-evolved craniopod species native to the planet [[Clak'dor VII]]. Fully adapted to a civilized, high-technology lifestyle, Bith were found galaxy-wide at all levels of society, most notably as engineers, scientists, intellectuals, consultants, and musicians. Some Bith also possessed pronounced Force powers and existed as both Jedi and Sith in the galaxy. <br />\n<br />\n'''Biology & Appearance:''' <br />\nBith were craniopods with pale pink, yellow, or (rarely) green skin, large heads, large lidless eyes, toeless feet, and long fingers. Their thumb and small finger were both fully opposable. The Bith's internal systems were different from most humanoids, as the Bith had only one lung, and exhaled through their skin. Bith also lacked a proper nose, instead having highly sensitive olfactory organs hidden in the flaps of their cheeks. \n\nThe other Bith senses were also acute. Bith could sense the tonal qualities of sound as well as other races sensed colors. Their eyes, as big as a Menahuun's, were able to focus to 0.07 on the Gandok Scale and they could see microscopic details of nearby objects, but were extremely nearsighted as a result. An interesting side effect of their incredible sensors was the effect of sonic grenades, or screamers, on them. It was described as causing their heads to explode. Similarly, Bith had high manual dexterity which helped them manipulate fine tools, though their physical prowess with gross motor skills was only average. \n\nBith had even evolved past the need for sleep. Instead, they would slip into a light meditative trance, which allowed them to get as much rest in four hours as other species could get in eight. During this trance, Bith were still almost fully aware of their surroundings. A Bith's reproductive organs atrophied over time, as did the portions of their brain governing such impulses. As such, Bith were unable to reproduce naturally, instead relying on artificial conception and gestation. Mates brought genetic material to a Computer Mating Service for analysis against prospective mates. Bith children were created from genetic material from two parents, which was combined, fertilized, and incubated for a year. <br />\n<br />\n'''History:''' <br />\nBith were one of the galaxy's most ancient civilizations, with a history going back millions of years. This antiquity garnered respect in certain quarters, such as among the [[Gree]], who gave them more respect than other, \"younger\" species. Their society was highly regimented, with everything from mate selection to political leadership controlled by sophisticated computer programs. \n\nCirca 320 BBY, the Bith city-states of Nozho and Weogar engaged in a massive civil war using biological weapons over patent rights to a new hyperdrive. The aftermath of the Nozho–Weogar War destroyed Clak'dor VII's ecosystem and crippled the Bith industrial capacity, forcing the Bith to retreat to sealed cities and rely on imported goods and machinery to keep their society functioning. The [[Y'bith]], a subspecies of Bith, were descended from Bith whose genetic code was altered in the aftermath of a biological attack on Nozho. These \"ghost Bith\" resettled on [[Clak'dor IV]] and developed their own society, somewhat estranged from the Bith mainstream. \n\nIn 67 BBY, while [[Darth Plagueis]] and his master [[Darth Tenebrous]] were stationed on the planet [[Bal'demnic]], Plagueis killed the latter, stating that he planned to overthrow the Rule of Two, establishing a new order of his own, that would stay for a thousand years under his control.\n\nThe war also brought out a strong pacifistic streak in Bith culture. For example, they attempted to remain neutral during the Separatist Crisis, though they were eventually coerced into supporting the Confederacy of Independent Systems against the Galactic Republic. While they viewed the Republic as morally corrupt, they restricted their support of the CIS to technological and artistic contributions. Not all Bith joined with the Separatists, however—notably Jedi Master [[Ph'ton]], who served the Republic as a Senior General during the Clone Wars. Many other Bith had served the Republic as Jedi Consulars over the years: some of them were rumored to have survived the Great Jedi Purge by hiding on their homeworld. \n\nBoth the Clone Wars and the rise of the Galactic Empire made the Bith uneasy about conditions in the rest of the galaxy, with most Bith choosing to wait out the Dark Times within Clak'dor VII's sealed cities. After the Clone Wars ended, the Bith did not resist the Empire, instead putting their technical expertise at the service of the Imperial war machine. The Bith were horrified by the Empire, however, and were among the first species to be liberated by the New Republic in 5 ABY. The Bith did not emerge fully from their isolation until 8 ABY, shortly after the Hapans rejoined the Galactic community. <br />\n<br />\n'''Bith in the Galaxy:''' <br />\nEver since the Nozho-Weogar War, Clak'dor VII's main exports were the products of the Bith intellect. Many Bith worked as engineers, data analysts, or in other intellectual professions. Others used their intelligence, natural technical skills, and dexterity to work in the criminal underworld. Many Bith worked as cantina staff, since bartenders in Bith society held a position equivalent in many ways to priests in other cultures. The Intelligence Quartermaster for Imperial Intelligence during the Cold War was a Bith stationed on the Imperial Fleet. Their hearing also made Bith such as [[Figrin D'an]] and the [[Modal Nodes]](the house band in the [[Mos Eisley Cantina]] circa 0 BBY) excellent musicians. <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 1D/3D<br />KNOWLEDGE 2D/6D<br />MECHANICAL 2D/5D<br />PERCEPTION 2D/5D<br />STRENGTH 1D/2D<br />TECHNICAL 2D/5D<br />\n<br />\n'''Special Abilities:''' <br />\n''Vision:'' Bith have the ability to focus on microscopic objects, giving them a +1D to Perception skills involving objects less than 30 centimeters away. However, as a consequence of this, the Bith have become extremely myopic. They suffer a penalty of -1D for any visual based action more than 20 meters away and cannot see more than 40 meters under any circumstances.\n\n''Scent:'' Bith have well-developed senses of smell, giving them +1D to Perception skills when pertaining to actions and people within three meters.\n\n''Manual Dexterity:'' Although the Bith have low overall Dexterity scores, they do gain +1D to the performance of fine motor skills - picking pockets, surgery, fine tool operation, etc.- but not to gross motor skills such as blaster and dodge. <br />\n<br />\n'''Move:''' 5/8 <br />\n'''Size:''' 1.5-1.75 meters tall <br />\n'''Source:''' Galaxy Guide 4: Alien Races (p. 22-24) & Wookieepedia (For the Bith Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Bith",
  "retrievedAt": "2025-10-07T21:04:32.092Z"
}