{
  "title": "Bitthaevrian",
  "pageId": 8499,
  "revisionId": 19095,
  "wikitext": "[[File:Bitthaevrian.jpg|thumb|right|Bitthaevrian]]\n\n'''Species:''' Bitthaevrians <br />\n'''Home Planet:''' [[Guiteica]] <br />\n<br />\n'''Bitthaevrian''' <br />\nThe Bitthævrians were warlike, bipedal sapients native to [[Guiteica]], in the [[Kadok Regions]]. <br />\n<br />\n'''Biology & Appearance:''' <br />\nThe Bitthævrians were tall creatures with heavily muscled bodies. They had a leather-like skin protecting them from physical damage. The color of that hide was typically sandy pink or a rusty brown, but variations were wide, including tan-colored Bitthævrians living in equatorial areas and dark brown- or black-colored Bitthævrians living in the north. Bitthævrians also had a row sharp fangs,which jutted from their mouths. These fangs were used in personal combat. The knees and elbows of Bitthævrians were covered with sharp quills used in personal combat as piercing weapons. The quills were not particularly hard, and they were often broken or lost, but they were constantly replaced. As the Bitthævrian aged, those quills became more resilient and larger. Bitthævrians vision ranged into the infrared, allowing them to see heat sources (such as living beings or recently fired sidearms) in complete darkness. <br />\n<br />\n'''Society & Culture:''' <br />\nBitthævrian culture was based on personal combat and fighting readiness. The status of a Bitthævrian was based on his or her personal skill as a fighter, with the greatest warrior becoming the leader of their people. The leader was absolutely respected. People dishonoring a leader would be chased by Bitthævrians even if they left [[Guiteica]]. Being highly isolationist, Bitthævrians tended to leave only to pursue the most serious offenders. The personal weapon of a Bitthævrian was commonly the dematoil, a customized morningstar with Bitthævrian joint quills attached to the ball. Every time a Bitthævrian was defeated by another in personal combat, the winner was allowed to take the loser's biggest quill from his arm and attach it to his dematoil. <br />\n<br />\n''Naming Conventions:'' <br />\nBitthævrian naming convention was atypical, with a Bitthævrian having three or four names. The first name of a Bitthævrian was the season when he or she was born. There are seven seasons in [[Guiteica]]: Giil, Quul, Aul, Zuol, Tweil, Jael and Quaal. The second name is the family name, which was inherited from the mother's maternal surname. A male Bitthævrian adopted a third name when married: His wife's surname. The fourth name (third in females and single males) was the Bitthævrian's personal name, used normally only as a form of familiar address, by friends, family, and cohorts. <br />\n<br />\n'''History:''' <br />\nAt least five decades before the Battle of [[Yavin]], the Bitthævrians started a war in protest of Republic interference in the [[Kadok Regions]]. Right from the start the Republic played-up the threat posed by the Bitthævrians in order to gain allies to bolster its increasingly small armed forces.\n\nAt length the Republic defeated them with an army of Jedi and [[Kaleesh]]. The m'Yalfor'ac Order, one of the biggest Bitthævrian armies, killed several Jedi Knights, but they were eventually defeated. The Bitthævrians afterward hated the Republic as a whole, despising its values and methods. Although they were also unhappy with the Galactic Empire, they considered it to be the lesser of two evils. Bitthævrians also felt hatred towards any Force-user, due to the Jedi implication in their defeat, and towards Bothans because of the Bothan tendency to mislead, lie and avoid direct conflict, behavior which was anathema to the Bitthævrian beliefs. The Bitthævrian planetary defense force, the Guiteica Militia, was rebuilt around 2 ABY, led by Colonel Quaal Tavier Catharius of the m'Yalfor'ac Order as a continental army in l'Quart'a with support from the other fifteen continents of [[Guiteica]]. The m'Yalfor'ac Order considered the Rebel Alliance, as official heir of the Old Republic, to be an inherited enemy. However, their isolationist tendencies and use of obsolete equipment made them little threat to the Rebel Alliance; they mostly just became a headache for Moff Rhain Towith of [[Kadok Regions]]. \n\n[[Vulca Minerals]] tried to perform yttrium mining activities in [[Guiteica]], but the pushy attitude of Vulca officers led to a more aggressive attitude from the m'Yalfor'ac Order. The crisis was witnessed by Vulca officer and later Rebel lieutenant [[Ayla Shar]]. After that crisis, [[Kadok Resources]], a Bitthævrian-controlled operation, managed all of Guiteica's exports. <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 1D+2/4D<br />KNOWLEDGE 1D+2/4D+2<br />MECHANICAL 1D+2/3D+2<br />PERCEPTION 1D/4D+2<br />STRENGTH 2D/4D+2<br />TECHNICAL 1D/3D+1<br />\n<br />\n'''Special Abilities:''' <br />\n''Vision:'' Bitthaevrians can see infrared radiation, giving them the ability to see in complete darkness, provided there are heat differentials in the environment.\n\n''Natural Body Armor:'' The thick hide of the Bitthaevrians give them a +2 bonus against physical attacks.\n\n''Fangs:'' The Bitthaevrians' row of six teeth include six pairs of long fangs which do STR+2 damage.\n\n''Quills:'' The quills of a Bitthaevrians' arms and legs do STR+1D+2 when brawling. <br />\n<br />\n'''Story Factors:''' <br />\n''Isolation:'' A Bitthaevrian is seldom encountered off of [[Guiteica]]. The species generally holds the rest of the galaxy in low opinion, and individuals almost never venture beyond their homeworld. <br />\n<br />\n'''Move:''' 9/12 <br />\n'''Size:''' 1.7-2.2 meters tall <br />\n'''Source:''' Wookieepedia (For the Bitthaevrian Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Bitthaevrian",
  "retrievedAt": "2025-10-07T21:04:32.477Z"
}