{
  "title": "Blood Carver",
  "pageId": 8501,
  "revisionId": 19083,
  "wikitext": "[[File:250px-Blutcarver.jpg|thumb|right|Blood Carver]]\n\n'''Species:''' Blood Carver <br />\n'''Home Planet:''' [[Batorine]] <br />\n<br />\n'''Blood Carver''' <br />\nBlood Carvers were an almost insect-like alien race native to [[Batorine]]. <br />\n<br />\n'''Biology & Appearance:''' <br />\nBlood Carvers were humanoids with gold skin, dark eyes and beaklike noses. They believed in the Art Beyond Dying, and had orange blood. Their noses served as both olfactory and auditory systems. Among Blood Carvers, extension was an extreme form of probation, a temporary exile from one's clan. Tribal tattoos were common for Blood Carvers. <br />\n<br />\n'''Society & Culture:''' <br />\nTheir name officially came from the statues they carved from blood red trees. When a Blood Carver presented a statue, it immediately wanted flaws pointed out, while compliments were actually tantamount to insults. Creatures had been executed for complimenting works of art. The statues were made for the betterment of the tribe, not the individual. \n\nThe second reason for their name came from the fact that they were very skilled assassins, though it was quite rare for a Blood Carver to mutilate their target. A traditional Blood Carver prayer, offered before battle, ran, '''''\"May my blade be sharp. May I sculpt a new fate for my enemies.\"''''' <br />\n<br />\n'''History:''' <br />\nHundreds of years before the Battle of [[Naboo]], the [[Lontars]] invaded [[Batorine]] and nearly wiped out the Blood Carvers, who joined the Galactic Republic in 110 BBY. The survivors were taken to [[Coruscant]], where they stayed in seclusion. By 29 BBY, there were only several hundred of them left on the planet. Blood Carvers also had a colony on [[Alderaan]] before its destruction. Blood Carvers exiled from [[Batorine]] sometimes gravitated to small pocket colonies of their own species, sometimes as remote as [[Nar Shaddaa]] and other [[Outer Rim]] worlds. <br />\n<br />\n'''Blood Carver in the Galaxy:''' <br />\nOn [[Batorine]], Blood Carvers were fiercely loyal to their tribes. Those who ventured offworld projected that loyalty on their new companions. Except for exiles, Blood Carvers rarely traveled alone. They found flattery and excess alike offensive and usually disdained egoism or material wealth. Those showing hints of greed or pride were exiled from [[Batorine]]. <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 2D/4D+2<br />KNOWLEDGE 1D+1/3D+2<br />MECHANICAL 1D+2/4D+1<br />PERCEPTION 1D/3D+2<br />STRENGTH 1D+2/4D<br />TECHNICAL 1D+1/4D<br />\n<br />\n'''Special Abilities:''' <br />\n''Sneak Attack:'' If a Blood Carver faces an opponent who is unable to defend himself effectively from his attack, he can strike a vital spot for 1D of extra damage. This extra damage applies only to brawling and melee attacks or ranged attacks within 10 meters, and against opponents that have discernible anatomies.<br />\n<br />\n'''Move:''' 12/14 <br />\n'''Size:''' 2 meters tall on average <br />\n'''Source:''' Ultimate Alien Anthology (p. 25) & Wookieepedia (For the Blood Carver Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Blood%20Carver",
  "retrievedAt": "2025-10-07T21:04:32.946Z"
}