{
  "title": "Boltrunian",
  "pageId": 8503,
  "revisionId": 19081,
  "wikitext": "[[File:250px-MawTheBoltrunian-JK.jpg|thumb|250px|right|Boltrunian]]\n[[File:Boltrunian.jpg|thumb|250px|right|Boltrunian]]\n\n'''Species:''' Boltrunian <br />\n'''Home Planet:''' [[Boltrunia]] <br />\n<br />\n'''Boltrunian''' <br />\nBoltrunians were a large and muscular Near-Human species with hairless heads, craggy faces, wide noses, and heavy brow ridges. Boltrunians could live to be over 700 years old. Well-known Boltrunians included [[Warto]] and the Dark Jedi [[Maw]].\n\nIt is belived that they are related with the Trandoshians, because they suffer from same handling penalty and have also a regenerative abillity. Boltruanian are strong but clumsy and not as clever as humans. <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 1D+1/4D+1<br />KNOWLEDGE 1D/3D+1<br />MECHANICAL 1D+1/3D<br />PERCEPTION 2D/3D+2<br />STRENGTH 3D/4D+2<br />TECHNICAL 1D/2D+2<br />\n<br />\n'''Special Abilities:''' <br />\n''Vision:'' Boltrunian’ vision includes the ability to see in the infrared spectrum. They can see in darkness with no penalty, provided there are heat sources.\n\n''Clumsy:'' Boltrunian have poor manual dexterity. They have considerable difficulty performing actions which require precise finger movement and they suffer a penalty of -2D whenever they attempt an action of this kind. In addition, they also have some difficulty using weaponry that requires a substantially smaller finger such as blasters and blaster rifles; most weapons used by; [[Aqualish]], [[Trandoshans]] or Boltrunian have had their finger guards removed or redesigned to allow for the Boltrunians use.\n\n''Regeneration:'' Boltrunian can regenerate lost limbs (fingers, arms, legs and feet). Once per day, the Boltrunian must make a Moderate Strength or stamina roll. Success means that the limb regenerates by 10%. Failure indicates that the regeneration does not occur. <br />\n<br />\n'''Story Factors:''' <br />\n''Hostility:'' The Boltrunian are known as a belligerent species. They gain +1D to all intimidation rolls against non-Boltrunian. <br />\n<br />\n'''Move:''' 8/10 <br />\n'''Size:''' 1.9-2.4 meters tall <br />\n'''Source:''' Voren Na al´s ancient personal library folder for Alienspecies letter \"B\" ( with hand-written commentray from varies sources included a picture from Wookipedia.com, a D20 unknown Sources and D6 converted data ) & Wookieepedia (For the Boltrunian Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Boltrunian",
  "retrievedAt": "2025-10-07T21:04:33.347Z"
}