{
  "title": "Bosph",
  "pageId": 10582,
  "revisionId": 31336,
  "wikitext": "[[File:Bosph.jpg|thumb|right|Bosphs]]\n\n'''Species:''' Bosphs <br />\n'''Home Planet:''' [[Bosph]]<br />\n<br />\n'''Bosph''' <br />\nBosphs are short four-armed bipeds, with three fingered hands and feet native to the planet [[Bosph]]. They had a stocky, humanoid shape, although their semi-circular heads were attached directly to their torso, without a neck. Their heads were dominated by two multi-faceted eyes and a pair of horns. Their hands and feet each had three digits, and their skin color ranged from light brown to dark gray. They were isolationists by nature, with a deep respect for philosophy and religion. They have a superstition about unexplained phenomena which they attribute to '''''Yenntar '''''the “unknown spirits” they dwell around them. Bosph leaders were known to have sensitivity to the Force, and could control it to some degree. Certain Bosphs attained greatness, and were allowed to place their own personal glyphs on objects. The Bosphs maintained their space-faring history by tattooing elaborate starmaps on their skin. They call this tatooing tradition \"The Way of the Traveller\". <br />\n<br />\n'''Society & Culture:''' <br />\nBosphs were naturally talented at playing the [[Bosphon Geddy]]. <br />\n<br />\n'''History:''' <br />\nThe Bosphs recorded the history of their galactic travels by tattooing star maps on their skin.<br />\n<br />\n'''Bosph in the Galaxy:''' <br />\n[[Bora Boru]] was a Bosph. A Bosph bounty hunter answered Darth Vader's call to hunt [[Han Solo]] and the [[Millennium Falcon]] following the [[Battle of Hoth]] in 3 ABY.<br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 1D+2/3D+2<br />KNOWLEDGE 3D/5D<br />MECHANICAL 1D/3D<br />PERCEPTION 2D+2/4D+2<br />STRENGTH 3D/4D<br />TECHNICAL 1D/3D<br />\n<br />\n'''Story Factors:''' <br />\n''Isolationism: Bosphs'' are inherently solitary beings. They are also being isolated from the galaxy by the Imperial blockade of their system\n\n''Different Concept of Possession:'' Because of the unusual Bosph concept of possession, individuals often take others’ items without permission, believing that what belongs to all or that ownership comes from simply placing a glyph on an item.\n\n''Religious:'' Bosphs hold religion and philosophy in high regard and always try to follow some sort of religious code, be it abo b’Yentarr, Dim-U, or something else.<br />\n<br />\n'''Move:''' 7/9 <br />\n'''Size:''' 1.0-1.7 meters tall <br />\n'''Source:''' Alien Encounters (p. 31) & Wookieepedia (For the Bosphs Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Bosph",
  "retrievedAt": "2025-10-07T21:04:34.133Z"
}