{
  "title": "Bothan",
  "pageId": 7349,
  "revisionId": 19072,
  "wikitext": "[[File:Bothan.jpg|thumb|198px|right|Bothan]]\n\n'''Home Planet:''' [[Bothawui]] <br />\n\n'''Attribute Dice:''' 12D<br />DEXTERITY 1D/4D<br />KNOWLEDGE 2D/4D<br />MECHANICAL 1D/3D<br />PERCEPTION 3D/5D<br />STRENGTH 1D+2/3D+2<br />TECHNICAL 2D/4D+1<br />\n<br />\n'''Move:''' 10/12 <br />\n'''Size:''' 1.3-1.5 meters<br />\n'''Source:''' Alien Encounters (page 32), Ultimate Alien Anthology (pages 25-26) & Wookieepedia (For the Bothan description)\n\n[[File:180px-BothanConcept.jpg|right|thumb]]\n\n=='''Bothan'''==\n\nBothans (pronounced /'bɑθɪn/) were furry mammalian anthropoids, about 1.5 meters tall. Hailing from [[Bothawui]] and several colonies, Bothans differed in facial appearance and body structure with canine, feline, and equine features. They were known for being master politicians and spies, craving intrigue and subterfuge. \n\nThe Bothans were members of the Galactic Republic from at least 4,000 BBY, but likely from a significantly earlier point. Through numerous conflicts, most notably the Galactic Civil War, the Bothans remained officially neutral, although their famed Spynet always played each side and commercial interests sought profits. \n\nThe Bothans were famously credited with stealing the plans to the second [[Death Star]] during the Battle of [[Korriban]], enabling the Rebel Alliance to destroy the battlestation. They played a large role in the founding of the New Republic and in the development of its government. \n\nBothese was the name of the native language spoken by Bothans, where Botha was the written form. \n\n=='''Biology & Appearance'''==\n\nThey were a short race of furry humanoids who on average stood between 1.5 meters to 1.6 meters in height. Bothans were covered in fur which rippled in response to their emotional state by way of gentle ripplings. It was this trait that betrayed them when members of their kind intended to be duplicitious in their dealings with others. They were known to possess tapered pointed ears with both males and females sporting beards.\n\n=='''Society & Culture'''==\n\nBothan culture was guided by the philosophy and principles set forth in the ancient text known as the The Way, written by Golm Fervse'dra. In this \"Bothan Way\", the pursuit of power and influence was paramount. Thus, individual Bothans put their own political and economic success above all other concerns, and as a species, Bothans put their own advancement ahead of other intergalactic interests. The volume of backstabbing, subtle character assassination and political maneuvering in Bothan society was dizzying, and resulted in many species stereotyping Bothans as untrustworthy.\n\nIn times of crisis, the focus of Bothan society shifted to a survivalist state known as \"ar'krai\". When engaged in ar'krai, all fit Bothans volunteered to defend their species from impending annihilation. The last calling of ar'krai was during the [[Yuuzhan Vong]] invasion after the death of [[Borsk Fey'lya]] and the practical defeat of the New Republic.\n\n=='''History'''==\n\nTheir race evolved on the world of [[Bothawui]] whch was located in the [[Mid Rim]] and were known to had developed the technology to travel through the stars millennia ago whereupon they became long standing members of the galactic community.\n\nThe Bothans were said to had mastered the art of intelligence gathering as far back as 300 BBY and began exploiting it for personal gain. A hundred years later, they made contact with the Dressellians where they recognized that species potential and departed in order to allow them to evolve without interference. \n\nDuring the search for the new [[Death Star]], two dozen Bothans sacrificed their lives in order to attain the technical specifications for the space station. Furthermore, they learnt that the Emperor himself intended to inspect the Death Star II which paved the way for a Rebel attack at the unfinished weapon around [[Endor]].\n\n=='''Notable Bothans'''==\n\n*[[Asyr Sei'lar]] \n*[[Borsk Fey'lya]] \n*[[Hosk Trey'lis]] \n*[[Kai Hudorra]] \n*[[Koth Melan]] \n*[[Laryn Kre'fey]] \n*[[Oryon]] \n*[[Pers'lya]] - Supreme Chancellor of the Galactic Republic c. 12,000 BBY \n*[[Polo Se'lab]] \n*[[Traest Kre'fey]] \n*[[Nek Bwua'tu]] \n*[[Utric Sandov]] \n*[[Yaqeel Saav'etu]]\n\n=='''Sources'''==\nAlien Encounters (page 32), Ultimate Alien Anthology (pages 25-26) & Wookieepedia (For the Bothan description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Bothan",
  "retrievedAt": "2025-10-07T21:04:34.548Z"
}