{
  "title": "Caamasi",
  "pageId": 245,
  "revisionId": 19045,
  "wikitext": "[[File:CaamasiNEGAS.jpg|thumb|right|Caamasi]]\n\n'''Species:''' Caamasi <br />\n'''Home Planet:''' [[Caamas]] <br />\n<br />\n'''Caamasi''' <br />\nThe Caamasi (pronounced /kɑɑ'mɑsi/) were a species of furred humanoids known for their compassionate and peace-loving nature; indeed, the name Caamasi came to mean \"friend from afar\" and \"stranger to be trusted\" in some languages across the galaxy. <br />\n<br />\n'''Biology & Appearance:''' <br />\nCaamasi had a spicy, woody body scent that was similar to that of Corellian whiskey. They had long arms with thin, three-fingered hands. They also had extremely acute senses of smell. \n\nCaamasi had the interesting ability to share vivid memories called memnii with their near relatives and Jedi. A memnis was as vivid to one who received it as it was to the one participated in the event remembered. <br />\n<br />\n'''History:''' <br />\nCaamasi possessed great moral strength and respect for others. They were among the galaxy's finest diplomats and mediators, often solving severe conflicts in a matter of days. Senior Anthropologist Hoole witnessed the Caamasis' prowess firsthand when they negotiated peace between the [[Kubaz]] and the [[Verpine]]. \n\nUnfortunately, the Caamasis' pacifism was at odds with Emperor Palpatine's New Order, and they suffered greatly under Imperial rule. A few months after the end of the Clone Wars, the surface of their homeworld, [[Caamas]] was bombarded, killing millions. After the destruction of their planet's environment, many refugees moved to [[Alderaan]], [[Kerilt]] and [[Susevfi]]. \n\nThe bombardment was aided by a group of Bothans who sabotaged Caamas' shield generators. The Caamas Document detailed their involvement. Although many demanded that the Bothans purchase an uninhabited planet and terraform it according to Caamas' specifications, the Caamasi chose to forgive those who had betrayed them. \n\nIt was said in ancient legend that at the dawning of their age of existence, the Jedi came to the Caamasi for instruction on how to dictate the moral use of their powers, which could explain why the teachings of the Jedi Code have a great deal in common with the oft-inherent wisdom of the Caamasi, and perhaps another reason Palpatine felt it necessary to eliminate them. <br />\n<br />\n'''''Average Caamasi:''''' Dexterity 2D, Knowledge 2D+1, Mechanical 2D, Perception 2D+2, Strength 1D, Technical 2D. <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 1D+2/4D<br />KNOWLEDGE 2D/4D+1<br />MECHANICAL 1D/4D<br />PERCEPTION 2D/4D+2<br />STRENGTH 1D/3D<br />TECHNICAL 1D/4D<br />\n<br />\n'''Special Abilities:''' <br />\n''Memory Sharing:'' Caamasi can store and share memories with others of their species. Force-users can also share memories with Caamasi, though this requires a successful use of either [[Receptive Telepathy]] (to receive a memory) or [[Projective Telepathy]] (to share a memory).\n\n''Wise and Tranquil:'' Due to their reputation for being peaceful and wise, Caamasi gain a +2 pip bonus to all Bargain and Persuasion skill checks. <br />\n<br />\n'''Move:''' 10/12 <br />\n'''Size:''' 1.8 meters tall <br />\n'''Source:''' Wookieepedia (For the Caamasi Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Caamasi",
  "retrievedAt": "2025-10-07T21:04:38.218Z"
}