{
  "title": "Calian",
  "pageId": 14498,
  "revisionId": 30096,
  "wikitext": "[[File:Calian.png|thumb|right|Calian]]\n[[File:Ygal_dancing.png|thumb|right|Compared with baseline Humans such as Leia Organa (left), Calians such as Ygal Delois (right) had a distinctive red tan.]]\n[[File:Aron-dancing.jpg|thumb|right|Calians wore revealing, if garrish outfits.]]\n\n'''Species:''' [[Human]] - Calian <br />\n'''Home Planet:''' [[Shiva IV]] <br />\n<br />\n'''Calian''' <br />\nThe Calians were the Human inhabitants of the planet [[Shiva IV]], located in [[Wild Space]]. They were muscular beings, and the majority of them were strong and courageous. They were united into the [[Calian Confederacy]] and spoke Calian. For millennia they remained cut off and unknown both to the Republic and the Empire. \n\nBy Galactic standards, Calians were primitive and did not understand Basic; however, they did have repulsorcraft and blasters. \n\nThey were capable of entering [[ryastraad]], a battle madness similar to that of [[Wookiee]]s. The Calians reached peace with the neighboring [[T'Syriél]] only after long years of war. The Calians were attacked by the Galactic Empire, which bombarded a Calian city. The Calians ousted the Empire from [[Shiva IV]] with the help of [[Leia Organa]]. <br />\n<br />\n'''Biology & Appearance:''' <br />\nCalians were baseline Humans from the world of [[Shiva IV]]. Most of them shared the unique racial characteristic of having tanned red skin and dark hair. However, a few Calians such as Jain Havero had blond hair and a peach-colored complexion, which made them stand among the crowd. On top of that, a vast majority of Calians were slender and muscular. <br />\n<br />\n'''Society & Culture:''' <br />\nContrary to many other Human cultures, the people of [[Shiva IV]] carried very little in the way of personal equipment. The Calians did not wear many layers and pieces of cloth. All males wore a type of harness that left most of their chest exposed and a knee-length loincloth attached at the waist by an ornated belt. Both sexes were fond of jewelry and ornaments. Males are clean shaven and wear their hair short, while females wore them long. Due to their isolation, the Calians did not normally speak Galactic Basic Standard, the most prevalent language in the galaxy, using a language of their own instead.  <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 2D/4D<br />KNOWLEDGE 2D/3D<br />MECHANICAL 2D/4D<br />PERCEPTION 2D/4D<br />STRENGTH 2D/5D<br />TECHNICAL 2D/4D<br />\n<br />\n'''Special Abilities:'''<br />\n* None Listed <br />\n'''Story Factors:'''<br />\n* None Known <br />\n'''Move:''' 10/12 <br />\n'''Size:''' 1.5-2.0 meters tall <br />\n'''Source:''' Wookieepedia (For the Calian Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Calian",
  "retrievedAt": "2025-10-07T21:04:39.055Z"
}