{
  "title": "Calibop",
  "pageId": 10583,
  "revisionId": 20598,
  "wikitext": "[[File:Calibop.jpg|thumb|right|Calibop]]\n\n'''Species:''' Calibop <br />\n'''Home Planet:''' [[Cali]] <br />\n<br />\n'''Calibop''' <br />\nCalibops were an avian sentient species known during the times of the New Republic. The species had manes and prehensile wingtips. They also had a reputation of being better with words than with acts, something that not even the Calibops themselves argued. \n\nA number of Calibops were seen in the galaxy, including Chief of State [[Ponc Gavrisom]] of the New Republic, Sergeant at Arms [[Mif Kumas]] and a member of Boba Fett's Mandalorian Protectors.\n<br />\n<br />\n'''Biology & Appearance:''' <br />\nA Calibop was a tall avian sentient. At least one Calibop had pale blue eyes. A Calibop also had a mane of feathers that the individual could shake, sometimes indicating an easygoing criticism.\n\nA Calibop had a big beak that could be used to whinny in the species' equivalent to a sigh, or to expel sounds created in the depths of the Calibop's throat. A Calibop had a robust voice generated in the beak. \n\nCalibops had big wings that did not allow them to fly, but an individual could flutter them to increase his walking speed. The wings could be folded either in front or behind the person, and were strong enough to be used in melee combat. The tips of the wings were prehensile like fingers. Calibops used these as fingers to press keys, or to flicker restlessly. \n\nCalibops also had tails that they could flicker in what was considered the Calibop version of a shrug. <br />\n<br />\n'''Society & Culture:''' <br />\nThe Calibops had a reputation of being particularly rhetoric, even if it detracted their skill for other activities seen as more active. The Calibops themselves were familiar with their stigma, but many of them believed that words were useful at certain times, even if only actions could be useful at other times. <br />\n<br />\n'''History:''' <br />\nThe Calibops were known in the galaxy from at least 18 ABY. At that point, the Calibops were considered sentients. A Human from the Galactic Empire could shake hands with a Calibop.<br />\n<br />\n'''Calibop in the Galaxy:''' <br />\nA notorious Calibop in the galaxy was [[Ponc Gavrisom]], Chief of State of the New Republic from 18 ABY to 21 ABY, and signatory of the Bastion Accords of 19 ABY that marked an official ending to the Galactic Civil War. \n\nAnother Calibop, [[Mif Kumas]], was Sergeant at Arms of the Galactic Senate from 21 ABY to 27 ABY, when the august body was dissolved. \n\nIn 29 ABY, a tall Calibop was seen among the Mandalorian Protectors, also including Humans and Bothans, gathered by Boba Fett in [[Caluula Station]], soon before it was assaulted by the [[Yuuzhan Vong]] invaders. <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 2D/4D<br />KNOWLEDGE 2D+1/4D+1<br />MECHANICAL 2D/4D<br />PERCEPTION 2D/5D<br />STRENGTH 1D/3D<br />TECHNICAL 2D/4D<br />\n<br />\n'''Special Skills:''' <br />\n''STRENGTH-Flight:'' Time to use: One round. This is the skill used for flying. Beginning Calibops start with a flight movement of 14 and may improve their flying Move as described in the rulebook. Calibops can use flying in conjunction with one other skill in the same round without the normal -1D penalty. <br />\n<br />\n'''Special Abilities:''' <br />\n''Diplomats:'' At the time of character creation only, for every 1D placed in Bargain, Con, or Bureaucracy skills, the character gains a total of 2D in that skill. <br />\n<br />\n'''Story Factors:''' <br />\n''Avoid Conflict:'' Calibops are very averse to physical violence, and will seek a diplomatic solution whenever possible. <br />\n<br />\n'''Move:''' 10/12 (walking), 14/18 (flying) <br />\n'''Size:''' 1.8-2.2 meters tall <br />\n'''Source:''' Wookieepedia (For the Calibop Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Calibop",
  "retrievedAt": "2025-10-07T21:04:39.444Z"
}