{
  "title": "Caridan",
  "pageId": 8545,
  "revisionId": 19039,
  "wikitext": "[[File:Caridans.jpg|thumb|right|Caridans]]\n\n'''Species:''' Caridan <br />\n'''Home Planet:''' [[Carida]] <br />\n<br />\n'''Caridan''' <br />\nThe Caridan were a mammalian species of [[Carida]]. Average Caridans stood over two meters tall and possessed dense musculatures due to Carida's high gravity level. They spoke Caridan and most also spoke Basic. Caridan society was structured around a mercantile culture led by an active market and Caridan owned industrial firms. In fact, the Caridans were widely known for their appraisal and bartering skills. The Caridans cooperated with the Galactic Republic and later the Galactic Empire in the operation of the Academy of [[Carida]]. The Empire's xenophobia ignored the Caridans outside the Imperial compound, although tensions grew after the Battle of [[Yavin]]. Many Caridans vanished from the galaxy with the destruction of Carida at the hand of [[Kyp Durron]]. The few Caridans that survived were off-world as traders, New Republic operatives or fringers. Notable Caridans included Imperial Ambassador [[Furgan]] of [[Carida]]. \n<br />\n<br />\n'''Biology & Appearance:''' <br />\nCaridans average well over 2 meters in height, with long eyebrows and three-fingered hands. Their long, spindly looking legs are composed almost entirely of wiry muscle and end in two-toed, semi-hoofed feet. <br />\n<br />\n'''Caridans in the Galaxy:''' <br />\nFew Caridans ever left their homeworld before its destruction, though a few traveling Caridan merchants may yet survive in the galaxy at large, and a few more survive within the ranks of the New Republic military. <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 1D/2D+2<br />KNOWLEDGE 2D/4D<br />MECHANICAL 1D/3D+1<br />PERCEPTION 2D/4D<br />STRENGTH 3D/5D<br />TECHNICAL 2D/4D<br />\n<br />\n'''Special Abilities:''' <br />\n''Value Sense:'' Caridans get a +1D+1 bonus on value rolls.\n\n''Tough:'' Caridans get a +2 bonus on stamina rolls. <br />\n<br />\n'''Move:''' 10/12 <br />\n'''Size:''' Over 2 meters tall on average <br />\n'''Source:''' Wookieepedia (For the Caridan Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Caridan",
  "retrievedAt": "2025-10-07T21:04:39.853Z"
}