{
  "title": "Celegian",
  "pageId": 249,
  "revisionId": 19029,
  "wikitext": "[[File:CelegianUAA.jpg|thumb|right|Celegian]]\n\n'''Species:''' Celegian <br />\n'''Home Planet:''' [[Celegia]] <br />\n<br />\n'''Celegian''' <br />\nCelegians were a nonhumanoid species from [[Celegia]], a planet with raging seas in the [[Expansion Region]]. Celegians were relatively isolationist as a species, but had good relations with the Galactic Republic. \n\nOne of the most notable Celegians was [[Ooroo]], a Jedi Master during the [[Great Hyperspace War]]. <br />\n<br />\n'''Biology & Appearance:''' <br />\nCelegians appeared to many humanoids as \"floating brains.\" Very intelligent, they had a natural form of telekinesis that functioned like a repulsorlift. They breathed cyanogen, a gas poisonous to Humans. Conversely, oxygen was lethal to them, necessitating atmospheric transport chambers offworld. \n\nThe Celegians were greatly known for their massive intellect and wisdom. Their race evolved from ocean-dwelling invertebrates to the ancestors that eventually lived on land in [[Celegia]]. To move their jellyfish-like bodies, the Celegians created a form of locomotion similar to a repulsorlift generator. Their soft fleshy bodies, great tentacles, and dependence upon life-support chambers made the Celegians look as though they were always swimming or floating. Celegians communicated using a form of telepathy, and had no written or spoken language. \n\nCelegians tended to be explorers, and were often found in the company of other species with the same interests. Those Celegians that could be encountered away from their homeworld were usually scouts or diplomats, although a rare few were trained in the ways of the Force. <br />\n<br />\n'''''Average Celegian:''''' Dexterity 1D, Knowledge 3D, Mechanical 2D, Perception 2D, Strength 2D, Technical 2D <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 1D/3D<br />KNOWLEDGE 2D+2/5D<br />MECHANICAL 1D/4D<br />PERCEPTION 2D/4D<br />STRENGTH 1D/4D<br />TECHNICAL 1D/4D<br />\n<br />\n'''Special Abilities:''' <br />\n''Broadcast Telepathy:'' As their primary mode of communication, Celegians can speak telepathically with any number of creatures within 500 meters. Anyone wishing to resist this telepathic communication must make an opposed Willpower or Control skill roll against the Celegian's own Willpower or Control skill. This ability cannot be used to \"steal\" memories or information.\n\n''Excellent Swimmers:'' Celegian character gain a permanent +3D bonus to their Swimming skill.\n<br />\n<br />\n'''Story Factors:''' <br />\n''Cyanogen Breathers:'' Celegians cannot survive without their native atmosphere. After being exposed to an oxygen atmosphere for 1 round, a Celegian must make a Moderate Strength check, with the difficulty increasing by +4 for every round past the first. If successful, the Celegian remains conscious, but must continue to make Strength checks until returned to its native atmosphere. Failure indicates that the Celegian falls unconscious, and takes 1D damage. This damage is increased by +1D for each round afterwards (cumulative). Exposure to the cyanogen atmosphere has a similar effect on oxygen-breaters.\n\nCelegians outside of their environment exist in transparisteel life-support chambers. These chambers have an effective Body Strength rating of 4D+2 when resisting damage. <br />\n<br />\n'''Move:''' 6/8 (fly), 16/18 (swim) <br />\n'''Size:''' 1.7-2.2 meters tall <br />\n'''Source:''' Wookieepedia (For the Celegian Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Celegian",
  "retrievedAt": "2025-10-07T21:04:41.091Z"
}