{
  "title": "Cerean",
  "pageId": 9806,
  "revisionId": 19025,
  "wikitext": "[[File:CereanNEGAS.jpg|thumb|right|Cerean]]\n[[File:CereanFemale.jpg|thumb|right|Cerean]]\n\n'''Species:''' Cerean <br />\n'''Home Planet:''' [[Cerea]]<br />\n<br />\n'''Cerean''' <br />\nCereans were a sophisticated and cultured humanoid mammalian species hailing from the planet Cerea in the [[Mid Rim]]. They had tall tapering heads, which housed large binary brains, enabling them to focus on many things at the same time. Aside from this unique feature, Cereans were physically similar to Humans, although they possessed an extra heart, which supplied extra blood circulation to support their brains. \n\nCerean males aged more quickly than the females, who had similar lifespans to Humans. Thus, there were fewer males than females. Polygamous marriage was a necessity in order for the species to survive. Each male usually had one primary \"bond-wife\", and between four and ten \"honor-wives\". \n\nFamous for their extraordinary thinking abilities, Cereans were often found among the ranks of the Jedi Knights, being exempt from the Jedi's vow of celibacy due to their low birth rates. One such Jedi, [[Ki-Adi-Mundi]], served the Jedi High Council during and prior to the outbreak of the Clone Wars. <br />\n<br />\n'''Biology & Appearance:''' <br />\nThe Cereans' enlarged skulls, extending up to twenty centimeters above their foreheads, housed complex binary brains, provided with sufficient blood by an extra heart in their heads. The binary structure of Cerean thinking helped them to ponder two sides of an issue at once. It also enabled them to process information and solve problems rapidly and provided a highly advanced capacity for concentration and meditation. Because of their thoughtful nature, they tended to be calm, rational and analytical, preferring peaceful philosophies and a lifestyle which worked in harmony with nature. Though the quick-thinking Cereans had equally quick reflexes, they were commonly not as well coordinated as Humans. Because of the weight of their enlarged skulls, Cereans often had back problems. <br />\n<br />\n'''Society & Culture:''' <br />\nCereans developed a low–tech society on their homeworld and preferred to live in isolation from the wider galaxy. During the years leading up to the Invasion of [[Naboo]], a generational dispute erupted on [[Cerea]] when the younger generation took up a rebellious stance against their low–tech society. Many Cerean youths wished to own such technology as was commonplace in the Galactic Republic, like starships and speeder bikes. This unrest was ultimately quelled by Jedi Knight [[Ki-Adi-Mundi]], who traced the instigator of the movement, [[Ephant Mon]], to [[Tatooine]].\n\nMany Cereans used specially-forged Kasha crystals as a meditational tool. By focusing one's thoughts while in contact with such crystals, distractions were eliminated, creating an exceptional meditation environment. Cerean Jedi sometimes incorporated these crystals into their lightsabers, providing great focus, even during intense physical combat.<br />\n<br />\n'''Cerean in the Galaxy:''' <br />\n[[Ki-Adi-Mundi]] served as Jedi Watchman for his home system, though he relinquished this post during the Clone Wars to fellow Cerean [[Tarr Seirr]]. When Seirr was also called away, the Cereans were left undefended and their planet was attacked by the Confederacy of Independent Systems. The death toll of the Battle of Cerea reached over one million, and included the family of [[Ki-Adi-Mundi]]. This led to the Cereans becoming even more removed from galactic affairs with the rise of the Galactic Empire. \n\nBy the time of the [[Yuuzhan Vong]] War, the Cereans had developed a unique Force tradition, known as the [[Ner Yan]]. This group used the Force to link their minds, although in a haphazard manner. [[Ka-Tu-Un]] was an adept of this tradition and was mistaken for a Jedi by the [[Yuuzhan Vong]]. <br />\n<br />\n'''''Average Cerean:''''' Dexterity 1D+1, Knowledge 2D+2, Mechanical 1D+2, Perception 2D+1, Strength 2D, Technical 2D. <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY: 2D/4D<br />KNOWLEDGE: 2D+1/5D+2<br />MECHANICAL: 2D/4D<br />PERCEPTION: 2D+1/5D<br />STRENGTH: 2D/4D<br />TECHNICAL: 1D+2/3D+1 <br />\n<br />\n'''Special Abilities:''' <br />\n''Binary Brain:'' If a Cerean fails a Knowledge or Perception roll (or a skill roll based on those attributes), the Cerean may immediately re-roll half the dice (rounded down) originally rolled and add the result to the original total that failed. <br />\n<br />\n'''Story Factors:''' <br />\n''Dual Hearts:'' Cereans can function with only one of these hearts, but the demands placed on their circulatory system by their binary brains are no laughing matter. A Cerean reduced to functioning on only one heart must sleep 2/3 of a given day to maintain his mental performance.\n<br />\n<br />\n'''Move:''' 11/12 <br />\n'''Size:''' Up to 2.2 meters tall <br />\n'''Source:''' Wookieepedia (For the Cerean Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Cerean",
  "retrievedAt": "2025-10-07T21:04:41.484Z"
}