{
  "title": "Cha´wen´he",
  "pageId": 8554,
  "revisionId": 30341,
  "wikitext": "[[File:Chawenhe.jpg|thumb|right|Cha'wen'he]]\n\n'''Species:''' Cha´wen´he <br />\n'''Home Planet:''' [[Wen’he’dinae]] <br />\n<br />\n'''Cha´wen´he''' <br />\nThe Cha'wen'he people of the planet Wen'he'dinae were among the galaxy's most distinctive looking species. Cha'wen'he had two thin legs, decimeter-long bony spikes on their heels, and scaly ovoid bodies. Their most distinctive feature was their three heads, mounted on flexible two-meter long necks. Their three heads were in constant motion, making them difficult to catch them unawares. Their mouths were also ringed with pseudo-fingers, allowing them to use their heads as hands. When threatened, Cha'wen'he could fight back with their heel spikes, or retract their heads into their bodies for protection. With necks fully extended, Cha'wen'he stood up to four meters tall. \n\nThough the Cha'wen'he had three heads, they did not have the split consciousness exhibited by the two-headed Troigs and Paaerduags. This was because their single brains were located in their bodies, rather than in their heads. However, their consciousness did have one peculiarity—Cha'wen'he could access knowledge and skills from a collective \"species memory\". Some of this knowledge, such as simple motor skills, would be accessed immediately by Cha'wen'he hatchlings. More complicated skills could take years to surface in a Cha'wen'he's mind, or even remain locked in their subconscious permanently. \n\nCha'wen'he, having evolved as herbivores on a planet teeming with predators, were typically nervous and excitable. Their society was organized in nomadic \"flocks\", whose informal leadership was constantly changing. This made it difficult for offworlders to arrange treaties with them, as an arrangement concluded with one flock might not be honored by their next leader, or by the next flock to live in the area. As a further frustration, Cha'wen'he owned all of their possessions and buildings communally. Though they learned to understand alien concepts such as \"private property\" and \"no trespassing\", they sometimes ignored them. \n\nCha'wen'he had been in contact with the Galactic Republic for millennia, enthusiastically traveling the spacelanes as scouts, explorers, and navigators. While the Cha'wen'he were under the nominal rule of the Galactic Empire, their tendency to ignore certain Imperial dictates led to incidents of brutal oppression. Due to the fluidity of their leadership and their nomadic lifestyle, these were often directed at the wrong Cha'wen'he. <br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 2D/4D<br />KNOWLEDGE 1D+2/3D+2<br />MECHANICAL 2D/3D+2<br />PERCEPTION 2D/4D<br />STRENGTH 2D/3D+1<br />TECHNICAL 1D/4D<br />\n<br />\n'''Special Abilities:''' <br />\n''Armor:'' Cha’wen’he get +1D physical, +2 energy armor when their heads are retracted and their scales are drawn close to protect the body. A Cha’wen’he character doing this must remain still and can do nothing else during ths round.\n\n''Species Memory:'' Cha’wen’he may select up to 10 standard skills; these skills are considered “species memory” skills. The character can advance these skills as if he or she had a teacher (see pages 13-14 of Star Wars, Second Edition). The character must pay the normal Character Point cost to advance the skills, but the learning time is three days if the skill is 4D or less; one week for 4D-7D; and two weeks for skill codes over 7D. The player must make this list prior to beginniong play and the gamemaster has the right to reject or subsitute certain skills at will.\n\n''Bony Spur:'' The Cha’wen’he’s bony spur causes STR+1D damage.\n\n''Search:'' Cha’wen’he gain a bonus if more than one head is being used to scan an area. If two heads are being used the bonus is +1D; if all three heads are being used, the bonus is +2D. However, no other actions may be performed while this scanning is being done. <br />\n<br />\n'''Move:''' 12/14 <br />\n'''Size:''' 3.5-4 meters tall (with neck fully extended) <br />\n'''Source:''' Galaxy Guide 12 – Aliens: Enemies and Allies (p. 22-24) & Wookieepedia (For the Cha'wen'he Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Cha%C2%B4wen%C2%B4he",
  "retrievedAt": "2025-10-07T21:04:45.316Z"
}