{
  "title": "Chadran-Fan",
  "pageId": 8547,
  "revisionId": 15890,
  "wikitext": "[[File:Chadra-Fan.jpg|thumb|192px]][[File:Chadra_fan.jpg|thumb|Chadra-Fan]]Chadra-Fan were covered from head to foot in fur. Their species evolved from small, arboreal rodents. The two different sexes of Chadra-Fan were indistinguishable to other species, though the Chadra-Fan could readily tell the difference using their powerful sense of smell. If a male and a female Chadra-Fan were interested in one another they released special pheromones that relayed their feelings. Chadra-Fan also had involuntary pheromones that conveyed information about their family line and created an aura of attractiveness. Other voluntary pheromones often conveyed a Chadra-Fan's state of emotion-anger, fear, or joy. Chadra-Fan even created more complex messages using their pheromones, though the pheromones when mixed sometimes caused confusion\n\n\n\n'''Home Planet''': [[Chadra|Chad]]\n\n'''Attribute Dice''': 12D\n*'''DEXTERITY 2D/4D'''\n*'''KNOWLEDGE 1D/3D'''\n*'''MECHANICAL 2D+1/4D+1'''\n*'''PERCEPTION 2D/5D'''\n*'''STRENGTH 1D/2D+1'''\n*'''TECHNICAL 2D/4D'''\n\n\n'''Special Abilities''':\n\n''Sight: ''The Chadra-Fan have the ability to see in the infrared and ultraviolet ranges, allowing them to see in all conditions short of absolute darkness.\n\n''Smell: ''The Chadra-Fan have extremely sensitive smelling which gives them a +2D bonus to their ''search ''skill.\n\n\n\n'''Story Factors:'''\n\n''Tinkerers: ''Any mechanical device left within reach of a Chadra-Fan has the potential to be disassembled and then reconstructed. However, it is not likely that the\n\nreconstructed device will have the same function as the original. Most droids will develop a pathological fear of Chadra-Fan.\n\n'''Move''': 5/7\n\n'''Size''': 1 meter tall\n\n'''Source: '''Galaxy Guide 4: Alien Races (pages 27-28)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Chadran-Fan",
  "retrievedAt": "2025-10-07T21:04:42.474Z"
}