{
  "title": "Chiss",
  "pageId": 253,
  "revisionId": 44425,
  "wikitext": "[[File:Chiss.jpg|250px|thumb|right|A typical Chiss officer]]\n\n'''Chiss'''<br />'''Home Planet:''' [[Csilla]]<br />'''Attribute Dice: 12D'''<br />'''DEXTERITY: 1D+1/4D'''<br />'''KNOWLEDGE: 1D+1/4D'''<br />'''MECHANICAL: 1D+1/4D'''<br />'''PERCEPTION: 1D+1/4D'''<br />'''STRENGTH: 1D+1/4D'''<br />'''TECHNICAL: 1D+1/4D'''\n\n'''Move: 10/12'''<br />'''Size''': 1.6 to 2.1 meters tall.<br />'''Average lifespan''': up to 80 years old\n\n'''Special Abilities:'''\n*'''Low Light Vision''': Chiss can see twice as far as a normal human in poor lighting conditions.\n*'''Skill Bonuses''': At the time of character creation only, Chiss characters gain 2D for every one die they assign to the Tactics, Command, and Scholar: Art skills.\n*'''Tactics''': Chiss characters receive a permanent +1D bonus to all Tactics skill rolls.\n\n'''Description'''\n\nThe Chiss and baseline Humans regarded each other as aliens, but genetic studies have indicated that the two peoples were close biological cousins, and it is not clear whether the differences between them were the product of straightforward evolutionary divergence and differing planetary habitats, or the result of genetic engineering similar to that which produced such hybrid species as the [[Massassi]] and [[Myke]].\n\nOutwardly, the Chiss were distinguished from baseline Humans by three clearly visible traits — blue skin, midnight-black hair, and glowing red eyes; but their blood was red. It is possible that these superficial features were the result of external factors in the biosphere of their ice-locked homeworld [[Csilla]]. Their coloration was said to be caused by the same atmospheric minerals that gave Csilla's glaciers their distinctive bluish tinge, and while less is known about the reasons for their distinctive glowing red eyes, an environmental reaction does seem to be involved, as Chiss eyes were observed to glow more brightly in more oxygenated atmospheres.\n\nBeyond these potentially superficial differences, it is not clear how far the Chiss diverged from Human norms. Although both Chiss and Humans speculated about distinct physiological differences, for instance in the vocal apparatus or skeletal structure, there is no firm proof of stark evolutionary differences. One theory put forward is that the Chiss were in fact descended from an ancient group of Human colonists who settled in the [[Unknown Regions]] long before the foundation of the [[Galactic Republic]] and were subsequently forgotten. There was, in fact, a Human sleeper ship colony established on [[Csilla]] around 27,500 BBY, though records of this were virtually nonexistent and it remained unknown how a remote area of the galaxy could have been trailblazed so far back.\n\nIt does seem that the Chiss possessed a faster-than-average metabolic rate, leading to a distinctively lean physique and maturity considered reached at around age ten or twelve.\n\nThe Chiss are a proud and highly intelligent species, valuing a knack for strategy and subterfuge over brute force. Although isolated in the Unknown Regions of the galaxy within their so-called “Chiss Ascendency,” the Chiss were singled out by the Empire as potential servants and allies because of their outsider status and their relative lack of moral qualms. It is not that Chiss are by nature evil, but that they value pragmatism and efficiency and recognize both those qualities reflected in the Empire. While as a nonhuman, non-Sith species, Chiss are regarded as second-class citizens within the Empire, the Chiss Ascendancy is permitted self-governance and supporters of a more diverse Empire often use the Chiss as an example of what the Empire can accomplish by welcoming other species. A few rare Chiss have even achieved official rank in the Imperial military and Imperial Intelligence.\n\n'''Source''': ''Galaxy Guide 16 - The Old Republic p. 150''",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Chiss",
  "retrievedAt": "2025-10-07T21:04:46.952Z"
}