{
  "title": "Cizerack",
  "pageId": 254,
  "revisionId": 30352,
  "wikitext": "[[File:cizerack.png|thumb|right|Cizerack]]'''''Cizerack''''' <br />\n<br />\n'''Species:''' Cizerack <br />\n'''Home Planet:''' [[Cashoulis]] <br />\n<br />\n'''''Quote:''''' 'I am faster then a speeding skimmer and superior to any Ram Python' ''I'm the queen bitch around here!'' <br />\n<br />\n'''Cizerack''' <br />\n'''Personality:''' <br />\nThe Cizerack culture tresses disipline and knowledge. The young females are sent to school where they are taught Damack Hatib (\"The Code Of Living\"). This code stresses individualism, freedom, and the work ethic. \"Any good feline is a working feline.\". Female cats are taught the value of their own self and that of the clan. \n\n''Note:'' A powerfull dicotomoy exsists between the sexes of this race. While the females are revered, the male Cizerack are kept as ignorant slaves, exsisting to perpetuate the race and perform menial labor. The Cizerack Government is clan-like. The matriachy is set up so that the oldest females rule the society. The cats are strong and territorial, each clan controlling a section of land headed by the Ratum Ala (\"den mother\").<br />\n<br />\n'''Physical Description:''' <br />\nLithe, strong, and fast are the three words that best describe this race of felines. The Cizerack are a race of large blue/black cat like creatures, indigenous to the planet [[Cashoulis]] of the [[Antares star system]]. like all cats the Cizerack are extremly fast and nimble, able to acheive speeds of up to 80KPH for short periods of time. <br />\n<br />\n'''''Attribute Dice:''''' 16D<br />DEXTERITY 2D/6D<br />KNOWLEDGE 1D/3D<br />MECHANICAL 1D/4D<br />PERCEPTION 2D/5D<br />STRENGTH 1D/5D<br />TECHNICAL 1D/4D<br />\n<br />\n'''Special Abilities:''' <br />\n''Exception Hearing and Sight:'' Due to the Cizarack's exceptional hearing and sight add 2D to all checks involving hearing and/or sight. \n\n''Night Vision:'' Their eyes filter out and enhance ambient light sources so that that the cat can see equally as good at night as they can during the day. Their eyes contain a small biological organism that reacts with its environment to produce a faint glowing light. Thus, the cats eyes glow at night. <br />\n\n''Leap:'' The Cizerack can leap up to 3m vertically and 5m horizontally. \n\n''Sensitive to Sonic Attacks:'' Cizerack are highly sensitive to sound, while this gives them great hearing it also makes them vulnerable to sonic attacks. Any weapon based on sound does +2 damage per die for damage. \n\n''Standing on Two Legs:'' Cizerack can stand on their hind legs, but all DEX rolls are at -3D (can't go lower then 1D) <br />\n\n''Unarmed Combat:'' Cizerack do Str +2D damage in unarmed combat due to claws and teeth.<br />\n<br />\n'''Special Equipment:''' <br />\n''Body Mount Harness:'' A weapons mount. It mounts directly to the back of a Cizerack cat. It is mechanicaly activated and fires straight ahead of the cat, allowing her the freedom to move on all fours and still engage the enemy. ''Cost:'' 1500 credits. \n\n''Look and Shoot Option:'' The harness is equiped with servo-motors and linked to a head set. The weapon will be aimed wherever the cat is looking at. ''Cost:'' 35000 credits. \n\n'''''Note:''''' Weapons need to be modified to fit into a BHM. ''Cost:'' 300 credits. <br />\n<br />\n'''Move:''' 20/5 on hind legs. <br />\n'''Size:''' 3' average at shoulder (aprox 6' when on hind legs) <br />\n'''Weight:''' 200 pounds on average <br />\n'''Source:''' [http://mackrafty.tripod.com/sw/holocron/a-f.htm Aliens A-F]; Battlelords of the 23<sup>rd</sup> Century",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Cizerack",
  "retrievedAt": "2025-10-07T21:04:47.774Z"
}