{
  "title": "Codru-Ji",
  "pageId": 8563,
  "revisionId": 18514,
  "wikitext": "[[File:250px-Codru-Ji_UAA.jpg|thumb|left|Codru-Ji]]\n[[File:CodruJi.jpg|thumb|right|Codru-Ji & Wyrwulf]]\n\n'''Species:''' Codru-Ji <br />\n'''Home Planet:''' [[Munto Codru]] <br />\n<br />\n'''Codru-Ji''' <br />\nThe Codru-Ji were a race of four-armed humanoids that inhabited the planet [[Munto Codru]]. Born as six legged canines known as wyrwulves, they encased themselves in a cocoon at puberty, emerging weeks later as an adult humanoid. Codru-Ji slept standing up, and communicated on a hypersonic level. \n\nAs their homeworld had very few significant exports, the Codru-Ji were able to stay isolated from the affairs of the Galactic Empire and the New Republic. This allowed them to concentrate on their own complicated internal politics. Leading Codru-Ji families were often the target of \"coup abductions\", ritualized kidnappings of children by political rivals. These abductions almost always ended with the payment of ransoms and the safe return of the children. \n\nOrnate stone castles were scattered across Munto Codru. These castles were produced not by the Codru-Ji, but by an unknown extinct civilization. Many Codru-Ji avoided these castles, considering them to be haunted. However, they were sometimes used as provincial capitals. \n\nIn 137 ABY, the citizens of Munto Codru were forced to join their tribes under the rule of the Empire controlled by [[Darth Krayt]] of the One Sith. A Sith Lord named [[Darth Kruhl]] personally visited the planet to coerce the Codru-Ji leaders into accepting Imperial rule and assassinate any opposing figure. <br />\n<br />\n'''Biology & Appearance:''' <br />\nThe Codru-Ji had a highly differentiated two-stage life cycle separating adults from adolescents. Codru-Ji children were born as meter long canids with the six limbs that were distinctive of all Codru-Ji. These pups, known as Wyrwulfs, were frequently mistaken by outsiders as no more than family pets, an impression aided by their inability to speak in anything more than snarls and growls. The juveniles were sociable, often licking guest as a sign of greeting, however, they could also deliver a strong bite to deter attackers. Wyrwulves were given affectionate nicknames such as \"Hrika\" or \"Lirri\" and did not receive their real names until adulthood. Wyrwulves mature for 8 years before entering a cocoon. They remained in this rubbery blue cocoon for a period of a few weeks before emerging in adult form. \n\nAdult Codru-Ji appeared as attractive humanoids, albeit with four arms. They lost the thick pelt of their earlier form, but retained other characteristics such as pointed ears, and they still appeared somewhat “canine-faced”. Codru-Ji hearing extended to a supersonic level undetectable to many species. The mature form averaged 1.6 meters in height. Of their four limbs, Codru-Ji had one primary hand, with which they were most skilled. The remainder were “off hands”, though still utile. An unusual trait of the Codru-Ji was that they slept standing upright. They developed sleeping harnesses to secure adults in this position. \n\nSome scientists speculated that the Codru-Ji were descended from a highly advanced, yet extinct, species that left a number of ruins on [[Munto Codru]].<br />\n<br />\n'''Society & Culture:''' <br />\nHighly xenophobic, Codru-Ji were reluctant to allow members of other species access to their society. Although not particularly afraid of off-worlders, the Codru-Ji were concerned that outside influences would \"rub off\" on their society. Several aspects of their culture, such as ritual kidnapping of children of political rivals, were considered barbaric by galactic standards, and as such the Codru-Ji thought it best to remain removed from the greater galactic scene.<br />\n<br />\n'''Notable Codru-Ji:''' <br />\n*[[Celia]] \n*[[Drako]] \n*[[Hyos]] \n*[[Iyon]] \n*[[Kassek-ka]] \n*[[Kirl]] \n*[[Rikki]] \n*[[Tassa]] \n*[[Rikkar-du]] \n*[[Jassar]]\n*[[Bo-attal]]\n*[[Unidentified Codru-Ji Clan Leader]]<br />\n<br />\n'''''Attribute Dice:''''' 12D<br />DEXTERITY 2D/4D<br />KNOWLEDGE 2D/4D<br />MECHANICAL 1D+2/4D<br />PERCEPTION 2D/4D<br />STRENGTH 2D/4D<br />TECHNICAL 1D+1/4D <br />\n<br />\n'''Special Abilities:'''<br />\n''Extra Limbs:'' Codru-Ji have four arms. The extra limbs give them a +1D bonus to climbing. The penalty for multiple actions involving different arms is reduced from –1D per additional action to –2. <br />\n<br />\n'''Move:''' 10/12 <br />\n'''Size:''' 1.6 meters tall on average <br />\n<br />\n-------------------------------------------------------------------------------------------------<br />\n'''''Wyrwulf'''''<br />\n'''''Attribute Dice:''''' 8D<br />DEXTERITY 1D/3D+1<br />KNOWLEDGE 1D/3D+1<br />MECHANICAL 1D/3D+1<br />PERCEPTION 1D/3D+1<br />STRENGTH 1D/3D<br />TECHNICAL 1D/3D+1<br />\n<br />\n'''Special Abilities:'''<br />\n''Small:'' Wyrwulves gain a +1D bonus to hide.\n\n''Hexapedal:'' Wyrwulves have six legs and receive a +1D bonus to Dexterity to stabilize themselves.<br />\n\n''Bite:'' Does STR+1D damage. <br />\n<br />\n'''Story Factors:'''<br />\n''Chrysalis:'' When a Wyrwulf reaches puberty, it transforms into a young Codru-Ji.<br />\n<br />\n'''Move:''' 10/12<br />\n'''Size:''' 1 meter long on average <br />\n'''Source:''' Ultimate Alien Anthology (p. 39-40) & Wookieepedia (For the Nuknog Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Codru-Ji",
  "retrievedAt": "2025-10-07T21:04:48.572Z"
}