{
  "title": "Colicoid",
  "pageId": 10585,
  "revisionId": 20600,
  "wikitext": "[[File:Colicoid.jpg|thumb|right|Colicoids ]]\n\n'''Species:''' Colicoids <br />\n'''Home Planet:''' [[Colla IV]] <br />\n<br />\n'''Colicoids''' <br />\nColicoids were a sentient insectoid species from [[Colla IV]]. They were carnivorous, and sometimes cannibalistic. Colicoids wishing to protect themselves were capable of forming themselves into a tight ball, an ability they emulated when designing the droideka, which they produced in their image. When the [[Trade Federation]] made their first purchase of droidekas, they paid with fifty shiploads of exotic flesh. The Colicoids had a strong dislike for the Jedi, something which intensified after the Invasion of [[Naboo]]. \n\nColicoids are the species that was primarily responsible for the creation of the droideka destroyer droids used by the Trade Federation in the subjugation of [[Naboo]]. They are a race of barbaric, cannibalistic aliens who rarely deal with outsiders, and often deal with their business partners in an overtly hostile manner. Their droids are unparalleled in design, and their ferocity and savagery has given them a dangerous reputation. They are squat, slender beings who, like their creations, can roll into a wheel shape and move at incredible speeds.\n\nColicoids were known to occasionally stop any travelers going through their system and eat them. After the Battle of [[Naboo]], the Colicoids took control of the spice mining operations on [[Kessel]] hoping to establish a strong inflow of credits. They also tried to acquire the rights to a spice processing plant on [[Nar Shaddaa]] but they had to deal with the slaver [[Krayn]] to obtain them. When the Clone Wars broke out, the Colicoids joined the Separatists, and provided them with many droid designs, including the droid tri-fighter and the [[Colicoid Annihilator]] droid. The Colicoids were the founders of the [[Colicoid Creation Nest]] amongst other companies. \n\nThe only known predator of Colicoids was the [[Hueche]], which was so feared that the sight of one would cause any Colicoid to reflexively form itself into a ball and roll away. This fear was such a deeply ingrained instinct that it remained even after Hueches were apparently driven to extinction, and even a holographic projection of a [[Hueche]] would have the same effect on a Colicoid. <br />\n<br />\n'''Personality:''' <br />\nSavage, brutal, and fanatical, Colicoids are a barbaric race of isolationists. They rarely show mercy, and are often aggressive and confrontational.<br />\n<br />\n'''Physical Description:''' <br />\nColicoids are short, squat aliens with a chitinous exoskeleton and the ability to roll their bodies up into a ball when needed. They have a frightening appearance, because despite all their technological advances, they still maintain a violent and brutish exterior.<br />\n<br />\n'''Language:''' <br />\nColicoids speak Colla. <br />\n<br />\n'''Example Names:''' <br />\nNo known names. <br />\n<br />\n'''Adventurers:''' <br />\nColicoids, being isolationists, rarely leave their homeplanet of [[Colla IV]]. When they do, it is usually because of exile from their own people, or because a rogue Colicoid decides that his homeworld no longer has anything to offer him. Many go on to become gladiatorial combatants in the [[Outer Rim]], while others take their droid construction secrets with them and begin producing their own droids.<br />\n<br />\n'''''Attribute Dice:''''' 13D<br />DEXTERITY 2D/5D<br />KNOWLEDGE 2D/4D<br />MECHANICAL 1D/4D<br />PERCEPTION 2D/4D<br />STRENGTH 2D/5D<br />TECHNICAL 1D/4D+2<br />\n<br />\n'''Special Abilities:''' <br />\n''Chitinous Bodies:'' Colicoids have a thick chitinous exoskeleton, which can protect them when in combat. Colicoids' chitinous bodies give them +1D vs. both physical and energy weapons.\n\n''Roll:'' By curling themselves tightly into balls, Colicoids increase their movement by +10. A rolling Colicoid may take no other action that round.<br />\n<br />\n'''Story Factors:''' <br />\n''Cannibalism:'' Colicoids are known cannibals, and are notoriously unfriendly to outside visitors, and are almost never found outside the Colla system. Very few survive trespassing in the [[Colla system]], as the isolationist Colicoids capture and consume outsiders.\n\n''Vicious Warriors:'' Colicoids are feared throughout their sector due to the savagery with which they fight. They are born into a warrior culture which teaches combat and fighting before death. Oftentimes a Colicoid will be aggressive, even if suicidally so, while in combat situations, but remain fully aware of the situation around them.<br />\n<br />\n'''Move:''' 6/10 <br />\n'''Size:''' 1.4-1.8 Meters tall <br />\n'''Source:''' Wookieepedia (For the Colicoids Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Colicoid",
  "retrievedAt": "2025-10-07T21:04:49.261Z"
}