{
  "title": "Cragmoloid",
  "pageId": 10577,
  "revisionId": 31564,
  "wikitext": "[[File:Cragmoloid.jpg|right|thumb|Cragmoloid]]\n\n[[File:Cragmoloid2.jpg|right|thumb|Cragmoloid]]\n\n'''Species:''' Cragmoloid<br />\n'''Home Planet:''' [[Ankus]] <br />\n<br />\n'''Cragmoloid''' <br />\nCragmoloids were a rare, sentient species of intimidating pachydermoids with massive builds. They had big, flat ears, manipulative trunks and a number of tusks that could be used in combat—and that were valued by hunters. They also had other less pachydermoid traits, including hands with five nailed fingers. Although prone to attacking in a rage, particularly when facing subterfuge, Cragmoloids disliked gratuitous violence and were a proud, peaceful people. Cragmoloids loved their families and tended to get depressed if separated from them. \n\nCragmoloids evolved on the rocky planet [[Ankus]]. They were enslaved by the [[Galactic Empire]] and their planet was strip-mined by [[TaggeCo]]. Cragmoloids also suffered frequent attacks by hunters who were after their valuable tusks. Due to this, many Cragmoloids accepted the humiliation of sawing off their own tusks. A small number of Cragmoloids left their world to earn a living among the stars. Some of these were Boulad, an information broker living on [[Coruscant]]; and [[Rooty]], a gambler and smuggler operating in [[Hutt Space]]. <br />\n<br />\n'''Biology & Appearance:''' <br />\nCragmoloids were sentient pachydermoids that resembled anthropomorphic elephants, or simply elephants walking on their hind legs. Cragmoloids had stiff, thick, leathery skin that protected them from damage, and two elephantine, flap-like ears. Among the folds of their skin, a Cragmoloid had two sharp, small, red, beady eyes, which opened wide when the individual was surprised. When crying, each of the eyes shed half a liter of water as a tear. \n\nAnother pachydermoid trait was the thick facial trunk, which was a manipulative organ: Cragmoloids used their trunk to frisk individuals. They also raised it in moments of surprise. Some Cragmoloids had two smaller, secondary trunks surrounding the main one. Cragmoloids also had natural tusks under the trunk. These could be used in combat to impale an opponent or during a wrath-driven charge. Some Cragmoloids had two big tusks, while others had four smaller ones. In any case, these tusks could be, and sometimes were, sawed off. \n\nCragmoloids were massive in size, commonly reaching three meters of height, and weighting over two hundred kilograms in adulthood. Not only big, but also very strong, cumbersome and intimidating, they commonly found that hiding their bulk was a difficult task. Other Cragmoloid physical traits were less pachydermoid: The top of the head presented coarse, stringy hair, at least in some cases. While Cragmoloids had three-toed, clawed feet, their massive five-fingered hands were humanoid in shape and had nails. \n\nCragmoloids began their adolescence at eight years of age, reaching biological maturity at fifteen. They typically suffered no ills of age before reaching forty, and were considered to be old only at eighty-seven. A Cragmoloid could easily reach the advanced age of one hundred and twenty years.<br />\n<br />\n'''Society & Culture:''' <br />\nThe Cragmoloid people were proud and valued a promise as a bond. They considered that losing one's tusks was a severe humiliation. They also preferred to face setbacks with direct answers instead of what they considered to be dishonorable tricks—something that did not stop them from pursuing careers in organized crime. Duplicity and deception commonly exasperated Cragmoloids, who were prone to violent attacks of rage when angered. Notwithstanding their physical prowess, Cragmoloids believed that unjustified violence was barbaric and to be avoided.\n\nTheir civilization was organized into clans. Cragmoloids were so close to their families that they suffered severe depressions if separated from their homes or their friends. A Cragmoloid always preferred chatting about kinship to talking about any other subject, and they commonly praised their direct relatives. Aliens speaking with a Cragmoloid sometimes resorted to asking about their families to obtain the Cragmoloid's trust—although only after enduring many minutes of speeches. Cragmoloids had one-word names. Common Cragmoloid names included Akoom, Darak, Ormoj, Urun, Vuula, Bachus, Ganesh and Trusk. \n\nCragmoloids were an isolated people, commonly speaking only [[Cragii]], the native language of their homeworld. Cragmoloids traveling to other planets commonly learned to speak, but not to read, Galactic Basic Standard. Punctuation in Cragii was not a widely-known subject on other worlds: A grunt could be construed to mean either acknowledgment, amusement or digestive upset.\n<br />\n<br />\n'''History:''' <br />\nThe Cragmoloids evolved on the plains of [[Ankus]], a rocky planet in one of the freestanding subsectors of the [[Mid Rim]]. At some point prior to 22 BBY, the Cragmoloids joined the galactic community. Although a number of Cragmoloids were identified as Force-sensitives, none of them became a Jedi Knight. The Cragmoloids also became prey to professional hunters, who killed the pachydermoids to keep the Cragmoloids' valuable tusks. This was not the species' only off-world threat: The Galactic Empire, created in 19 BBY, enslaved all the available Cragmoloids, and the company [[TaggeCo]] performed extensive mining on [[Ankus]]. These three factors pushed the Cragmoloid species towards extinction. As the Empire had caused some of their worries, a few Cragmoloids joined the Alliance to Restore the Republic, hoping to help their kin.<br />\n<br />\n'''Cragmoloid in the Galaxy:''' <br />\nCragmoloids were rarely seen in the galaxy, partly as they needed to adapt common appliances to their massive bulks. [[Boulad]], a Cragmoloid information broker in the Undercity of Coruscant, hollowed out a resiplex to create a dwelling appropriate for his size. Circa 18 BBY, [[Boulad]] sold [[Gregar Typho]] valuable information about Darth Sidious's presence on [[Mustafar]]. \n\nAt some point prior to 22 BBY, two three-meter tall Cragmoloids, [[Noba]] and [[Ook]], were captured on [[Ankus]] by the [[Chevin]] Dark Side Adept [[Phylus Mon]]. Mon jailed the Cragmoloids in his menagerie, the starship [[Animiasma]], along with other uncommonly seen aliens. Although the Cragmoloids were intimidating even behind bars, they were really very depressed over their situation. \n\nMost Cragmoloids were unable to escape Ankus to the stars during the Galactic Civil War. Those who could commonly decided to saw off their own tusks to avoid the threat of hunters, but to many this was an unbearable humiliation. The free Cragmoloids worked as scouts or with merchants, but the species was almost exclusively seen in Imperial work camps. \n\nAround 10 BBY, the Cragmoloid smuggler and gambler [[Rooty]] reached [[Nar Shaddaa]]. Ashamed for having turned his massive back to his planet, [[Rooty]] hoped to forget his disgrace in a hedonistic search of pleasure and rubbing shoulders with the likes of the smugglers [[Han Solo]], [[Salla Zend]] and [[Lando Calrissian]]. In 1 BBY, [[Rooty]] defeated Calrissian at [[Sabacc]], winning 20,000 bet that the [[Socorran]] had placed on his hand. Calrissian then admitted he had bet more credits than he actually had available, and offered an alternative payment to [[Rooty]]. Understanding that Calrissian was trying to cheat him, the Cragmoloid was enraged and physically threatened Calrissian. A certain [[Twi'lek]] offered to pay [[Rooty]] the remainder of the debt and, while [[Rooty]] agreed, he still retained a dislike for Calrissian in later times.<br />\n<br />\n'''''Average Cragmoloid:''''' Dexterity 1D+1, Knowledge 2D, Mechanical 1D+1, Perception 2D, Strength 3D, Technical 1D+1. <br />\n<br />\n'''''Attribute Dice:''''' 11D<br />DEXTERITY 1D/3D+1<br />KNOWLEDGE 1D+1/4D<br />MECHANICAL 1D/3D+1<br />PERCEPTION 1D+1/4D<br />STRENGTH 2D+1/5D<br />TECHNICAL 1D/3D+1<br />\n<br />\n'''Special Abilities:''' <br />\n''Long-Lived:'' Cragmoloids have life spans in excess of 400 years.\n\n''Tusks:'' Cragmoloids can use their tusks in combat, inflicting Strength +1D damage.<br />\n<br />\n'''Move:''' 10/12 <br />\n'''Size:''' 3 meters tall <br />\n'''Source:''' Wookieepedia (For the Cragmoloid Description)",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Cragmoloid",
  "retrievedAt": "2025-10-07T21:04:52.148Z"
}