{
  "title": "Crooloyan",
  "pageId": 8570,
  "revisionId": 33263,
  "wikitext": "'''Crooloyan'''\n\nBehind the facades of the huge Menotrop corporation hide the scaly faces of the Crooloyans. The legless species hates to leave its homeworld Crooloy, but their inventions, greed and mining ships have traveled all through the outer territories of the galaxy - spreading from the hot jungle world of Crooloy in the Mid Rim.\n\nThe single minded snakemen have an almost insectoid hive mind: The Crooloyans are Crooloy, Crooloy is Menotrop.\n\n'''Homeworld: '''Crooloy<br />'''Attribute Dice: '''11D<br />'''DEXTERITY: '''1D / 3D<br />'''KNOWLEDGE: '''2D / 4D<br />'''MECHANICAL: '''2D / 4D<br />'''PERCEPTION: '''1D / 3D+1<br />'''STRENGTH: '''2D+2 / 4D+2<br />'''TECHNICAL: '''2D / 5D\n\n'''Size: '''1.5 - 3.0m<br />'''Move: '''7/9\n\n'''Special Abilities'''\n*'''Skill Bonus''': At the time of character creation only, crooloyan characters gain 2D for every one die they assign to their build and repair skills.\n\n'''Story Factors'''\n*'''Xenophobia/Obedience''': Crooloyans believe themselves to be the crown of creation. They won't obey non-crooloyan leaders and laws, but will follow even the most moronic command of a superior crooloyan.\n'''Gamemaster Notes'''\n*I use Menotrop for whatever I adapt, change or convert to Star Wars D6. Menotrop also makes a great villain. If you need a greedy corporation, that does not know any morale - here it is!\n\n'''Appearance and Biology:'''\n\nCrooloyans are basically broad-shouldered, muscular snakemen with long snouts and small, black eyes. Roughly a third of their bodies is made up by humanoid upper torsos, with muscular arms, ending in dexterous hands with black claws, that are unsuitable for fighting, because they would break off, but perfect tools for fine mechanical work. Many crooloyans will have an individual pattern, of which claws they grow out and which they keep short, depending on their occupation. The rest is a long, tail, on which they \"sit\" most of the time. They never stop growing and old individuals (200+ years) can reach sizes of up to 3 meters and even more. Their skin color ranges from pale yellow (Siha) in Crooloy's deserts to deep green (Talha), brown (Braha) and blue (Nalha) in the jungles and near big bodies of water. Albino crooloyans are seen as gifts from the gods and many of them, if not all take on careers as priests, corporate execs and military leaders. The planet is ruled by the Nalhada, which translates into \"white-blue\".\n\nCrooloyans are cold blooded reptiles, who need a warm, humid climate to maintain their health. This is the number one reason for their low traveling ambitions. The Siha are the only exception, because they have adapted to the dry climate and the cold nights of the desert.\n\nCrooloyans lay 6-12 eggs, of which about 50% breed to hatchlings, that have a one out of three survival rating. Nalhada eggs are black and once discovered they are taken care of by the crooloyan government.\n\n'''History and Culture''':\n\nThe Crooloyans sprang from jungle inhabiting lizards and began creating art and language around 400,000 years ago.\n\nThe oldest surviving site built on crooloy are the holy temples of Nahha, which are around 50,000 years old. The crooloyans are masterful technicians and it is believed, that they almost wiped out their entire species in a series of planet spanning wars. No documents exists, that could prove this assumption, though. It is more a myth trying to explain the incredible hive-mindedness of the reptilian species.\n\nAfter the invention of hyperspace drives, they had a brief period of exploration and adventuring, but their bodies relied on their hot jungles too much to have sucess as a colonizing species.\n\nThe crooloyans quickly began to enjoy plan b: The Menotrop Corporation, which was the only survivor of the so-called Corporate War Era spilled its goods on the interstellar market and soon became a major player in the sector. The cold reptilian intellects combined with the technological competence displayed by the crooloyans paved the way to success.\n\nMenotrop never got a firm hold on the markets of the core or the colonies, because of the long-established corporations, that controlled these territories and the crooloyans' inability to adapt to human taste.\n\nInstead they became a successful supplier of ugly but extremely durable and reliable machinery and a major player in mining.\n\nCrooloy was a part of the Confederation of Independent Systems, but quickly fell in line with the new order, supplying components to such wonderful creations as the Star Destroyer, the Death Star or the Orbital Missile Platform. They were equally quick to strike deals with the Hutts and New Republic when the Empire's grip crumbled.\n\nThe planet, the military and the state-owned Menotrop Corporation is ruled by a council of albino senators and a high queen. This is in effect since the mythological conflict known as the crowning war or the uniting war.\n\n'''Technology Level''':\n\nThe crooloyans have invented their own hyperdrive technology about 14,000 years ago.\n\n'''Temperament''':\n\nCrooloyans almost never show emotions - for good and for bad. If a crooloyan is driven into an extreme condition, they usually don't know how to deal with it. While nobody would be bothered by a crooloyan who apparently ignores the victory celebrations around him, an angry crooloyan shows dangerously erratic behavior, often acting like a spoiled brat or even showing random violence.\n\n'''Trade and Technology''':\n\nThe Menotrop Corporation is Crooloy's last and only corporation.The produce EVERYTHING for the planetary market and some of their goods became galactic successes.\n\nMenotrop cargo and mining ships - heavily armed and armored despite their intended commercial purpose - are popular in the dangerous, pirate infested regions outside the reach of the republican/imperial forces, Menotrop starfighters - huge and expensive; almost crossbreeds with attack transports, easily replacing three weaker ships - are popular among security forces and bounty hunters who need a lot of fire power in a fast and maneuverable ship.\n\nThey make very durable and highly reliable blasters, machine components, armor suits, speeders and much more, but it all can be described as unsymmetrical, alien and with the color of clotted blood.\n\n'''Notes''':\n*I don't know if these guys make an interesting player species, but they are the mind and the body of the Menotrop Corporation.\n\n'''Suggested Skills''':\n*Most crooloyans make use of their edge in technology.\n\n'''Source''': Frank Voigt",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Crooloyan",
  "retrievedAt": "2025-10-07T21:04:52.983Z"
}