{
  "title": "Crystal Clone",
  "pageId": 10578,
  "revisionId": 33264,
  "wikitext": "'''Crystal Clones '''\n\n'''Attribute Dice''': 12D<br />'''DEXTERITY''': 2D / 4D<br />'''KNOWLEDGE''': 2D / 4D<br />'''MECHANICAL''': 2D / 4D<br />'''PERCEPTION''': 2D / 4D<br />'''STRENGTH''': 2D / 4D<br />'''TECHNICAL''': 2D / 4D\n\n'''Size''': Dependent on the person being cloned<br />'''Move''': Dependent on the person being cloned<br />'''Homeworld''': Foglo<br />'''Source''': Richard Greenleaf\n\n'''Special Abilities'''\n*'''Enhanced Sight''': Because Crystal Clones retain some of the cloning crystal within them, their vision is better than the being they are cloned from. This results in a +1D+2 bonus to all Perception attribute or Search skill checks.\n*'''Enhanced Stamina''': Because Crystal Clones retain some of the cloning crystal within them, a Crystal Clone can push themselves further than most beings can. This results in a +2D bonus to all Stamina checks.<br />However, the crystal within them is also fragile and can have a reverse effect if the Crystal Clone is wounded. When wounded, a Crystal Clone suffers a -2D penalty to all Stamina checks while still wounded. For each level above wounded status, subtract an extra 1D.\n*'''Resist Stun''': The cloning crystals of Foglo have the ability to absorb stun blasts. Because Crystal Clones retain some of the cloning crystal within them, this natural ability of the cloning crystals gives the clones a natural ability to resist being stunned. Roll 4D versus the stun damage roll. If the results are equal to/or higher than the stun damage roll, the clone resists being stunned.\n*'''Sense Cloning''': Every twenty years of a Crystal Clone's life, they can sense the imminent cloning of the being from which they have been cloned. Such senses usually draw the Crystal Clone to the cloning crystal from which they originated so as to be able to take care of the new born clones and raise them.<br />However, a Crystal Clone may attempt to resist such urges by making a successful Difficult Willpower roll. The greater they miss the roll by, the stronger the urge becomes until they must give up everything their doing to go and wait by the crystal until the new clones arrive. The first time they miss the Willpower roll, they must wait three days before they can a make another Willpower roll. If they miss four Willpower rolls in a row, then each time this happens add an addition three days for each time they miss.<br />Yet if they make a successful Willpower roll, then they do not have to make another for ten days. However, successfully resisting the urge is also dangerous as their is a 1D chance that they will be driven mad by the urge. If the results are one or six, then the clone is driven mad.<br />The madness lasts for 3D days for every four points by which they go over the Willpower roll. For example, four to seven points above results in being mad for 3D days, eight to eleven result in being mad for 6D days, etc. If they roll the Willpower roll exactly, or roll three points above it, and then roll a one or six to determine if resisting drives them made, then they suffer from madness for three days.\n\n'''Story Factors'''\n*'''Recognition''': Because Crystal Clones are clones, there is always the chance that a particular clone from a certain line will be recognized but someone they have never met. This could result in them being viewed as a twin to another Crystal Clone from the same line, the child or grandchild of an older Crystal Clone from the same line, or even as being immortal.<br />However, most likely being recognized will mean problems for a Crystal Clone. Someone looking for another member of the Crystal Clone's line to kill them, arrest them, or something else could easily mistake a Crystal Clone they have never met for the one they are after. If they had killed another member of the clone's line and see a different member of that line walking around, they could attempt to kill them to make sure their dead. Or the appearance of a different Crystal Clone from the same line could inspire fear of the dead rising from the grave in an individual or a local populace.\n*'''Sense Cloning''': Even if a Crystal Clone is taken from Foglo just after their birth and have no idea of the planet, every twenty years they begin dreaming about the planet. In particular the area where the cloning crystal that created them is located. These herald the imminent cloning of clones from the same being the crystal Clone was cloned from and begin two months before the cloning occurs. The dreams create an urge within the Crystal Clone to return to the cloning crystal from which they came. This urge may become so great that the Crystal Clone may ignore everything else to return to where they were born.<br />Upon arrival at the cloning crystal, they remain near the cloning crystal until the new crystal clones are created. Once the new crystal clones are created, they take one of the infants and either raise them themselves or find a home for them.\n\n'''Appearance and Biology'''\n\nA Crystal Clone's appearance is dependent on the appearance of the being they are cloned from and the clone's gender. Because Crystal Clones can be the opposite gender of the being they are cloned from, their appearance may be slightly more masculine or feminine when they are the opposite gender. That is, if the cloned being is male and the crystal clone is female, then she will look slightly more masculine than feminine. If the cloned being is male and the clone is male, then the clone will look like him at the various stages of his life as they age. If the clone grows older than the person being cloned, then one will get an idea of what that person would have looked like. Also, Crystal Clones will never develop the scars of the being's they are cloned from unless they receive those same scars themselves.\n\nBecause Crystal Clones look exactly like members of the species from which the being they are cloned belongs to, the only way to determine if they are actually Crystal Clones is to look into their eyes. In the corners of their eye are flakes of the cloning crystal that created the Crystal Clone. These flakes may be green, blue, red, or yellow and appear to in the shape of an octagon.\n\n'''Temperament'''\n\nGenerally, a Crystal Clone's temperament remains fairly close to the temperament of the being from whom they are cloned from. However, it is not uncommon for a Crystal Clone's temperament to be drastically different. If the cloned being is typically violent, then it is possible that one or more of their Crystal Clones could be just the opposite.",
  "license": "CC-BY-SA 3.0",
  "sourceUrl": "http://d6holocron.com/wiki/Crystal%20Clone",
  "retrievedAt": "2025-10-07T21:04:53.383Z"
}